Repository: moonymeric/Saving_Elensefar
Catalog: translations/*/*.po
Languages: ca, cs, hu, pl, sv

source: Saving Elensefar
ca: Salvem Elensefar!
cs: Záchrana Elensefaru
hu: Elensefar felszabadítása
pl: Ratując Elensefar
sv: Elensefars Undsättning

source: SE
cs: ZE
hu: EF
sv: EU

source: Meneldur, elvish mariner of Elensefar, is driven to sea by the same orcs who attacked the city. He must gather an army willing to fight for him to regain Elensefar, his adopted homeland.
hu: Meneldurt, Elensefar tünde hajósát a várost megtámadó orkok kikényszerítették a tengerre. Sereget kell gyűjtenie, amivel visszafoglalhatja Elensefart, választott hazáját.
pl: Meneldur, elficki żeglarz z miasta Elensefar, uciekając przed orkami wypływa w morze. Musi zebrać armię gotową do walki u jego boku o odzyskanie Elensefaru, jego przybranej ojczyzny.

source: (easiest)
hu: (legkönnyebb)

source: Mariner
cs: Námořník
hu: Tengerész

source: Navigator
cs: Navigátor
hu: Hajóskapitány

source: Admiral
cs: Admirál
hu: Admirális

source: (hardest)
hu: (legnehezebb)

source: Saving Elensefar Terrain
hu: Elensefar felszabadítása terep

source: Escaping the Orcs
ca: Fugint dels Orcs
cs: Únik před skřety
hu: Szökés az orkok elől
pl: Ucieczka przed Orkami
sv: Flykten från orcherna

source: This is the story of the time when Elensefar was a province in the vast kingdom of Wesnoth. It is the story of a time of great forgetfulness, when much of what was once known had been forgotten, but also of great knowledge. It is the story of Meneldur the Mariner, who used the newfound knowledge to resurrect some of the old. But, it is, most of all, the story of the voyage of his ship, and what he encountered while traveling the high seas...
ca: Aquesta història té lloc en un temps quan Elensefar era una província dins el vast regne de Wesnoth. És la història d'un temps caracteritzat per l'oblit de moltes coses abans conegudes, tanmateix també pels nous descobriments. És la història de Meneldur el Mariner, que va usar part dels nous descobriments per ressuscitar alguns dels vells. Principalment, però, és la història del viatge del seu vaixell, i d'allò que es va trobar mentre travessava l'ampli mar...
cs: Toto je příběh z časů, kdy byl Elensefar provincií rozlehlého království Wesnoth. Je to příběh o velkém zapomnění, kdy to, co bylo známo, upadlo v nevědomost. Je to ale také příběh o velkém poznání. Je to příběh Meneldura Námořníka, který se vydal vstříc novým obzorům, aby vzkřísil ty staré. Ale je to především příběh putování jeho lodi a o tom, co ho na širém moři potkalo...
hu: Ez a történet azokban az időkben játszódik, amikor Elensefar a hatalmas Wesnoth Királyság egy tartománya volt. A rég homályba veszett tudásnak állít emléket, amely tudást a későbbiekben elfeledtek. A történet hőse Meneldur, a tengerész, aki felfedezte a régi tudás egy szeletét, s annak segítségével újra feltámasztotta e tudás egy részét. A történet maga egy hajóútról szól, s arról, hogy mivel találkozott ezalatt...
pl: Oto opowieść o czasach, w których Elensefar był jedną z prowincji rozległego Królestwa Wesnoth. Oto opowieść o czasach zapomnienia, gdy przepadło wiele z tego, co niegdyś było znane. Ale to także opowieść o potędze wiedzy. Oto opowieść o Meneldurze Żeglarzu, który użył nowo odkrytej wiedzy do wskrzeszenia zapomnianych mądrości. Ale przede wszystkim jest to opowieść o wojażach jego okrętu i o tym, co spotkało go podczas podróży wśród rozległych mórz...
sv: Det här är historien om den tid då Elensefar var en provins i det vidsträckta kungadömet Wesnoth. Det är historien om en tid med mycket glömska, då mycket kunskap hade blivit bortglömd, men också en tid med stor kunnighet. Det är historien om Meneldur sjömannen, som använde sin nyfunna kunskap för att återfinna lite av den gamla. Men det är framför allt historien om hans skepp, och vad han stötte på under sina färder över oceanerna...

source: Before the tale begins, it is important to know that none of the seafaring men or elves, including Meneldur, were willing to travel far out of sight of the coast. Instead, they remained near land, and sailed only north and south, for they dimly remembered tales from Haldric's day, of dragons, and sea serpents, and snake-men, who lurked on the islands that lay to the west of the continent.
ca: Abans de l'inici de la història, cal recordar que no cap dels mariners elfs o humans, incloent-hi Meneldur, solien estar disposats a perdre de vista la costa. Al contrari, solien romandre prop de terra, i només navegaven cap al nord o sud, ja que encara recordaven vagament els contes del gran viatge de Haldric, de dragons, serps marines i hòmens serp, que habitaven a les illes a l'oest del continent.
cs: Dříve než započne vyprávění příběhu, je třeba říci, že nikdo z lidí ani elfů na lodi, včetně Meneldura, nehodlali cestovat nikam daleko mimo dohled země. Raději zůstávali blízko pobřeží a plavili se podél něj jen na sever a na jih. Matně si totiž vzpomínali na vyprávění o Haldrikovi, o tom, jak na ostrovech západně od kontinentu číhají nebezpečí ve formě drakonidů, mořských hadů a hadům podobných lidí.
hu: Mielőtt a történet elkezdődik, tisztáznunk kell, hogy a tengerre merészkedő hajósok, emberek, tündék, beleértve Meneldurt is, egyáltalán nem akartak a part menti vizektől eltávolodni. Ehelyett szorosan a part közelében hajóztak észak-déli irányban, mivel Haldric utazásáról csak keveset őrzött meg az emlékezet, s ezekben a mesékben a nyugatra elterülő szigeteket és a körülöttük lévő tengereket sárkányok, tengeri kígyók és kígyóemberek népesítették be.
pl: Jeszcze przed rozpoczęciem opowieści należy wspomnieć że żaden z żeglujących ludzi lub elfów, włączając Meneldura, nie chciał wyruszać w podróż dalszą niż sięgał wzrok z wybrzeży kontynentu. Pływano więc tylko do sąsiednich krain na północ i południe, ciągle pamiętając o opowieściach z czasów Haldrica, o smokach, wężach morskich oraz jaszczuroludach które czaiły się na wyspach na zachód od kontynentu.
sv: Innan berättelsen börjar så är det viktigt att veta att ingen av de sjöfarande människorna eller alverna, inkluderat Meneldur, var villiga att färdas långt ut till havs. Istället färdades de nära land och seglade enbart norr och söderut; detta för att de kände till vagt ihågkomna historier från Haldrics tid, om drakar, sjöodjur och ormmänniskor som bebodde öarna väster om kontinenten.

source: Meneldur was born in the northlands, in Wesmere, but was outcast from the elvish lands because of a conflict with the High Council. Thus, although an elf, Meneldur had pledged his loyalty to Elensefar, and thus to Wesnoth (but, significantly, not to Weldyn).
ca: Meneldur va nàixer a les terres del nord, en Wesmere, però havia sigut expulsat de terres elfes per un conflicte amb el 'Alt Consell'. Per tant, encara que era un elf, Meneldur havia jurat lleialtat a Elensefar, i a Wesnoth, doncs (però, significativament, no a Weldyn).
cs: Meneldur se narodil na severu, ve Wesmérii, ale z elfích zemí byl vyhnán po konfliktu s Velkou radou. Proto, ačkoli byl elf, Meneldur zaslíbil věrnost Elensefaru, a potažmo tedy i Wesnothu (ne však Weldynu).
hu: Meneldur az északi földeken született, Wesmereben, de nemkívánatossá vált a tünde társadalomban a Nagy Tanáccsal történt összetűzése miatt. Emiatt, tünde volta ellenére, Meneldur Elensefar hűséges polgárává vált, hűségessé Wenothhoz is (ami nem ugyanazt jelenti, hogy Weldynhez).
pl: Meneldur urodził się na północy, w Lasach Wesmere, został jednak wypędzony z elfich krain podczas konfliktu z Wysokim Konsulem. Tak więc, choć był elfem, Meneldur przysiągł wierność Elensefarowi, a zarazem Królestwu Wesnoth (lecz, co znamienne, nie Weldyn).
sv: Meneldur föddes i nordländerna, i Wesmere, men blev bannlyst från alvernas land på grund av en konflikt med det högsta rådet. Efter detta svor Meneldur, trots att han var en alv, trohet till Elensefar och därmed till Wesnoth (men anmärkningsvärt nog, inte till Weldyn).

source: Meneldur gathered around himself a crew of true Elensians; stout spearmen, and ruthless men of the saber. He also brought many of the archer from his elvish house out of the northlands, to sail with him on his ship.
hu: Meneldur tősgyökeres elensziekből verbuvált legénységet a hajójára; szikár lándzsásokat, könyörtelen vívókat. Tünde otthonából íjászokat hívott, s ezzel a társasággal járta a tengert.
pl: Meneldur zebrał wokół siebie drużynę prawdziwych Elensiańczyków: tęgich włóczników i srogich szpadzistów, którzy byli bezlitośni dla każdego przeciwnika. Wziął także ze sobą wielu łuczników z swego elfiego domu na północy, aby pomagali mu w prowadzeniu morskich wypraw.

source: Now our story begins. On a night about 10 years after he first came to Elensefar, Meneldur returned to Elensefar from a trading voyage to the Bay of Pearls. When Meneldur had landed in Elensefar, he went to the castle to recieve directions from the Lord of Elensefar as to where his new voyage was to wend. He was to travel south to the Elven peninsula, and trade with the southern elves.
ca: Ara és quan es comença la nostra història. Una nit, uns 10 anys després d'haver arribat per primera vegada a Elensefar, Meneldur atracava allí després d'un viatge de negocis a la Badia de les perles. Quan Meneldur va arribar a port en Elensefar, va dirigir-se al castell per rebre instruccions del Senyor d'Elensefar relatives al seu pròxim viatge. Les seues ordres eren viatjar cap al sud, a la península dels elfs dels sud, i comerciar amb ells.
cs: Tady náš příběh začíná. Stalo se to jedné noci, přibližně 10 let poté co Meneldur poprvé přišel do Elensefaru. Meneldur se právě vrátil do města z obchodní cesty do Zátoky perel. Po přistání se odebral do hradu k lordu Elensefaru pro instrukce a pokyny pro další cestu. Dostal za úkol vyrazit na obchodní plavbu k jižním elfům na Elfí poloostrov.
hu: Történetünk ezzel elkezdődik. Meneldur mintegy tíz évvel ezelőtt érkezett Elensefarba. Most épp a Gyöngyök Öbléből tért meg kereskedőhajójával, s a palotába ment, hogy az újabb célt megtudja Elensefar urától. Délre küldték, a tündék félszigetére, hogy a déli tündékkel kereskedjen.
pl: Teraz rozpoczyna się nasza historia. Pewnej nocy, w 10 lat po swojej pierwszej wizycie w Elensefarze, Meneldur powrócił do miasta z kupieckiej wyprawy z Plaży Pereł. Gdy wpłynął do miasta, udał się do zamku aby odebrać nowe rozkazy od Lorda Elensefaru, który miał mu wskazać nowy cel podróży. Miał wyruszyć na południe, do elfiego półwyspu, aby pohandlować z południowymi elfami.
sv: Vår historia börjar en natt ungefär tio år efter att Meneldur först kommit till Elensefar. Meneldur återvände till Elensefar efter en handelsresa till Pärlbukten. När han landstigit i Elensefar gick han till slottet för att få instruktioner av Elensefars furste om vart hans nästa resa skall bära av. Hans nya uppdrag blev att färdas till den södra delen av alvernas halvö, och att handla med sydalverna.

source: After the meeting, as Meneldur and his men headed back to their ship, they noticed a strange sound. A harsh sound. The sound of orcs! Elensefar was under attack, with no provocation. The city had been quickly overrun, before most of the people had even noticed.
ca: Després de la reunió, mentre Meneldur i els seus hòmens tornaven al seu vaixell, van sentir un estrany soroll. Un soroll aspre. El soroll dels orcs! Estaven atacant Elensefar, sense cap provocació! Havien capturat la ciutat ràpidament, tan apressa que molts ni s'havien adonat.
cs: Po audienci, když se Meneldur se svými muži odebíral zpátky na loď, zaslechli podivný hluk. Pronikavý hluk. Hluk, co vydává skřetí vojsko! Elensefar byl zčista jasna napaden, a to i přes to, že k tomu nezavdal žádnou příčinu. Město bylo obsazeno dřív, než se většina obyvatel stačila vzpamatovat.
hu: A találkozó után , ahogy legényeivel a hajójához tartott, különös hangot hallottak. Éles zajt. Orkok hangját! Elensefart váratlanul megtámadták az orkok. Mielőtt a lakók felocsúdhattak volna, már el is foglalták a várost.
pl: Po spotkaniu, w chwili gdy Meneldur i jego ludzie wracali do statków, usłyszeli dziwny dźwięk. Donośny i przeszywający. Dźwięk Orków! Elensefar został zaatakowany bez żadnej przyczyny. Miasto zostało szybko otoczone a większość mieszkańców nie zdołała nawet tego zauważyć.
sv: Efter mötet, när Meneldur och hans män är på väg tillbaka till skeppet, så hör de ett konstigt ljud. Ett strävt ljud. Ljudet av orcher! Elensefar var under attack, utan förvarning. Staden intogs snabbt, innan de flesta invånare hann märka det.

source: Meneldur had only one option left - get back on his boat and flee. But there were already orcs blocking his path to the harbor...
ca: A Meneldur només li quedava una alternativa - tornar al seu vaixell i fugir. Però ja hi havia orcs que bloquejaven el seu camí cap al port...
cs: Meneldurovi zbyla jediná možnost - dostat se na loď a uprchnout. Ale cesta do přístavu byla již také blokována skřety...
hu: Meneldurnak egy lehetősége maradt - visszatér a hajójára, és elmenekül. De az orkok elzárták a kikötőbe vezető utat...
pl: Meneldur miał tylko jedno wyjście - wrócić na statek i odpłynąć. Orkowie jednak blokowali już drogę do przystani...
sv: Meneldur hade bara ett val - att ta sig tillbaka till sitt skepp och fly. Men orcherna hade redan blockerat vägen till hamnen...

source: Orcish Pillagers
hu: Ork fosztogatók

source: Death of Meneldur
ca: Mort de Meneldur
cs: Meneldur zemře
hu: Meneldur elesik
pl: Śmierć Meneldura
sv: Meneldur dör

source: Death of Madru
ca: Mort de Madru
cs: Madru zemře
hu: Madru elesik
pl: Śmierć Madru
sv: Madru dör

source: Orcs! Orcs are attacking! There are too many, we can't fight them off, we have to reach the ship!
ca: Orcs! Ens estan atacant els orcs! Són massa, no els podem rebutjar, hem d'arribar al vaixell!
cs: Skřeti! Skřeti útočí! Je jich příliš mnoho, nemůžeme se jim postavit! Musíme se dostat na loď!
hu: Orkok! Támadnak az orkok! Túl sokan vannak, nem vehetjük fel velük a harcot, el kell érjük a hajónkat!
pl: Orkowie! Orkowie atakują! Jest ich za dużo, nie wygramy tej bitwy... musimy dostać się jakoś na pokład!
sv: Orcher! Orcher anfaller! De är för många, vi kan inte hålla dem undan! Vi måste till skeppet!

source: Aye aye, Cap'n. All men to the ship, quick as you can!
ca: Sí, sí, capità. Pugeu tots al vaixell, ara i ja!
cs: Jo jasně kapitáne. Všichni na loď a hoďte sebou!
hu: Úgy, úgy, kápó. Mindenki a hajóra, nyomás!
pl: Aye aye, Kapitanie. Wszyscy na okręt, najszybciej jak potraficie!
sv: Ajaj, kapten. Alle man till skeppet, för allt vad tygen håller!

source: Now, we go out to sea. I expect our city is doomed...
ca: Bé, ara anem cap a la mar. Crec que la nostra ciutat està perduda...
cs: Tak a teď vyrazíme na moře. Předpokládám, že po našem městě je veta...
hu: Irány a tenger! A városunknak sajnos befellegzett...
pl: Podnosić kotwicę, stawiać żagle, odpływamy! Mam dziwne przeczucie że nasze miasto jest stracone...
sv: Nu far vi till sjöss. Vår stad är dömd...

source: A Naval Engagement
ca: Encontre naval
cs: Námořní spojenectví
hu: Tengeri csata
pl: Abordaż
sv: En sammandrabbning till havs

source: Elensefar's Loyals
hu: Elensefari hazafiak

source: Black the Red
ca: Negre el Roig
cs: Rudý Černes
hu: Véreskezű Kalóz
pl: Czerwony Black
sv: Black Röde dör

source: Wesnothians
hu: Wesnothiak

source: Defeat enemy leader
ca: Derrota el líder enemic
cs: Poraz nepřátelského vůdce
hu: Legyőzöd az ellenséges vezért
pl: Pokonaj wrogiego przywódcę
sv: Besegra fiendens ledare

source: Death of Black the Red
ca: Mort de Negre el Roig
cs: Rudý Černes zemře
hu: Véreskezű Kalóz elesik
pl: Śmierć Czerwonego Blacka
sv: Black Röde dör

source: Why do you stop us? We seek help. I come from Elensefar, which, as far as we can tell, was just captured by orcs!
ca: Per què ens atureu? Busquem ajuda. Vinc d'Elensefar, que, pel que sabem, acaba de ser capturada pels orcs!
cs: Proč nás zastavujete? Hledáme pomoc. Jsme z Elensefaru, který je, aspoň co víme, právě obsazen skřety!
hu: Miért állítottatok meg minket? Segítségért megyünk. Elensefarból jöttünk, amit, amennyire meg tudtuk ítélni, épp most foglaltak el az orkok!
pl: Dlaczego nas zatrzymałeś? Potrzebujemy pomocy. Płynę z Elensefaru, który właśnie został zdobyty przez orków!
sv: Varför stoppar du oss? Vi söker hjälp. Jag kommer från Elensefar, som såvitt vi vet precis har blivit erövrat av orcher!

source: You are interfering with our mission; we are trying to chase down this magician pirate.
ca: Estàs interferint en la nostra missió, estem intentant capturar eixe mag pirata.
cs: Vstoupili jste do naší mise, snažíme se zajmout tohodle piráta magika.
hu: Keresztezed az utunkat; épp ezt a rabló mágust akarjuk elfogni.
pl: Przeszkadzasz nam w naszej misji, próbujemy złapać tego pirata parającego się magią.
sv: Du stör vårt uppdrag. Vi försöker jaga rätt på den där magikerpiraten.

source: I'm not a pirate! I also come from Elensefar, and I must have left port a few days before it was attacked. This is the first I've heard of it.
ca: No sóc cap pirata! També vinc d'Elensefar, i dec haver-la abandonada uns pocs dies abans que fóra atacada. És la primera cosa que he sentit d'açò.
cs: Nejsem pirát! Také jsem z Elensefaru a musel jsem odplout před několika dny. Poprvé slyším o útoku až teď.
hu: Én nem vagyok rabló! Én is Elensefarból jövök, pár nappal ezelőtt kellett eljöjjek a kikötőből. Most hallom először, hogy megtámadták a várost.
pl: Nie jestem piratem! Także płynę z Elensefaru, opuściłem port kilka dni temu.
sv: Jag är inte någon pirat! Jag kommer från Elensefar och måste ha lämnat hamnen några dagar innan attacken. Det här är första gången jag hör om det.

source: You dog, don't bother us with your lies! You attacked a ship of the Royal Navy with your spells, and now you will pay for it!
ca: Tu, gos, no ens molestes amb les teues mentires! Vas atacar una nau de l'Armada Reial amb els teus conjurs, i ara ho pagaràs!
cs: Pse, nekrm nás svými lžemi! Zaútočil jsi na loď královského námořnictva svými kouzly a teď za to zaplatíš!
hu: Te kutya, ne próbálj meg átverni a hazugságaiddal! Mágikus támadást intéztél a Királyi Haditengerészet egy hajója ellen, s most ezért bosszút állunk!
pl: Ty psie, nie dręcz nas swoimi kłamstwami! Zaatakowałeś swoimi czarami okręt Marynarki Królewskiej a teraz za to zapłacisz!
sv: Din hund, kom inte här med en massa lögner! Du anföll ett skepp från den kungliga flottan med dina besvärjelser och nu skall du få betala för det!

source: I need loyal warriors from Elensefar to help me on my quest. Black the Red, do you want to join me in retaking Elensefar from these orcs?
ca: Necessite lleials guerrers elensians que em puguen ajudar en la meua missió. Negre el Roig, voldries unir-te a mi per alliberar Elensefar d'aquestos orcs?
cs: Potřebuji pro svůj úkol pomoc oddaných válečníků z Elensefaru. Chceš se ke mně připojit a pokusit se osvobodit Elensefar od skřetů Rudý Černesi?
hu: Szükségem lenne megbízható harcosokra, akik segítenének a küldetésemben. Véreskezű, csatlakoznál hozzánk, hogy visszafoglaljuk Elensefart az orkoktól?
pl: Szukam lojalnych kompanów z Elensefaru, którzy pomogą mi w mojej misji. Black, może chcesz dołączyć do mej załogi i razem ze mną walczyć o odzyskanie Elensefaru?
sv: Jag behöver lojala soldater från Elensefar för att hjälpa mig på mitt uppdrag. Black Röde, vill du hjälpa mig att återta Elensefar från orcherna?

source: Outlaws, you mean! These Elensians are all the same. Troops, destroy them!
ca: Proscrits, sou tots uns proscrits! Tots els elensians sou iguals. Soldats, mateu-los!
cs: Takže vlastně sháníš psance! Ti elensiáni jsou všichni stejná verbež. Vojáci, zničte je!
hu: Banditákkal szövetkezel! Ezek az elensziek mind egyformák. Katonák, öljétek meg őket!
pl: Chyba myślałeś o banitach! Ci wszyscy Elesiańczycy są tacy sami. Żołnierze, zabić ich!
sv: Fredlösa menar du! Elenserna är likadana hela bunten. Trupper, förgör dem!

source: Why is a ship from Elensefar carrying bandits and thieves?
ca: Què fa un vaixell d'Elensefar ple de bandits i lladres?
cs: Proč je loď z Elensefaru plná banditů a zlodějů?
hu: Egy elensefari hajón miért vannak tolvajok és gyilkosok?
pl: Dlaczego statek z Elensefaru przewozi bandytów i złodzieji?
sv: Varför är ett skepp från Elensefar bemannat med tjuvar och banditer?

source: They come from the... less _wealthy_ parts of Elensefar. But they are still fiercely loyal to it. They will be good fighters. I will join, if you'll have me.
hu: Ők is a városban laknak... csak a kevésbé jómódú negyedekben. De attól még hűségesek a városukhoz. S megbízható harcosok. Csatlakozom, ha kimentesz szorult helyzetünkből.
pl: Oni pochodzą z... mało bogatych ziem Elensefaru. Ale są zawziętymi i lojalnymi towarzyszami! Będą dobrymi wojownikami. Dołączę do Ciebie jeśli tylko naprawdę tego chcesz.

source: Very well. Thats not so different from my own crew. Aldran - we will not fight you if you do not attack us, but you must let us go on our way.
ca: Molt bé. Tampoc se'n van molt de la meua tripulació. Aldran - no lluitarem contra tu si no ens ataques, però deus deixar-nos anar.
cs: Dobrá. Moje posádka má beztak podobné složení. Aldrane, nebudeme s vámi bojovat, pokud nás nenapadnete a necháte nás plout svou cestou.
hu: Rendben. Annyira nem is különböznek az én legénységemtől. Aldran - nem esik bántódásod, ha szabadon elvitorlázhatunk, engedj utunkra minket!
pl: Bardzo dobrze. Nie różnią się nawet tak bardzo od mojej załogi. Aldranie - nie będziemy walczyć z Tobą jeśli nas nie zaatakujesz, ale musisz teraz puścić nas wolno.
sv: Nåväl. Det är ungefär som min egen besättning. Aldran, vi kommer inte att slåss med er om ni inte anfaller oss, men du måste låta oss fortsätta.

source: Ha! I will bring you and your ally in to Weldyn to be tried for treason. And it does not matter it is two boats to one; I have already sent a boat to inform the King, and get reinforcements.
ca: Ha! Vos enduré a tu i al teu aliat a Weldyn per a que sigueu jutjats per traïció. I què més dóna si sou dos vaixells o un només, ja he enviat una altra nau per a informar el Rei i rebre reforços.
cs: Ha! Přivedu tebe a své spojence do Weldynu k výslechu za velezradu. A nezáleží na tom, jestli to bude jedna nebo dvě lodě. Už jem poslal člun se zprávou pro krále a žádostí o posily.
hu: Hő! Elviszlek téged is a szövetségeseiddel egyetemben Weldynbe, te hitszegő. S nem számít, hogy két hajóval állok szemben egymagam, egy csónakot már elküldtem erősítésért.
pl: Ha! Osobiście przetransporuję Ciebie i twoich sojuszników do Weldyn, zostaniecie osądzeni za zdradę! I nie ma dla mnie żadnego znaczenia że będę musiał zdobyć dwa okręty naraz. Właśnie wysłałem statek który przybędzie z posiłkami a przy okazji zawiadomi o tym co się tu stało Króla.
sv: Ha! Jag kommer att föra dig och dina allierade inför rätta i Weldyn för högförräderi. Det spelar inte någon roll att det är två båtar mot en. Jag har redan skickat en båt för att informera kungen och få förstärkningar.

source: Remember, crew, the healing grog is stored in those barrels.
hu: Emlékezzetek tengerészek, azokban a hordókban gyógyító grog van.

source: Ah, some nice, refreshing grog! *gulp*
hu: Ah, finom, frissítő grogocska! *nyel egyet*

source: Well, what is it anyway that you people want? Why did you help us?
ca: Bé, què és el que voleu en veritat? Per què ens vau ajudar?
cs: Takže co je to, co po nás vlastně chcete? Proč jste nám pomohli?
hu: Pontosan mit is akar a csapatotok? Miért is segítettetek?
pl: Czego chcą twoi ludzie? Dlaczego nam pomogliście?
sv: Nå, vad är det ni vill egentligen? Varför hjälpte ni oss?
