Repository: moonymeric/Saving_Elensefar
Catalog: translations/*/*.po
Languages: ca, cs, hu, pl, sv

source: The first enemy we will encounter will be the elves. Show them no mercy!
ca: El primer enemic que trobarem seran els elfs. A armes! Sense pietat!
cs: První nepřítel, s kterým se střetneme budou elfové. A žádné smilování pro ně!
hu: A tündékkel számolunk le először. Nincs kegyelem a számukra!
pl: Pierwszy przeciwnik z którym będziemy musieli sobie poradzi to elfy. Pokażmy im że nie mamy litości!
sv: Vår första motståndare blir alverna. Visa ingen nåd!

source: And we will show you none. Prepare to meet your doom!
ca: I et demostrarem la mateixa! Prepareu-vos per a la vostra perdició!
cs: Ani pro vás! Připravte se na svůj osud!
hu: Mi sem irgalmazunk nektek. Készüljetek a halálra!
pl: A my nic Ci nie pokażemy. Przygotuj się na spotkanie z zagładą!
sv: Och vi skall inte visa er någon. Bered er att gå under!

source: What? There appear to be elves blocking our path! Elves, why are you in our way?
ca: Què? Pareix que hi ha elfs bloquejant el nostre camí! Elfs, que feu ací?
cs: Co to? Objevili se elfové a blokují nám cestu! Proč nám stojíte v cestě, elfové?
hu: Ott tündék zárják el az utunkat! Tündék, miért álltok az utunkba?
pl: Co? Zdaje mi się że elfy blokują naszą drogę! Dlaczego to robicie?
sv: Vad? Alver blockerar vår väg! Alver, varför står ni i vägen?

source: We are here to kill you! After that, we will kill the orcs, but we must kill you first.
ca: Venim a matar-te! I després els orcs, però cal fer-ho tot amb un ordre.
cs: Jsme tu, abysme tě zabili! A potom zabijeme skřety. Ale nejdřív musíme zabít tebe.
hu: Téged kell megölnünk! Aztán elbánunk az orkokkal is, de te vagy az első számú célpont!
pl: To proste, jesteśmy tu żeby Cię zabić! Po twojej śmierci drudzy w kolejce są orkowie, ale Ty nie musisz się już tym martwić.
sv: Vi är här för att döda er! Efter det skall vi döda orcherna, men vi måste ta oss an er först.

source: Are you mad?! Well, if you are, I have no time to reason with you. Prepare to die!
ca: Esteu bojos? Bé, espere que no vos moleste, però no tinc temps per debatre amb vosaltres. Prepareu-vos per morir!
cs: Jsi se zbláznil?! Dobrá, jestli ty máš, já nemám čas se s tebou posuzovat. Připrav se na smrt!
hu: Megőrültetek?! Nos, nincs időm magyarázkodni. Ha így áll a helyzet, készüljetek a halálotokra!
pl: Oszaleliście?! Ale skoro tak sprawy się mają... przygotuj się na śmierć!
sv: Är ni galna?! Nå, även om ni är det, så har jag inte tid att försöka resonera med er. Bered er att dö!

source: We have come to take back Elensefar from the orcs! But remember, the men of Wesnoth will no doubt try to stop us, as will the elves. We must fight them too.
ca: Hem de reconquistar Elensefar als orcs! Però recordeu que també els wesnothians intentaran aturar-nos, com també ho faran els elfs. Devem lluitar contra tots ells.
cs: Přišli jsme vyrvat Elensefar z rukou skřetů! Ale uvědomte si, že lidé Wesnothu, stejně jako elfové, nás nemohou zastavit. Budeme s nimi muset také bojovat.
hu: Azért jöttünk, hogy visszafoglaljuk Elensefart az orkoktól! De ne felejtsétek el, hogy a wesnothiak is az ellenségeink, ahogy a tündék is. Ellenük is harcolnunk kell!
pl: Przybyliśmy tutaj aby odebrać Elensefar z rąk orków! Lecz pamiętajcie że Wesnothańczycy z pewnością będą chcieli nas zatrzymać. Ich też musimy pokonać.
sv: Vi har kommit för att återta Elensefar från orcherna! Men kom ihåg, wesnotherna kommer utan tvivel att försöka stoppa oss; och så även alverna. Vi måste strida mot dem också.

source: Indeed we will. You are a traitor to your country, and must die as one!
ca: Segur que ho farem. Eres un traïdor al nostre país, i moriràs com a tal!
cs: To vskutku budete. Jsi zrádce své země a musíš zemřít mezi prvními!
hu: Jól látod a helyzeted. Elárultad a hazádat, s ezért meg kell halnod!
pl: W rzeczy samej. Jesteś zdrajcą swojego własnego kraju i musisz umrzeć!
sv: Sannerligen. Du är en förrädare, och måste dö!

source: This looks like the area the men of Wesnoth have claimed to siege Elensefar from. Unfortunately, we must get past them to free the city.
ca: Pareix que aquest és el lloc que els wesnothians han elegit per iniciar el seu setge a la ciutat. Per desgràcia, haurem de superar-los per alliberar la ciutat.
cs: Vypadá to, že lidé Wesnothu obsadili oblast, odkud se dá Elensefar obléhat. Nenaštěstí musíme pro osvobození města projít skrz ně.
hu: Úgy tűnik, a wesnothiak elfoglalták ezt a területet, hogy innen ostromolják Elensefart. Pechünkre át kell vágnunk rajtuk, hogy felszabadíthassuk a várost.
pl: To mi wygląda na obszar gdzie Wesnothańczycy rozpoczynają swoje przygotowania do oblężenia Elensefaru. Niestety, musimy się przez nich przedostać żeby oswobodzić miasto.
sv: Detta måste vara platsen varifrån wesnotherna tänker belägra Elensefar. Tyvärr måste vi komma förbi dem för att kunna frita staden.

source: You will not get past us while I am alive. And even if you do, the elves will stop you. If you must be a traitor, pick one nation to betray, not two!
ca: No ens superaràs mentre estiga viu. I si ho feres, els elfs et mataran! Si has de ser el traïdor que has sigut sempre, al menys deuries trair només un país, no dos alhora!
cs: Neprojdete, dokud jsem naživu. A i kdybys to dokázal, elfové tě zastaví. Když už musíš být zrádce, buď jím jen pro jeden národ ne pro dva!
hu: Nem fogsz átvágni rajtunk, amíg én élek. Ha mégis megtennéd, a tündék állítanak meg. Ha már árulóvá lettél, egy népet árulj csak el, ne kettőt.
pl: Nie przejdziecie dopóki ja tu żyję i dowodzę. A nawet jeśli to zorbicie, elfy was zatrzymają. Jeśli musicie być zdrajcami, to wybierzcie jeden naród do zdrady a nie dwa!
sv: Ni kommer inte förbi så länge jag är i livet. Och även om ni gör det, så kommer alverna att stoppa er. Om du nödvändigtvis måste förråda ett land, välj ett, inte två!

source: What are you talking about? Oh, I see... my northern brethren have decided to attack me... Well, we will get past these Wesnothians first, and see what we can do then.
ca: Què estàs dient? Oh, ja veig.... els meus cosins del nord han decidit atacar-me. Bé, primer passarem per damunt d'aquestos wesnothians i després ja veurem què farem.
cs: O čem to mluvíš? Aha, už vím..., mí severní bratři se rozhodli na mě zaútočit... Nu, probijeme se nejdřív přes tyto wesnoťany a uvidíme, co budeme moct udělat pak.
hu: Miről beszélsz? Ja, értem... az északi tündék el akarnak fogni engem... Nos, először átvágunk a wesnothiakon, aztán meglátjuk, mit tehetünk.
pl: O czym Ty mówisz? Oh, już widzę... moi północni bracia zdecydowali się mnie zaatakować... Hmm, pierwsi pokonamy tych Wesnothańczyków i zobaczymy co potem można zrobić.
sv: Vad pratar du om? Åhå, jag förstår... Mina släktingar från norr har beslutat sig för att anfalla mig. Nå, vi tar oss förbi wesnotherna först, och ser vad vi kan göra sedan.

source: Prepare to die, Elensian scum!
ca: Prepara't per morir, porqueria elensiana!
cs: Připrav se zgebnout, elensiánská špíno!
hu: Készüljetek a halálra, elenszi csőcselék!
pl: Przygotujcie się na śmierć, Elesiańskie ścierwa!
sv: Bered er att dö, elensiska avskum!

source: We are in Elensefar's harbor, from where we will drive the orcs out into the faces of the elves. Although they are my brethren, we must not hold back from killing them because of it. Onward!
ca: Estem dins el port d'Elensefar, des d'ací els espentarem cap a les forces dels elfs. Encara que siguen cosins meus, no devem evitar matar-los per això. A per ells!
cs: Jsme v elensefarském přístavu. Odtud můžeme zahnat skřety přímo před meče elfů. Ačkoli jsou to mí bratři, nesmíme se kvůli tomu rozpakovat je zabít. Kupředu!
hu: Elensefar kikötőjében vagyunk, innen kiszorítjuk az orkokat a városból, neki a tündéknek. Habár én is tünde vagyok, ez ne tartson vissza titeket, hogy azokat a fickókat is kiirtsátok. Előre!
pl: Jesteśmy w porcie Elensefaru, skąd musimy skierowć armię orków prosto w ramiona elfów. I choć to moi bracia, nie musicie się z tego powodu powstrzymywać w wymiarzaniu im odpowiedniej kary... Naprzód!
sv: Vi är i Elensefars hamn, och härifrån driver vi orcherna mot alverna. Även om de tillhör mitt släkte så får vi inte hålla tillbaka på grund av det. Framåt!

source: Listen t' that! He really thinks 'e can kill us! We'll show 'im! Kill the invader!
ca: Sentiu el que diu! Pense que ens pot 'matà'! L'ensenyarem qui sap 'matà' ací!
cs: No slyšíte to! Si fakt myslí, že nás může zabít! Ukážem jim! Zabte vetřelce!
hu: Hallottátok ezt?! Ez télleg aszt hiszi, hogy kiszoríthat minket! Mutassuk meg neki! Halál a behatolókra!
pl: Posłuchajcie no tego! On naprawdę uważa że może nas pokonać! Zaraz mu pokażemy! Zabić najeźdźców!
sv: Hör på den! Han tror att han kan döda oss! Vi skall visa honom! Döda inkräktaren!

source: We are now in Elensefar's harbor. From now, we fight until the orcs are all out of our city! Then, it appears, we will have to deal with those Wesnothians who believe us to be traitors.
ca: Ja estem dins el port d'Elensefar. Des d'ací, haurem de fer fora als orcs! Després, pareix que caldrà ocupar-se d'eixos wesnothians que pensen que som traïdors.
cs: Jsme teď v elensefarském přístavu. Od teď budeme bojovat se skřety, dokud je všechny nevytlačíme z města. Pak, jak je vidět, se budeme muset utkat s těmi wesnoťany, kteří jsou přesvědčeni o naší zradě.
hu: Elensefar kikötőjében vagyunk. Mostantól addig harcolunk, míg élő ork van a városunkban! Aztán, úgy tűnik, le kell rendezzük a dolgot a wesnothiakkal is, akik árulónak tekinetenek minket.
pl: Jesteśmy w porcie Elensefaru. Od teraz będziemy stąd tak długo atakować orków aż przegnamy ich z naszego miasta! Później będziemy musieli dobić targu z tymi Wesnothańczykami ktorzy dalej sądzą że jesteśmy zdrajacami...
sv: Vi är i Elensefars hamn. Nu skall vi mota ut orcherna ur staden! Sedan ser det ut som att vi måste ta itu med de där wesnotherna som tror att vi är förrädare.

source: Yes, please, do that. Then we will not have to deal with the orcs, and only with you!
ca: Sí, molt bé, vos els deixem tots per vosaltres. Així no haurem de lluitar amb ells, només amb vosaltres!
cs: Ano, tak to prosím udělej. Pak se už nebudeme muset potýkat se skřety, ale jen s tebou!
hu: Igen, ez jó lesz. Ha az orkokkal nem kell foglalkoznunk, leszámolunk veled!
pl: Tak, prosimy, zrób to. Po tym nie będziemy zmuszeni do rozmów z orkami tylko z wami!
sv: Ja tack, gör det. Då behöver vi inte ta oss an orcherna, utan bara er!

source: What?... Oh, its elves, from the northlands. What do you want?
ca: Què? ... Oh, són elfs, de les terres del nord. Què voleu?
cs: Co...? Oh, to jsou elfové ze severu. Co chcete?
hu: Micsoda?... Ó, tündék az északi erdőkből. Mit kerestek itt?
pl: Co?... Oh, to elfy z północy. Czego chcecie?
sv: Vad? Åhå, det är alver, från norr. Vad vill ni?

source: You dead, traitor!
ca: La teua mort, traïdor!
cs: Už teď jsi mrtvý, zrádče!
hu: Halott vagy, áruló!
pl: Giń zdrajco!
sv: Se dig död, förrädare!

source: Whatever you say. We'll deal with you after we kill the orcs.
ca: Sí, sí, clar. Ja ens encarregarem de vosaltres després de matar els orcs.
cs: Cokoli si přeješ. Utkáme se s vámi, až se vypořádáme se skřety.
hu: Beszélj csak! Majd elbánunk veletek is, ha az orkokat már kiirtottuk.
pl: Porozmawiamy sobie kiedy pokonamy orków!
sv: Nåväl. Vi tar itu med er efter att vi dödat orcherna.

source: Elensefar may be ours, but there are still enemies to defeat. Onwards!
ca: Elensefar ja és nostra, però encara queden més enemics que vèncer. Avanceu!
cs: Elensefar by měl být náš. Ale stále jsou tu protivníci, co je třeba porazit. Kupředu!
hu: Elensefar már a miénk, de még vannak élő ellenségeink. Előre!
pl: Elensefar może należeć do nas, ale nasi wrogowie nie zostali w pełni pokonani. Naprzód!
sv: Elensefar må vara vårt, men det finns fortfarande fiender kvar att besegra. Framåt!

source: We have taken Elensefar and defeated the Wesnothians, but these Elves need attending to.
ca: Ja hem pres Elensefar i derrotat els wesnothians, però encara hem de parar atenció a eixos elfs.
cs: Získali jsme Elensefar a porazili Wesnoťany, ale je třeba pohlídat ještě ty elfy.
hu: Elensefart visszafoglaltuk, s a wesnothiakkal is leszámoltunk, de a tündékkel még el kell bánnunk.
pl: Odbiliśmy Elensefar i pokonaliśmy Wesnothańczyków, ale elfy dalej potrzebują naszej pomocy.
sv: Vi intog Elensefar och besegrade wesnotherna, men nu måste vi ta itu med de där alverna.

source: There are no enemies left - we have succeeded in retaking Elensefar.
ca: Ja no queden enemics - hem vençut! Elensefar és nostra!
cs: Nikdo z nepřátel nezbyl, osvobodili jsme Elensefar!
hu: Nincs több ellenségünk - sikerült visszafoglalnunk Elensefart.
pl: Wszyscy nasi wrogowie zostali pokonani - odnieśliśmy zwycięstwo.
sv: Det finns inga fiender kvar! Vi lyckades återta Elensefar!

source: The orcs had ransacked the city's coffers - now it's time for us to return the favor.
ca: Els orcs havien saquejat el tresor de la ciutat - és l'hora de retornar-los el favor.
cs: Skřeti vyrabovali městské truhlice a k nám se teď přiklonil příznivý osud.
hu: Az orkok kifosztották a kincseskamrákat - épp itt az ideje, hogy visszavegyük tőlük a rablott kincseket.
pl: Te orki splądrowały miejski skarbiec - nastał czas w którym szczęście w końcu się do nas uśmiechnęło.
sv: Orcherna har plundrat staden - ni skall vi återgälda tjänsten.

source: You find 300 pieces of gold!
ca: Trobes 300 peces d'or!
cs: Našel jsi 300 zlatých!
hu: Találtál 300 aranyat!
pl: Znalazłeś 300 sztuk złota!
sv: Du finner 300 guld!

source: You find 250 pieces of gold!
ca: Trobes 250 peces d'or!
cs: Našel jsi 250 zlatých!
hu: Találtál 250 aranyat!
pl: Znalazłeś 250 sztuk złota!
sv: Du finner 250 guld!

source: You find 200 pieces of gold!
ca: Trobes 200 peces d'or!
cs: Našel jsi 200 zlatých!
hu: Találtál 200 aranyat!
pl: Znalazłeś 200 sztuk złota!
sv: Du finner 200 guld!

source: Good work, men. Onwards, we have to retake the city also!
ca: Bon treball, soldats. Vinga, encara ens queda reprendre la ciutat!
cs: Dobrá práce posádko. Kupředu, ještě taky musíme získat město!
hu: Szép munka, fiúk. Előre, vegyük vissza a várost is!
pl: Dobra robota. Naprzód, musimy odbić miasto!
sv: Bra jobbat, mannar. Framåt, vi måste återta staden också!

source: Come on, we should go North and see if we can help defeat the elves.
ca: Anem al nord i mirem de derrotar eixos elfs.
cs: Pojďme, měli bychom jít na sever a zjistit, jestli můžem pomoct porazit elfy.
hu: Gyerünk, északra kell mennünk, hogy segítsünk a tündék megsemmisítésében.
pl: Musimy teraz udać się na północ i zobaczyć co tam słychać u elfów.
sv: Sätt fart, vi borde ta oss norrut och se om vi kan hjälpa till att besegra alverna.

source: The Wesnothians had much gold in their camp. It is ours now!
ca: Els wesnothians tenien molt or al seu campament. I ara és nostre!
cs: Wesnoťané měli ve svém táboře dost zlata. Teď je naše!
hu: A wesnothiak sok aranyat tartalékoltak a táborukban. Ez most már a miénk!
pl: Wesnothańczycy mieli dużo złota w obozie. Teraz to nasza własność!
sv: Wesnotherna hade mycket guld i sitt läger. Nu är det vårt!

source: You find 175 pieces of gold!
ca: Trobes 175 peces d'or!
cs: Našel jsi 175 zlatých!
hu: Találtál 175 aranyat!
pl: Znalazłeś 170 sztuk złota!
sv: Du finner 175 guld!

source: You find 150 pieces of gold!
ca: Trobes 150 peces d'or!
cs: Našel jsi 150 zlatých!
hu: Találtál 150 aranyat!
pl: Znalazłeś 150 sztuk złota!
sv: Du finner 150 guld!

source: Orcs still reside in the city! Come one, let us kill them too!
ca: Els orcs encara estan dins la ciutat! Anem, matem-los també!
cs: Skřeti jsou pořád ve městě! Pojďte je také sejmout!
hu: Az orkok még ellenállnak a városban! Gyerünk, füstöljük ki őket!
pl: Orkowie ciągle zajmują miasto! Ich także musimy pokonać!
sv: Det finns fortfarande orcher kvar i staden! Kom, vi dödar dem också!

source: Come on, we should go South and see if we can help defeat the Wesnothians.
ca: Vinga, deuríem anar al sud i derrotar eixos wesnothians.
cs: Pojďme, měli bysme jít na jih a zkusit porazit Wesnoťany.
hu: Gyerünk, délen még szükség van a fegyvereinkre a wesnothiak ellen.
pl: Dalej, powinnismy udać się teraz na południe, zobaczymy czy zdołamy pokonać Wesnothańczyków!
sv: Kom igen, vi borde marschera söderut och se om vi kan hjälpa till att besegra wesnotherna.

source: It seems the elves brought some of their treasure out of the northlands. More for us!
ca: Pareix que els elfs es van traure part del seu tresor des de les terres del nord. Millor per nosaltres!
cs: Vypadá to, že si elfové ze severu přinesli s sebou část svého pokladu. A teď je náš!
hu: Úgy látszik, a tündék hoztak egy kis aranytartalékot. Ez most a miénk!
pl: Wygląda na to że elfy przyniosły trochę swoich skarbów z północy. Tym lepiej dla nas!
sv: Det ser ut som att alverna tog med sig lite av sina skatter från nordländerna. Mer åt oss!

source: Yes, Elensefar is ours, finally. Well, Black the Red, we thank you for your help.
ca: Sí, Elensefar és nostra, per fi! Bé, Negre el Roig, t'agraïm la teua ajuda.
cs: Ano, Elensefar je konečně náš. Děkujeme ti za pomoc, Rudý Černesi.
hu: Igen, Elensefar végre a miénk. Nos, Véreskezű Kalóz, hálásak vagyunk a segítségedért.
pl: Tak, Elensefar jest w końcu wolny. Czerwony Blacku, dziękujemy Ci za twoją pomoc.
sv: Ja! Elensefar är äntligen vårt! Nå, Black Röde, vi tackar dig för din hjälp.

source: It was an honor to fight for you. I wonder where my people will go now... the orcs have surely taken our home by now.
ca: Ha sigut tot un honor lluitar amb vosaltres. Em pregunte a on anirà la meua gent ara que casa nostra ja haurà sigut arrasada pels orcs...
cs: Bylo mi ctí za tebe bojovat. Zajímalo by mě, kam teď moji lidé půjdou... skřeti už v současné době určitě zabrali náš domov.
hu: Megtiszteltetés volt veletek harcolni. Most vajon hova megy a népem... az orkok már biztosan elfoglalták az otthonunkat.
pl: To był zaszczyt walczyć dla Ciebie. Nie jestem pewny gdzie teraz pójdą moi ludzie... orkowie z pewnością zajęli już całą naszą wyspę.
sv: Det var en ära att slåss med dig. Jag undrar vart mitt folk skall ta vägen nu.... Orcherna måste ha erövrat vårt hem vid det här laget.

source: I'm sure we will have time to discuss that later. But for now, we must help those conquered by the orcs rebuild their city.
ca: Estic segur que tindrem més temps per debatre això. Però ara, devem ajudar als ciutadans a reconstruir la seua ciutat conquerida.
cs: Jsem si jistý, že o tom budeme mít čas později diskutovat. Ale prozatím musíme pomoci těm, které skřeti dobyli, s obnovou jejich města.
hu: Biztos vagyok benne, hogy ennek megbeszélésére még lesz időnk. De most segítenünk kell a városlakóknak, hogy újjáépítsék a várost.
pl: Jestem pewien że podyskutujemy o tym później. A teraz, musimy pomóc odbudować miasto i uwolnić jeńców.
sv: Det finns säkert tid att diskutera det senare. Men nu måste vi hjälpa till att återuppbygga staden.

source: The villagers are joining us!
hu: A falusiak csatlakoznak hozzánk!

source: Attacked at Sea
ca: Confrontació marina
cs: Ohrožen na moři
hu: Tengeri csata
pl: Atak na morzu.
sv: Under attack till havs

source: The city had fallen, but Meneldur and his crew had escaped. Leaving the harbor, and looking back at the city, they noticed something strange. The orcs were not burning the city and pillaging it, as was their habit; instead, they were leaving it alone, and concentrating on the Lord's castle. It was almost as if they wanted to control the city, instead of destroy it.
ca: La ciutat havia caigut, però Meneldur i la seua tripulació havien aconseguit fugir a temps. Tanmateix, quan van mirar la ciutat mentre eixien del port, van adonar-se que els orcs no estaven cremant i saquejant la ciutat, com era el seu hàbit; per contra, semblava que estaven concentrant-se en prendre el castell del Senyor, com si volgueren assumir la direcció de la ciutat, i no destruir-la casa per casa.
cs: Město padlo, ale Meneldur a jeho lidé uprchli. Opustili přístav. Když se dívali zpět k městu, zaznamenali zvláštní věc. Skřeti město nezapalovali ani nerabovali dle svého zvyku, místo toho ho nechávali být a soustředili se na hrad lorda. Skoro to vypadalo, že chtějí město ovládnout, namísto zničit.
hu: A város elesett, de Meneldur, s legénysége megszökött. Ahogy elhagyták a kikötőt, s visszanéztek a városra, valami szokatlant láttak. Az orkok nem gyújtották fel a várost, s nem is rombolták le, ahogy az szokásuk volt; ehelyett békén hagyták a várost, s csak a helytartó palotájára koncentráltak. Az egész olybá tűnt, mintha uralkodni akartak volna a városon, s nem elpusztítani.
pl: Miasto zostało zdobyte, jednak Meneldur i jego załoga uciekła. Opuszczając przystań spojrzeli raz jeszcze na miasto i zobaczyli coś dziwnego. Orkowie nie podpalali ani nie łupili miasta, koncentrowali się tylko na pałacu Lorda Elensefaru. Wszystko wskazywało na to że nie chcieli zniszczyć miasta tylko przejąć nad nim kontrolę.
sv: Staden hade fallit, men Meneldur och hans besättning hade flytt. När de lämnade hamnen och såg tillbaka på staden så märkte de något konstigt. Orcherna brände och plundrade inte staden, såsom var brukligt. Istället lät de den vara ifred och koncentrerade sig på furstens slott. Det var nästan som om de ville ta över staden stället för att förstöra den.

source: Meneldur was not sure exactly what this meant, but he knew one thing - if the city was not destroyed, then the people in it would not be either. Which meant that the city would still be worth rescuing. Thus, he and Madru, right there, vowed that, if they could, they would raise an army and return to Elensefar, to defeat the orcs and claim whatever of the city remained.
ca: Meneldur no sabia ben bé que volia dir això, però comprenia una cosa: si la ciutat no era destruïda, aleshores tots els seus habitants tampoc ho serien. Per tant, valia la pena intentar alliberar-la dels orcs. Tant ell com Madru, allí mateix, van jurar que, si podien, reclutarien tot un exèrcit i tornarien a Elensefar per derrotar els orcs i alliberar tot allò que quedara sencer.
cs: Meneldur si nebyl přesně jistý, co to znamená, ale jednu věc věděl - pokud město nebylo zničeno, tak nebyli zničeni ani jeho obyvatelé. Což znamenalo, že že stále mělo cenu ho zachránit. Proto si spolu s Madruem přímo na místě slíbili, že pokud to bude v jejich silách, tak seženou armádu a vrátí se do Elensefaru, porazí skřety a vymůžou zpět to, co z města zbyde.
hu: Meneldur nem tudta pontosan, mit is jelent ez, de egyvalamiben biztos volt - ha a várost nem pusztították el, akkor az embereket is megkímélték. Ez pedig azt jelenti, hogy van esély a megmentésére. Ezért ő és Madru ott helyben megesküdött, hogy ha képesek lesznek rá, akkora sereget gyűjtenek, hogy vissza tudják foglalni Elensefart, s megmentsék belőle, amit még meg lehet.
pl: Meneldur nie był pewien co o tym myśleć, ale wiedział jedną rzecz - jeśli miasto nie zostało zniszczone, ludzie którzy w nim mieszkali musieli zostać uwięzieni. Co znaczy że miasto ciągle potrzebuje pomocy. Tak więc Meneldur z Madru poprzysięgli sobie nawzajem iż zbiorą nową armię i wrócą do Elensefaru by zwyciężyć orków i uwolnić mieszkańców.
sv: Meneldur var inte säker på vad det här skulle betyda, men han visste en sak: om staden skonades så skulle folket i staden finnas kvar. Och det betydde att staden skulle vara värd att rädda. Han och Madru svor att de skulle samla ihop en armé och återvända till Elensefar för att besegra orcherna och återta vad som än fanns kvar av staden.

source: Pirates
hu: Kalózok

source: Chasers
hu: Üldözők

source: Pirate Galley
hu: Kalózgálya

source: Wesnothian Galley
hu: Wesnothi gálya

source: Stop, pirate! Surrender, or die!
ca: Alto, pirata! Rendix-te o mor!
cs: Stůjte piráti! Vzdejte se nebo zemřete!
hu: Megállj, rabló! Add meg magad, vagy meghalsz!
pl: Stój piracie! Poddaj się albo giń!
sv: Stanna, pirat! Ge dig eller dö!

source: Never!
ca: Mai!
cs: Nikdy!
hu: Soha!
pl: Nigdy!
sv: Aldrig!
