Repository: moonymeric/Saving_Elensefar
Catalog: translations/*/*.po
Languages: ca, cs, hu, pl, sv

source: Lower the gangplank! Throw the grapples! DON'T LET THEM ESCAPE!
ca: Baixeu la rampa! Tireu els garfis! NO ELS DEIXEU ESCAPAR!
cs: Připravte lávky! Zahákujte je! NESMÍ UTÉCT!
hu: Eresszétek le a csapóhidat! Dobjátok ki a fogóhorgonyokat! NEM SZÖKHETNEK MEG!
pl: Opuścić pomost! Na nich! NIE POZWÓLCIE IM UCIEC!
sv: Kasta över änterhakarna! Ut med landgången! LÅT DEM INTE KOMMA UNDAN!

source: What's going on here?
ca: Ei! Què està passant ací?
cs: Co se to tu děje?
hu: Mi folyik itt?
pl: Co się tu dzieje?
sv: Vad händer här?

source: So, you're getting involved too, eh? Stop that ship, men!
hu: Szóval te is beavatkozol, he? Állítsátok meg azt a hajót is!

source: Return to Elensefar
ca: Tornada a Elensefar
cs: Návrat do Elensefaru
hu: Visszatérés Elensefarba
pl: Powrót do Elensefaru
sv: Tillbaka till Elensefar

source: And so Meneldur helped the Wesfolk build ships. They built three sturdy galleons, which was enough to hold all of them. That is how few of that once great race remained.
ca: I d'aquesta manera, Meneldur va ajudar als wesfolk a construir vaixells. Van construir tres resistents galions, que n'eren prou per transportar-los tots. Ja només quedava això d'aquella gran raça.
cs: Meneldur pomohl Wesanům vybudovat lodě. Postavili tři robustní galeony,které byly dost velké, aby je všechny unesly. Tak málo zůstalo z tohoto kdysi velkého národa.
hu: Így Meneldur segített a wesfolkoknak hajót építeni. Három hatalmas szállítóhajót építettek, amely mindenkit befogadhatott. Mindenkit, aki egy egykor hatalmas fajból megmaradt.
pl: Meneldur pomógł Ludowi Wesfolk zbudować nowe statki. Wybudowano trzy galeony, które wystarczyły do pomieszczenia wszystkich mieszkańców wyspy. Oto jak niewiele pozostało po wielkiej rasie Wesfolk.
sv: Och så hjälpte Meneldur wesfolket att bygga deras skepp. De byggde tre bastanta galjoner som var stora nog att rymma dem allihop. Det är därför som så få av deras en gång så mångtaliga ras stannade kvar.

source: The necromancers who were on the ships cast a spell of darkness and swiftness over the boat. The next thing Meneldur and his men knew, they had reached the delta of the Great River, where Elensefar was built.
ca: Els nigromants a bord van teixir un conjur d'obscuritat i velocitat en voltant al botam. Quan Meneldur i els seus hòmens van voler saber on estaven, ja havien arribat al delta del Gran Riu, on Elensefar va ser construïda.
cs: Nekromanti na palubě zakouzlili na lodě kouzla temnoty a hbitosti. Ta další věc, kterou si Meneldur a jeho muži uvědomili, byla až ta, že vplouvají do delty Velké řeky, kde byl Elensefar vybudován.
hu: A holtidézők sötétséget és gyorsaságot varázsoltak a hajón. Meneldur és legénysége ezután csak azt vette észre, hogy hajóik a Nagy-folyó deltájában voltak, ahol Elensefar épült.
pl: Nekromanci którzy płynęli na statkach rzucili na wszystkie okręty czar mroku, który uniósł je nad wodę. Meneldur i jego ludzie wiedzieli że muszą dostać się do delty Wielkiej Rzeki, gdzie zbudowano Elensefar.
sv: Nekromanterna som var ombord på skeppen kastade en mörkrets och snabbhetens besvärjelse över båten. På ett ögonblick var Meneldur och hans mannar i den stora flodens delta, där Elensefar låg.

source: Well, now we are in the port of Elensefar... It is time to retake Elensefar, as we aided Blackmore. So... does anyone have an idea as to how to attack the city?
ca: Bé, ja estem prop del port d'Elensefar... És el moment de reprendre Elensefar, de la mateixa manera que vam ajudar Blackmore. Hum... algú té cap idea de cóm atacar la ciutat?
cs: Takže jsme před elensefarským přístavem... Je čas znovu získat Elensefar, tak jako jsme to udělali u Blackmoru. Nu..., má někdo nápad, jak zaútočit na město?
hu: Remek, itt vagyunk Elensefar kikötőjében... Ideje visszafoglalni Elensefart, miután megsegítettük Blackmoret. Akkor... valakinek valami ötlete a hogyan továbbra?
pl: Jesteśmy w porcie Elensefaru... Czas przejąć miasto, tak jak przejęliśmy Czarnogród. A więc... macie jakieś pomysły na atak?
sv: Vi är framme i Elensefars hamn... Det är dags att återta Elensefar, såsom vi bistod Blackmore. Vad tror ni är bästa sättet att anfalla staden på?

source: Black the Red's Idea
hu: Véreskezű Kalóz terve

source: Here; this is my plan. On the northern side of the river, there is a cave where smugglers hide their goods. I know some bandits who won't alert anyone if we land there.
ca: Mireu ací, aquest és el meu plan. Al costat de la vora més al nord del riu hi ha una cova on és els contrabandistes guarden les seues mercaderies. Conec a alguns d'ells que no avisaran a ningú si desembarcarem allà.
cs: Hle já mám tento plán. Na severní straně řeky je jeskyně, kde si pašeráci schovávají zboží. Znám pár banditů, co nebudou nikomu hlásit, pokud tam přistaneme.
hu: Nekem van. A folyó északi partján van a csempészek barlangja, ahol az áruikat szokták tárolni. Ismerek néhányat közülük, nem fognak bekeverni.
pl: Oto mój plan. Po północnej stronie rzeki jest jaskinia gdzie przemytnicy ukrywają swoje łupy. Znam kilku zbirów którzy nikogo nie zaalarmują jeśli tam wylądujemy.
sv: Hör upp, detta är min plan. På norra sidan av floden finns det en grotta där smugglare gömmer sitt gods. Jag känner några banditer som inte skulle säga ett knyst om vi landsteg där.

source: But they won't help us?
ca: Però ens ajudarien?
cs: A nepomohli by nám?
hu: S csatlakoznak hozzánk?
pl: A co z tymi przemytnikami, pomogą nam w walce?
sv: Men de hjälper oss inte?

source: Uhm... no, probably not. But we would be rather secretive, they probably wouldn't notice us.
ca: Uhmm... no, segurament no. De tota manera, seria prou secret, i segurament tardarien en saber-ho des de la ciutat.
cs: Hm... ne, pravděpodobně ne. Ale měli bysme to udělat skrytě, pak by nás nemuseli zaznamenat.
hu: Hát... nem, aligha. De legalább biztonságban partot érhetünk, s meglepetésszerűen támadhatunk.
pl: Uhm... nie, niestety nie. Ale musimy uważać, przypuszczam że nie będą się nas spodziewać.
sv: Hm... Nej, antagligen inte. Men om vi är tillräckligt tysta, då märker de oss säkert inte ändå.

source: Madru, do you have any suggestions?
ca: Madru, tu què en penses?
cs: Madru, máš ty nějaké nápady?
hu: Madru, neked mi a véleményed?
pl: Madru, masz jakąś propozycję?
sv: Madru, har du några andra förslag?

source: Well, we could always land on the south beach. There is a harbor there, and a quick route from there to inside the city.
ca: Bé, sempre podríem desembarcar en la platja del sud. Hi ha un port allà, i una via clara i descoberta cap a l'interior de la ciutat.
cs: No, měli bysme každopádně přistát na jižním pobřeží. Je tam přístaviště a jde se odtud dostat rychlou cestou přímo do města.
hu: A déli parton is kiköthetünk. ott van egy kikötő, s gyorsan elérhetjük a várost erről az oldalról.
pl: Hmm, zawsze możemy wylądować na plaży po południowej stronie. Jest tam przystań i krótka droga do centrum miasta.
sv: Tja, vi skulle kunna landstiga på den södra sidan. Det finns en hamn där och man kommer snabbt in i staden den vägen.

source: But won't they see us there?
ca: Però no ens veurien?
cs: Ale neprozradíme se tím?
hu: De könnyen észrevehetnek...
pl: Nie zauważą nas tam?
sv: Men kommer de inte att se oss där?

source: Yes, but what's wrong with a head on battle? I think we could defeat them.
ca: Sí, i? Que té de roin una batalla cara a cara? Crec que els podem derrotar.
cs: Jo, ale co je špatnýho na tom jít přímo do boje? Si myslím, že je můžem porazit.
hu: Igen, de mi van akkor, ha rögtön nyílt csatába bocsátkozunk? Szerintem mi győznénk.
pl: Tak, zauważą, ale co złego w walce z wrogiem który wie że mamy zamiar go zaatakować i pokonać?
sv: Ja, men vad är det för fel på rättfram strid? Jag tror vi skulle kunna besegra dem.

source: Well, I think maybe we should land right in Elensefar itself. That way, we can go around most of the orcish defenses, which are probably guarding the bridges to the city.
ca: Bé, em pareix que deuríem desembarcar directament dins la mateixa Elensefar. D'aquesta manera, podríem eludir la majoria de les defenses orques que, segurament guarden els ponts que entren a la ciutat.
cs: Dobře. Já myslím, že bysme měli přistát přímo v Elensefaru. Tím obejdeme většinu skřetích obránců, kteří nejspíš hlídají mosty do města.
hu: Nos, szerintem közvetlenül Elensefarban kellene kikötnünk. Ezzel megkerülhetjük az orkok védelmét, mivel nyilván védik a városba vezető hidakat.
pl: Hmm, myślę że powinniśmy wylądować w samym środku miasta. Tą drogą ominiemy wiele posterunków rozlokowanych przez orków przy mostach prowadzących do miasta.
sv: Jag tycker att vi borde landstiga inne i själva staden. På det sättet så kan vi komma runt det mesta av orchernas försvar. De vaktar med största sannolikhet broarna in i staden.

source: That is a bold plan, but I'm not sure it will work. If you do not succeed immediately, you will have alerted the orcs to our presence without accomplishing anything.
ca: És un pla valent, massa i tot. No estic gens segur que puga funcionar. Si no tenim èxit immediatament, els haurem revelat la nostra presència sense aconseguir res.
cs: To je odvážný plán, ale nevím, jestli zafunguje. Jestli hned neprorazíme, jen zalarmujem skřety a nic tím nedokážem.
hu: Merész terv, de kétlem, hogy működne. Ha nem sikerül villámháborúban legyőzni az orkokat, akkor nehéz helyzetbe kerülhetünk.
pl: Śmiały plan, ale nie jestem pewny czy możliwy do wykonania. Jeśli szybko nie odniesiesz zwycięstwa, zaalarmujesz tylko orków naszą pozycją i niczego nie osiągniemy.
sv: Det är en djärv och bra plan, men jag är inte säker på att den kommer att fungera. Om du inte lyckas med detsamma så har du uppmärksammat orcherna på vår närvaro utan att ha åstadkommit något alls.

source: A Choice must be make
hu: Tehát választanunk kell

source: Hm... you are right there. Which plan should we use?
ca: Hm... també tens raó. Quin plan deuríem usar?
cs: Hm..., to je pravda. Tak který plán bysme měli použít?
hu: Hm... igazad van. Melyik terv ígérkezik a legsikeresebbnek?
pl: Hm... masz rację. Który plan powinniśmy wybrać?
sv: Hm... Det har du rätt i. Vilken plan skall vi använda då?

source: I say we head north, as you proposed.
ca: Anirem pel nord, com tu vas dir.
cs: Říkám plout na sever, jak jsi navrhoval.
hu: Azt mondom, menjünk északra...
pl: Przepłyniemy się na północ, tak jak proponowałeś.
sv: Jag tycker vi går norrut, som du föreslog.

source: Madru's plan to head south sounds the best.
ca: El plan de Madru d'entrar pel sud em pareix millor.
cs: Nejlepší je zamířit na jih, jak říkal Madru.
hu: Madru déli terve tűnik a legjobbnak...
pl: Mardu, plan przejęcia południowych plaż jest najlepszy.
sv: Madrus plan att gå söderut låter bra.

source: Both of your plans were good, but I will stick to my own, and land in the harbor.
ca: Tots dos plans estaven bé, però preferisc mantenir el meu, i desembarcar al port.
cs: Oba vaše plány jsou dobré, ale zůstaneme u mého a přistaneme přímo v přístavu.
hu: Mindkettőtök terve jónak hangzik, de én a sajátomhoz ragaszkodok, s az egyenes utat választom.
pl: Oba wasze plany są dobre, ale ciągle stawiam na swoim, lądujemy w przystani.
sv: Båda era planer är bra, men jag vidhåller min egen, och landstiger i hamnen.

source: Very well. Let us not waste any more time, we must fight now.
ca: Molt bé, no cal que perdem més temps. A armes!
cs: Jasně. Neztrácejme už víc čas, jdem bojovat.
hu: Remek. Ne vesztegessük tovább az időt, most már a fegyvereké a szó.
pl: Dobrze. Nie marnujmy więcej czasu, musimy odbić miasto.
sv: Nåväl. Nu får vi sätta fart.

source: Epilogue
ca: Epíleg
cs: Epilog
hu: Epilógus
pl: Epilog
sv: Epilog

source: Meneldur, Black the Red, and Madru went to the Elensian palace, and searched the dungeons for prisoners taken by the orcs. They found many of the old nobility there, including the man who had been the Lord of Elensefar, Sir Darahan of Wesnoth. Having been taken captive immediately after the city was sacked, he had no knowledge of what had occurred in the many months since then.
ca: Meneldur, Negre el Roig i Madru van anar al palau elensià, i van buscar els presoners capturats pels orcs. Van trobar la majoria de l'antiga noblesa, incloent-hi l'anterior Senyor d'Elensefar, En Darahan de Wesnoth. Com l'havien pres immediatament després de la captura de la ciutat, no sabia res del que havia succeït en tots aquestos mesos.
cs: Meneldur, Rudý Černes a Madru vstoupili do Elensiánského paláce a začali prozkoumávat podzemní labyrint, hledajíce skřetí věžně. Našli mnoho těch, co bývali součástí šlechty a také muže který býval lordem Elensefaru, sira Darahana z Wesnothu. Protože byl zajat hned, jak bylo město popleněno, neměl povědomost o tom, co se minulé měsíce událo.
hu: Meneldur, Véreskezű Kalóz és Madru felkereste az elenszi palotát, rabok után kutatva bejárták a pincéket. Sok régi nemes család sarját találták ott, beleértve Elensefar helytartóját is, a wesnothi Darahan urat. Elensefar elfoglalása után azonnal fogságra vetették, így nem volt tudomása az utóbbi hónapok alatt történt eseményekről.
pl: Meneldur, Czerwony Black i Madru weszli do Elesiańskiego pałacu i przeszukali podziemia aby znaleźć więźniów przetrzymywanych przez orków. Znaleźli wielu ze starej szlachty, włączają człowieka którego nazywano Lordem Elensefaru, Sir Darahana z Wesnoth. Został uwięziony zaraz po opanowaniu miasta i nic nie wiedział o wydarzeniach ostatnich kilku miesięcy.
sv: Meneldur, Black Röde och Madru tog sig till det elensiska palatset och letade igenom fängelsehålorna efter orchernas fångar. De fann många av den gamla adeln där, och även den man som varit Elensefars regent, furst Darahan av Wesnoth. Eftersom han blivit tillfångatagen direkt efter att staden hade plundrats, så visste han inte vad som hade hänt i staden under de efterföljande månaderna.

source: The three rescuers told him their tale, of how Elensefar was no longer a province of Wesnoth, and of how Undead were temporarily 'living' in the city. He had been a loyal supporter of the throne before his captivity, and while in prison he had been constantly expecting Wesnoth to come and free him. Until he was told of Wesnoth's betrayal, he had believed that it was men of Wesnoth who had come in from the sea to attack the city, men of Wesnoth who had been fighting in the streets to reach the orcish leader, men of Wesnoth who had finally come to unlock his cell door. Needless to say, he felt betrayed.
ca: Els tres llibertadors li van contar la seua història, cóm Elensefar ja no era una província de Wesnoth i com els no morts 'viurien' una estoneta en la ciutat. Sempre havia sigut un lleial seguidor del tro abans del seu captiveri, i fins que no li van contar la traïció de Wesnoth, havia estat pensant que eren soldats wesnothians qui havien vingut des del mar per atacar la ciutat, que eren soldats wesnothians els qui havien lluitat carrer a carrer per arribar al líder orc, soldats wesnothians els qui havien arribat a la fi per alliberar-lo de la seua presó. No fa falta dir que es sentia traït.
cs: Tři zachránci mu vyprávěli svůj příběh, o tom, že Elensefar již není provincií Wesnothu a jak nemrtví dočasně „žijí“ ve městě. Před svým uvězněním byl loajálním zastáncem království a ve vězení neustále očekával, kdy vojáci Wesnothu přijdou a osvobodí ho. Dokud mu neřekli o zradě Wesnothu, věřil, že jsou to muži Wesnothu, kdo připlul od moře k městu, kdo bojoval v ulicích, aby se dostal ke skřetímu vůdci a kdo konečně odemkl dveře jeho cely. Je zbytečné popisovat, jak se cítil zrazen.
hu: A három szabadító elmondta a történetüket, s azt is, hogy Elensefar többé nem tartománya Wesnothnak, s azt is, hogy egy ideig élőholtak fognak a városban 'élni'. Elfogása előtt Darahan a korona feltétlen híve volt, s fogsága alatt szüntelenül reménykedett abban, hogy a király kiszabadítja. Amíg nem értesült a wesnothiak árulásáról, azt hitte, hogy ők jöttek meg délről, ők harcoltak az utcákon, s ők nyitották fel a zárkája ajtaját is. Szükségtelen mondani, mélységesen csalódott volt.
pl: Trzech oswobodzicieli opowiedziało mu swoją historię, jak to Elensefar przestał być prowincją Wesnoth i dlaczego nieumarli chwilowo "żyją" w mieście. Sir Darahan przed uwięzieniem był lojalnym poplecznikiem tronu i podczas swojego pobytu w więzieniu stale wyczekiwał Wesnothańczyków, którzy przyjdą aby go uwolnić. Do czasu gdy mu nie powiedziano o zdradzie Wesnoth, cały czas sądził że to ludzie Wesnoth probowali odbić miasto, że ludzie Wesnoth walczyli na ulicach aby dopaść przywódcę orków, ludzie Wesnoth którzy w końcu przyszli otworzyć drzwi jego celi. Co tu dużo mówić, czuł się zdradzony.
sv: De tre hjältarna berättade sin historia, hur Elensefar inte längre var en del av Wesnoth och varför vandöda fanns i staden. Furst Darahan hade varit en tronens lojale undersåte innan han blev tillfångatagen, och under sin tid i fängelsehålan så hade han hela tiden väntat på att Wesnoth skulle komma och frita honom. Ända tills han fick höra om Wesnoths förräderi så hade han trott att det var Wesnoths soldater som hade landstigit från havet för att anfalla staden; att det var de som hade slagits på gatorna för att nå orchledaren; att de var de som till slut hade kommit för att låsa upp hans fängelsedörr. Han kände sig förrådd.

source: I still cannot believe that the men of Wesnoth, or the elves, would really fight to keep men of Elensefar from aiding Elensefar. What made them do it, do you think?
ca: Encara no em puc fer la idea de que les gents de Wesnoth, o els elfs, lluitarien contra hòmens elensefarians que només buscaven ajuda per la ciutat. Què els hem fet per merèixer-nos-ho?
cs: Pořád nemohu uvěřit, že by muži Wesnothu nebo elfové skutečně mohli bránit mužům z Elensefaru ho osvobodit. Co způsobilo, že takto jednali, nevíte?
hu: Még mindig nem akarom elhinni, hogy a wesnothiak, vagy a tündék képesek lettek volna megakadályozni Elensefar felmentését. Mi késztette erre őket, fel sem foghatom?
pl: Ciąglę nie mogę uwierzyć w to że Elfy lub Wesnothańczycy walczyli z obywatelami Elensefaru, aby Ci nie mogli pomóc własnemu miastu! Jak myślicie, dlaczego to zrobili?
sv: Jag kan fortfarande inte tro att wesnotherna eller alverna skulle slåss för att hindra elenser från att bistå Elensefar. Vad fick dem att göra det, tror du?

source: Well, hatred of me, and the perception that I was a traitor to my race, was what fueled the elven attack.
ca: Bé, van ser l'odi que senten contra mi i la impressió que vaig trair la meua raça les coses que van impulsar l'atac elf.
cs: No nenávist ke mně a dojem, že jsem zrádce své rasy, to mohlo pohánět elfy.
hu: Nos, gyűlölnek, s a fajom árulójának tekintenek, s ez felülír minden etikai normát.
pl: Hmm, elfi atak z pewnością napędzała nienawiść do mnie samego i postrzeganie mnie jako zdrajcę rasy.
sv: Tja, deras hat för mig, och uppfattningen att jag var en rasförrädare, fick alverna att attackera.

source: They were willing to sacrifice a whole city to get revenge on one elf?
ca: Estaven disposats a sacrificar tota una ciutat per venjar-se d'un sol elf?
cs: Byli by schopni obětovat celé město kvůli odvetě na jednom elfovi?
hu: Képesek lettek volna egy egész várost feláldozni, hogy megbüntessenek egyetlen tündét?
pl: Byli skłonni poświęci całe miasto aby zemścić się na jednym elfie?
sv: De var villiga att offra en hel stad för att hämnas på en alv?

source: They did not think they were sacrificing it. They planned to attack the orcs right after they killed us; in fact, they were fighting the orcs at the same time they fought us. But before that, they had not attacked because they thought the Orcs would kill the elven prisoners if they did.
ca: No pensaven que estaven sacrificant-la. Havien planejat atacar els orcs després de matar-nos, és més, estaven lluitant contra els orcs alhora que contra nosaltres. Tanmateix, no havien atacat abans perquè pensarien que els orcs matarien tots els presoners elfs si ho feien.
cs: Nemysleli, že ho obětovávají. Plánovali zaútočit na skřety hned, jak by zabili nás. Vlastně zaútočili na skřety jakmile nás našli. Předtím ale neútočili proto, že si mysleli, že pokud by to udělali, tak by skřeti mohli zabít elfí zajatce.
hu: Nem akarták feláldozni az egész várost. Miután a foglyokat megölték, megtámadták volna az orkokat; valójában támadást is indítottak ellenük velünk egy időben. Korábban nem támadtak, mert azt gondolták, hogy akkor az orkok ki fogják végezni a tünde foglyokat.
pl: Planowali zabić orków zaraz po pokonaniu naszych wojsk, walczyli z orkami w tym samym czasie co z nami. Przedtem nie atakowali orków ponieważ bali się że Ci zabiją elfich więźniów przebywających w mieście.
sv: De tyckte inte att de offrade den. De planerade att anfall orcherna alldeles efter att de dödat oss. Faktum är att de slogs mot orcherna samtidigt som de slogs mot oss. Men innan det gjorde de ingenting, eftersom de trodde att orcherna skulle döda de alver de höll fångna om de gick till anfall.

source: So they made a peace with the orcs because they feared their own kind's death? Don't they know orcs cannot be trusted? All the elves who lived in this city were slain long ago.
ca: I van fer un pacte amb els orcs perquè temien per la mort de gent del seu poble? No saben que els orcs no són de fiar? Tots els elfs que vivien ací ja fa temps que van ser assassinats.
cs: Tedy uzavřeli mír se skřety protože se báli o život svých druhů? A to jim nedošlo, že na skřety není spolehnutí? Všichni elfové, co žili v tomto městě již byli dávno vybiti.
hu: Tehát békét kötöttek az orkokkal, mert féltették fajtársaik életét? Hát nem tudták, hogy az orkok megbízhatatlanok? Az összes városban élő tündét régen lemészárolták.
pl: A więc zawarli pakt z orkami dlatego że bali się śmierci swoich kompanów? Czy oni nie wiedzą że orkom nie można wierzyć? Wszystkie elfy ktore żyły w mieście zostały dawno zabite.
sv: Så de gick samman med orcherna för att de fruktade sitt folks död? Vet de inte att man inte kan lita på orcher? Alla alver som bodde i den här staden dödades för länge sedan.

source: When you are in danger of being attacked, you do not think clearly. Their attack was a mixture of motives, I would say. Hatred of Meneldur, fear of an orcish attack on their own country, fear of their kinsmen's death, and something else, I am not sure what, all made them willing to ally with evil.
ca: Quan estàs en perill, no penses amb claredat. El seu atac va ser una combinació de factors i motius, diria jo. L'odi cap a Meneldur, por d'un atac orc al seu país i alguna cosa més, no estic segur quina, totes juntes, van disposar-los a pactar amb el mal.
cs: Když vám hrozí útokem, nemyslíte rozumně. Jejich útok byl nejspíš řekl bych směsicí motivů. Nenávist k Meneldurovi, strach z možného útoku skřetů na jejich vlastní zem, strach o život svých druhů a i něco dalšího, nevím přesně, to všechno je přimělo, že se spojili se zlem.
hu: Ha félsz egy támadástól nem gondolkodsz logikusan. Többféle összetevője is volt a támadásnak szerintem. Gyűlölték Meneldurt, féltették a városukat az ork támadástól, s tartottak a fajtársaik halálától is, s még ki tudja mitől. Mindezeket mérlegelve juthattak odáig, hogy kiegyeztek a gonoszokkal.
pl: Gdy grozi Ci niebezpiedzeństwo często nie potrafisz jasno myśleć. Chciałem powiedzieć że ich atak mógł być mieszanką motywów. Nienawiść do Meneldura, strach przed atakiem orków na ich własne ziemie, strach przed utratą pobratymców i może coś jeszcze ale nie jestem pewny co, wszystko to popchnęło ich ku sojuszowi ze złem.
sv: När du håller på att utsättas för en attack så tänker du inte klart. Deras attack hade blandade motiv, skulle jag tro. Hatet mot Meneldur, rädslan för en orchattack i deras hemland, fruktan att deras folk skulle dö, och något annat som jag inte vet vad det är. Allt detta gjorde att de var villiga att liera sig med ondskan.
