Repository: moonymeric/Saving_Elensefar
Catalog: translations/*/*.po
Languages: ca, cs, hu, pl, sv

source: Off the Peninsula
ca: Fora de la península
cs: Mimo poloostrov
hu: A félsziget elhagyása
pl: Półwysep
sv: Bort från Halvön

source: Elvish Offshore
hu: Tünde tengeri bázis

source: I heard about your defeat of the elves on the isle, and I knew you'd probably show up here sooner or later.
ca: He sentit parlar sobre la teua derrota dels elfs de l'illa, i sabia que apareixeries per ací més prompte que tard.
cs: Slyšela jsem, jak jsi porazil elfy na ostrově. Věděla jsem, že by ses tu nejspíš mohl dříve nebo později objevit.
hu: Hallottam, hogy a szigeten lévő tündéket megsemmisítetted, s tudtam, hogy előbb vagy utóbb itt is felbukkansz.
pl: Słyszałam o twojej wygranej z elfami na wyspie i wiedziełam że wcześniej czy później zjawisz się tutaj.
sv: Jag hörde om din seger över alverna på ön och visste att du skulle dyka upp här förr eller senare.

source: I might have known. You must be the leader of these men; I wouldn't put aligning with men below you, after you surrendered to orcs!
ca: Deuria haver-ho sabut. Tu has de ser la líder d'aquests hòmens; no t'imaginava sota el comandament d'hòmens inferiors a tu després d'haver-te rendit als orcs!
cs: Měl jsem to vědět. Ty musíš být vůdkyní těchto bojovníků. Nemůžu být druhem těch, kterým velíš, když jste se vzdali skřetům!
hu: Tudhattam volna. Te vagy az emberek vezetője; nem egyezkedek olyanokkal, akik alávetik magukat az orkoknak.
pl: Mogłem się domyślić. Musisz być dowódczynią tych ludzi; nie mam nawet zamiaru rozmawiać z Tobą po tym jak poddałaś się orkom!
sv: Jag borde ha anat detta. Du måste vara ledaren för de här männen. Du är visst kapabel till det mesta, efter att ha kapitulerat inför orcher!

source: 'Surrendered' is not the way I would put it, but fine, have it your way.
ca: Jo no ho anomenaria 'rendir-se', però bé, ho farem com tu vulgues.
cs: „Vzdání se“ není popis, kterým bych to nazvala, ale dobře, ber to jak chceš.
hu: 'Alávetni' nem a megfelelő szó, de rendben, menj a fejed után.
pl: "Poddanie się" nie jest drogą którą kroczę, ale dobrze, niech Ci będzie.
sv: Nå, 'kapitulera' skulle inte jag kalla det, men visst, om du säger det så.

source: So, it is the traitor returning to greet his foe. How pleasant.
ca: Bé, així que el traïdor torna a trobar-se amb el seu enemic. Què bonic.
cs: Takže zrádce se vrací pozdravit svého nepřítele. Jak dojemné.
hu: Tehát itt van az áruló, hogy tiszteletét tegye nálunk. Milyen kedves.
pl: A więc oto zdrajca który wraca pokłonić się własnym wrogom. Jak miło.
sv: Så förrädaren återvänder för att hälsa sin fiende. Så trevligt.

source: What are you doing here? My quarrel is with the Wesnothians, not with you.
ca: Què fas tu ací? La meua disputa és amb els wesnothians, no amb tu.
cs: Co tady vůbec děláš? Svůj svár vedu s wesnothskými, ne s vámi.
hu: Mit csinálsz te itt? Nekem a wesnothiakkal van elintéznivalóm, nem veled.
pl: Co tutaj robisz? Mój spór toczy się z Wesnothańczykami, nie z tobą.
sv: Vad gör du här? Min konflikt är med wesnotherna, inte med dig.

source: I am the men's captain, so those who quarrel with them quarrel with me. We elves and men have aligned to bring you down!
ca: Sóc la capitana d'aquestos hòmens, i per tant tot aquell que disputa amb ells també ho fa amb mi. Nosaltres els elfs i els humans ens hem aliat per afonar-te!
cs: Jsem kapitánkou těchto mužů. Takže ti, kteří jsou s nimi ve sváru, jsou ve sváru se mnou. My elfové i lidé jsme se spojili, abychom tě porazili!
hu: Én vagyok az emberek vezetője, akinek velük van dolga, annak velem is. Mi, tündék és emberek egyaránt le akarunk számolni veled!
pl: Jestem dowódczynią tych ludzi. Więc ten kto sprzecza się z nimi, sprzecza się także ze mną. My, elfy i ludzie, doprowadzimy do twojego rychłego upadku!
sv: Jag är kapten över de här mannarna. De som bråkar med dem bråkar med mig. Vi alver och människor har gått samman för att besegra dig!

source: Think what you like. We will fight you if need be.
ca: Pensa el que vulgues. Lluitarem contra tu si fa falta.
cs: Mysli si co chceš. Když bude třeba, budeme s vámi bojovat.
hu: Gondolj, amit akarsz! Ha kell, veled is megküzdünk.
pl: Zastanów się co mówisz. Jeśli nas zmusisz, będziemy z tobą walczyć.
sv: Tro vad du vill. Vi kommer att slåss om det behövs.

source: Oh, and I see some of the Wesnothians you found are turncoats. Don't worry, they will die also.
ca: Oh, veig també que alguns dels wesnothians que t'has trobat són uns proscrits. No et preocupes, també moriran.
cs: Oh, vidím, že někteří z těch wesnothských, co jsi potkal, přešli na tvoji stranu. Neboj se, oni také zemřou.
hu: Ó, úgy látom, néhány wesnothi köpönyegforgató csatlakozott hozzád. Ne aggódj, ők is meghalnak.
pl: Oh, widzę że niektórzy Wesnothańczycy którzy dołączyli do Ciebie to dezerterzy. Nie mart się, oni także zginą.
sv: Åh, jag ser att du har förrädare bland de wesnother du plockat upp. Oroa dig inte, de kommer också att dö.

source: With Lomanyas dead, I think we have defeated all of the Elves who sail the sea. We probably won't see them until we reach Elensefar...
ca: Amb la mort de Lomanyas, crec que hem derrotat tots els elfs que naveguen. Segurament no els tornarem a veure fins que arribem a Elensefar...
cs: Teď když jsme zabili Lomanyas, myslím, že jsme pobili všechny elfy, co byli schopní plout po moři. Asi už žádné nepotkáme, dokud se nevrátíme do Elensefaru...
hu: Lomanyas halálával, azt hiszem az utolsó tündéket is megsemmisítettük, akik tengerre szálltak. Talán már nem találkozunk velük Elensefar előtt...
pl: Myślę że z śmiercią Lomanyas pokonaliśmy wszystkich elfów którzy żeglowali przez morze. Prawdopodobnie nie zobaczymy ich aż do czasu powrotu do Elensefaru...
sv: Med Lomanyas död så tror jag att vi har besegrat alla sjöfarande alver. Vi kommer nog inte att se mer av dem innan vi når Elensefar...

source: It is unfortunate the elves have also decided to oppose us. I suspect there are more of them roaming the seas.
ca: És una desgràcia que els elfs hagen decidit oposar-se a nosaltres. Sospite que encara hi ha alguns més navegant pels mars.
cs: Je to neštěstí, že se elfové také rozhodli jít proti nám. Mám podezření, že jich potuluje po moři víc.
hu: Ez pech, a tündék szintén a nyomunkban vannak. Gyanítom, hogy többen is kóborolnak a tengeren.
pl: To przykre że elfy także zdecydowały się nam przeciwstawić. Obawiam się że znacznie więcej ich błądzi się po morzach.
sv: Det är beklagligt att alverna också har valt att gå emot oss. Jag tror att det fortfarande finns fler av dem ute till havs.

source: The Desert Island
ca: L'illa deserta
cs: Pouštní ostrov
hu: Lakatlan sziget
pl: Pustynna Wyspa
sv: Ökenön

source: Sea Hawks
hu: Tengeri sólymok

source: I found a treasure! I count at least 500 gold pieces
hu: Találtam egy kincsesládát! Legalább 500 arany van benne.

source: I see there are more undead! I wonder how many of these did not go all the way across with Jevyan?
ca: Veig més no morts! Em pregunte quants més no van fer tot el camí amb Jevyan...
cs: Vidím, že je více nemrtvých! Zajímalo by mě, kolik z nich se odpojilo od Jevyana během jeho cesty?
hu: Még több élőholtat látok! Ezek vajon miért nem tűntek el Jevyannal együtt?
pl: Widzę więcej nieumarłych! Ciekawi mnie jak wielu z nich nie ukończyło podróży z Jevyanem i rozsiało się po tych wyspach.
sv: Där är ännu fler vandöda! Undrar hur många av dessa som inte tog sig hela vägen över med Jevyan?

source: I have seen several of these wandering undead where I come from. Haven't you?
ca: He vist prou d'aquestos no morts errants on jo visc. Vosaltres no?
cs: Tam, odkud pocházím, jsem viděl několik těchto potulných nemrtvých. Ty ne?
hu: Számos ilyen kóbor élőholtat láttam ott, ahonnan jövök. Mi a gond?
pl: Widzialem już wielu nieumarłych w krainach z których pochodzę. Zdaje mi się że Ty nie spotykałeś ich często.
sv: Jag råkade på mängder av dessa vandöda där jag kommer ifrån. Har inte du träffat på sådana tidigare?

source: Mostly I travel south to the southern continent, not west like this. There are no undead there!
ca: Normalment viatge cap al continent del sud, no cap a l'oest com ara. No hi han no morts allà!
cs: Většinou cestuji na jižní část kontinentu, ne takto na západ. Tam nejsou žádní nemrtví!
hu: Én általában csak a szárazföld déli felén közlekedem, erre nyugatra nem. Ott nincsenek élőholtak.
pl: Przeważnie podróżuję tylko na południe kontynentu, nie na zachód jak robimy to teraz. Tam nigdy nie było nieumarłych!
sv: Jag reser oftast söderut till den södra kontinenten, inte västerut som nu. Det finns inga vandöda där!

source: I see...
ca: Ja veig...
cs: Aha...
hu: Értem...
pl: Oh, już rozumiem...
sv: Jag förstår...

source: Sssooo.... youu hazntt foughtt me oftenzz? Ahhh, gooodd. You will be eazyy to defeatzz!
ca: Beee... noo haveeu lluitat contra mmmmmmmmmi mmmmmmolt? Ahh, bbbó. Sssssserà fàcil derrrrrrrrrrrotarr-vosss!
cs: Takžše... vy sste na mě nezzaútočšili? Šskvělee. To vy jišště ssnadná kořišst!
hu: Úúúúty... ssszzzóval nem ssszzzoktál a magunkfajtákkal harcolni. Ssszzzétssszzzzaggatunk!
pl: A więęęccc... niieee walczyłeeeśś z naamiii częssssto? Ahhh, baaardzo dooobrzee. Waalkaaa z tooobą będzieeee dlaaa nassss błahossstkąą!
sv: Sssååå.... Duuu harr iiinte slaagitss mot miiig fööruuut...? Ahhh, brraaa. Deeet bliir ennn enkeel seegerrr!

source: Why did he speak like a lizard?
ca: Per què ha parlat com un fardatxo?
cs: Proč mluví jak ještěr?
hu: Milyen furcsa, úgy beszél, mint egy gyík...
pl: Dlaczego ten nieumarły mówi tak jak jaszczur?
sv: Varför pratade han som en ödla?

source: What the...?
ca: Què co...?
cs: Co to...?
hu: Mi a manó...?
pl: Co do... ?
sv: Vad tusan...?

source: That must be why he spoke like that. He is partly a lizard!
ca: Per això parlaria així. És mig sauri!
cs: To je důvod, proč tak mluvil. Je to napůl ještěr!
hu: Biztos ezért beszélt úgy. Hiszen félig gyík!
pl: A oto powód dlaczego gada jak jaszczur... jest w połowie jaszczurem w połowie nekromantom!
sv: Det där måste vara anledningen! Han är ödla till hälften!

source: The Ruined Port
ca: Port en ruïnes
cs: Zničený přístav
hu: Romos kikötő
pl: Zrujnowany Port
sv: Den förstörda hamnen

source: Young Fouls
hu: Ifjú csirkefogók

source: Turns run out and Bakrakha is still alive
ca: S'acaben els torns i Bakrakha encara està viu
cs: Vyprší počet kol a Bakrakra bude stále naživu
hu: A körök végét Barakhra is megéri
pl: Koniec tur, Bakrakha wciąż żyje.
sv: Dragen tar slut och Bakrakha är i livet

source: That right. You' keeping all the food in your castle there, and we' tired of it. Its time to get a new king 'round 'ere!
ca: Sí! Tens tot el menjar dins del teu castell allí, i ja n'estem farts. És hora de matar-te i provar 'en' un nou rei per aquí!
cs: Jasnačka. Dřepíš tam na hradě se vším jídlem a nás už to unavuje. Je čas tu nastolit novýho vládce!
hu: Így igaz. Az erődödben halmozod fel az élelmet, mi meg éhezünk. Épp ideje, hogy új király uralkodjon!
pl: To prawda. Trzymasz całą żywność w swoim zamku a my ciągle głodujemy. Nadszedł kres twojego panowania!
sv: Så är det! Du behåller all mat i ditt slott och vi är trötta på det. Det är dags att sätta en ny kung på tronen!

source: So what do you suggest we do?
ca: Per tant, que suggereixes?
cs: Takže co navrhuješ udělat?
hu: Szerinted mit kéne tennünk?
pl: Co proponujesz?
sv: Så vad föreslår du att vi skall göra?

source: Good, now we just have to survive until the ship is refilled.
ca: Bé, ara només hem de sobreviure fins que el vaixell siga aprovisionat.
cs: Dobře, teď jen musíme vydržet dokud nedoplníme lodní zásoby.
hu: Remek, most már csak ki kell tartanunk, míg a hajót felpakolják.
pl: Dobrze, teraz musimy tylko przeżyć do chwili kiedy statek bedzie w pełni załadowany i gotowy do drogi.
sv: Bra. Nu måste vi bara hålla ut tills skeppet förråd är fyllda.

source: Good, we have enough food now. We should go back out to sea, further north there are some people who might help us.
ca: Bé, ja tenim prou menjar. Deuríem tornar al mar i marxar més cap al nord, allí hi haurà gent que ens podrà ajudar.
cs: Dobře, máme teď dost jídla. Měli bychom se vrátit na moře, dále na sever jsou lidé, kteří by nám mohli pomoci.
hu: Jól van, most már van elég élelmünk. Irány a tenger, északabbra találhatunk népeket, akik segíthetnek nekünk.
pl: Bardzo dobrze, mamy teraz wystarczjąco dużo żywności. Powinniśmy wrócić na morze, na północy znajdziemy ludzi którzy może pomogą nam w naszej misji.
sv: Bra, vi har tillräckligt med mat nu. Vi borde ta oss tillbaka ut till havs. Längre norrut finns några som kanske vill hjälpa oss.

source: Illaryan, the Illusionist
hu: Illaryan, az illuzionista

source: Illaryan the Illusionist
hu: Illaryan az illuzionista

source: Dusty Miracles
hu: Trükkös mágus

source: Who comes there? Who invades my lands?
hu: Ki van ott? Ki akarja elfoglalni a szigetemet?

source: Invades? We came in peace, and just want to restock our ship.
hu: Elfoglalni? Békével jöttünk, csak a hajónk készletét szeretnénk feltölteni.

source: Out of my land!
hu: Takarodjatok!

source: I think we had to fight if we want to restock our ship here.
hu: Azt hiszem, harcolnunk kell a készleteink feltöltéséért.

source: Well, he doesn't give us other choice.
hu: Nos, nincs más lehetőségünk.

source: Crazy people! You want to fight? Defeat me first if you can!
hu: Őrültek! Harcolni akartok? Először engem győzzetek le, ha tudtok!

source: You dont scare me with those illussions!
hu: Engem nem ijesztesz meg az illúzióiddal!

source: Men, dont be fooled by the appearances.
hu: Katonák, ne ijedjetek meg azoktól az árnyképektől!

source: To battle!
hu: Fegyverbe!

source: Come to me, come!
hu: Gyertek csak, gyertek!

source: Begone, false illusion!
hu: Szűnj meg, árnykép!

source: Isle of Alduin
hu: Alduin szigete

source: Mage Magister
hu: Mágusmester

source: Persuade the Mages from Alduin to join your forces
hu: Sikerül rábeszélned néhány mágust, hogy csatlakozzon hozzád

source: To persuade a Mage, visit his village more times than Leowyn's side does
hu: Egy mágus meggyőzéséhez látogasd meg a kunyhóját többször, mint Leowyn ügynökei teszik

source: Turns run out
hu: Kifutsz az időből

source: Now we are on the isle of Alduin, let us try to convince some of the mage to join our cause.
hu: Itt vagyunk Alduin szigetén, próbáljunk meggyőzni néhány mágust, hogy csatlakozzon hozzánk.

source: I doupt they will
hu: Kétlem, hogy sikerülni fog.

source: A try cannot hurt
hu: Ha meg se próbáljuk, akkor nem.

source: Hail, Leowyn! What matters bring you here?
hu: Üdv, Leowyn! Mi szél hozott erre?

source: Quickly, the Queen ask for the best mages from the Academy
hu: Gyorsan, a királynőnek szüksége van a legjobb mágusokra

source: We will help you
hu: Segítünk kiválogatni

source: It seems that we have concorrents
hu: Úgy tűnik, a konkurrencia is dolgozik.

source: Goblin Isle
hu: Koboldok szigete

source: Nasty Goblins
hu: Undok koboldok

source: Shipwrecked
hu: Hajótöröttek

source: Saurian Pest
hu: Gyíkbarlang

source: Thizss is our land zsaurian scum
hu: Ezzz a mi földünk, söpredék gyíkok!

source: Not in your sssweatest dreams. Naga fouls
hu: Ne issszzz álmodjatok róla, aljas nagák!

source: Oh Oh. We had shipwrecked directly into a lizard nest
hu: Ó, ó. Pont egy gyíkfészekben szenvedtünk hajótörést

source: You come in handy time zstramgers. Would you help us defeat that saurian scum?
hu: Pont jókor érkezzztetek idegenek, segítenétek kiirtani ezzzeket a söpredék gyíkokat?

source: Why should we?
hu: Ugyan miért segítenénk?

source: Long ago this were the swamp of a basilisk, as a gift we offer its eye wich is able to petrify!
hu: Sok évvel ezelőtt ebben a mocsárban egy sárkánygyík élt. A szemét nektek ajándékozzuk a segítségetekért, kővé tudjátok változtatni vele az ellenséget!

source: Don't lissten to him! The naga had invaded our pacific land! help us expell them out!
hu: Ne higgyetek nekik! A nagák megtámadták a békéssszzz ssszzzigetünket, ssszzzegítssszzzetek nekünk, elzavarni őket!

source: We know about an Invisibility Cape near, maybe that convince you?
hu: Mert van egy láthatatlanná tevő köpenyünk, ez talán érdekelne?

source: Well, uhm
hu: Nos, hmmm

source: You Saurians have our word, let us expell the nagas.
hu: A gyíkoknak hiszek, tisztítsuk meg a szigetet a nagáktól.

source: Player
hu: Játékos

source: $unit.name finds the Cape of Invisibilty. Should he pick it up?
hu: $unit.name megtalálta a láthatatlanná tevő köpenyt. Vegye fel?

source: invisibility cape^Take it
hu: Igen

source: invisibility cape^Leave it
hu: Ne

source: Invisibility Cape
hu: Láthatatlanná tévő köpeny

source: This cape grants the wearer Invisibility!
hu: A viselője láthatatlanná válik!

source: invisibility
hu: láthatatlanság

source: We dont believe your lies, saurians. Prepare to die
hu: Nem hiszünk a hazugságaitoknak, gyíkok, készüljetek a halálra!

source: $unit.name finds the Eye of Basilisk. Should he pick it up?
hu: $unit.name megtalálta a sárkánygyík szemét. Vegye fel?

source: eye of basilisk^Take it
hu: Igen

source: eye of basilisk^Leave it
hu: Ne

source: Eye of the Basilisk
hu: Sárkánygyík Szeme

source: Despite the death of the basilisk the eye still has the power to petrify its targets
hu: Habár a sárkánygyík elpusztult, a szeme továbbra is rendelkezik a kővéváltoztatás képességével.

source: eye of basilisk
hu: sárkánygyík szeme

source: We have no time for those childdish disputes.
hu: Nics időnk ilyen gyerekes cívódással foglalkozni.

source: Defeat the Saurians
hu: Legyőzöd a gyíkokat

source: Defeat the Nagas
hu: Legyőzöd a nagákat

source: Defeat both enemy leaders
hu: Legyőzöd mindkét ellenséges vezért

source: Cave of Illirien
hu: Illirien barlangja

source: Cave Hidders
hu: Barlangi rejtőzők

source: A Monster!
hu: Egy szörny!

source: Explore the Cave
hu: Feltárod a barlangot

source: Long time ago this was a smugglers hole, a helthy one. Althought I feel that it is abandoned for years.
hu: Sok évvel ezelőtt ez a hely csempészek barlangja volt, remek rejtekhely. De azt hiszem, már évek óta nem használják.

source: Why did they leave? It is to far away from normal wesnothian trade routes.
hu: Miért hagyták el? Nagyon messze van a hagyományos wesnothi kereskedelmi utaktól.

source: But not far away sufficient
hu: De nem eléggé messze.

source: And there are rumors that obscure shadows had settled here
hu: Meg azt is mondják, hogy sötét árnyak telepedtek meg a barlangban.

source: How it be, let us see if we found some food, our is nearly gone
hu: Akárhogy is van, találnunk kell itt némi élelmet, a mi tartalékaink kiürültek.

source: The Swampland
ca: Les Marjals
cs: Blata
hu: Mocsár
pl: Bagna
sv: Sumpmarken

source: Crazy Horse
hu: Őrült Ló

source: Play a game of Reversi with Othello
hu: Reversit játszol Othello ellen

source: Capture more units than Othello does
hu: Több egységed lesz a játék végén, mint Othellonak

source: Othello finish with more units
hu: A végén Othellonak lesz több egysége

source: You lose <b>both</b> Madru and Black the Red
hu: Elveszted Madrut <b>és</b>Véreskezű Kalózt is

source: You lose <b>either</b> Madru or Black the Red
hu: Vagy Madrut, vagy Véreskezű Kalózt elveszted

source: <b>How to Play</b>
hu: <b>Játékszabályok</b>

source: A move is valid if Othello's units will be between two of yours. To place a unit on the board:
hu: A lépés érvényes, ha két egységeddel közrefogod Othellonak legalább egy egységét. Egység elhelyezése a terepen:

source: (1) Move Meneldur to a ruined castle at the bottom to select the column
hu: (1)Mozgasd Meneldurt egy romos várkastélyra az alsó sorban, hogy kiválaszd a megfelelő oszlopot

source: What is this, a mage walks clad in black? Explain yourself! Are you of the red mages, or the white?
ca: Què és això, un mag vestit de negre? Explica't! Eres dels mags rojos o dels blancs?
cs: Co je to, mág oděný v černém? Představ se! Jsi rudý nebo bílý mág?
hu: Hát ez meg mi, egy fekete köpenyes mágus? Igazold magad! Te egy vörös mágus vagy, vagy pedig fehér?
pl: Co to, mag przyodziany w czerń? Ujawnij się! Należysz do czerwonych czy białych magów?!
sv: Vad är detta? En magiker som går klädd i svart? Förklara dig! Är du en röd eller vit magiker?

source: What? Do you mean to tell me that the great lich Jevyan does not reign on that continent, or that his mages no longer wear the robes of the necromancer?!?
ca: Què? Estàs dient que el gran lich Jevyan no regna en aquell continent, o que els seus mags ja no duen la vestiment pròpia dels nigromants?!?
cs: Cože? Chceš mi tvrdit, že velký lich Jevyan neovládl kontinent, nebo že jeho mágové už nenosí oděv nekromantů?!?
hu: Mi? Azt akarod mondani, hogy a nagy delevényúr, Jevyan nem uralkodik a kontinensen, vagy hogy a mágusai nem viselik a holtidézők köpönyegét?
pl: Co? Chcesz mi powiedzieć że wielki licz Jevyan nie panuje na tym kontynencie, czy że jego magowie nie przywdziewają już nekromanckich szat?!?
sv: Vad? Menar du att den store häxmästaren Jevyan inte längre regerar på kontinenten eller att hans magiker inte längre bär nekromanternas skrudar?!

source: What? Why do you speak of those old tales as if they were real? And I suppose you think you are a real necromancer too.
ca: Què? Per què parles de contes de fades com si foren reals? I supose que tu creus que eres un nigromant de debò, doncs.
cs: Cože? Proč mluvíš o těch starých příbězích (pokud se skutečně staly)? A předpokládám, že se snad také považuješ za nekromanta?
hu: Mi van? Mit hadoválsz itt régi mesékről, mintha igazak lennének? Gondolom te magadat valódi holtidézőnek hiszed.
pl: Dlaczego opowiadasz nam o starych legendach? Przecież to wierutne kłamstwa! Założę się że i Ty uważasz się za wielkiego nekromantę!
sv: Vad? Varför talar du om saker som bara finns i gamla legenderna? Du tror säkert att du är en riktig nekromant också.

source: Why do you say he's not a necromancer? I've seen them before, haven't you?
ca: Per què dius que no és un nigromant? N'heu vist abans vosaltres, no?
cs: Proč tvrdíš, že není nekromant? Už jsem je viděl, ty ne?
hu: Miért mondod, hogy nem az? Én már láttam a fajtáját korábban is.
pl: Dlaczego sądzisz że nie jest nekromantą? Ja już ich widziałem wcześniej, a Ty?
sv: Varför säger du att han inte är en riktig nekromant? Jag har sett dem; har inte du gjort det?

source: Are you saying undead exist?
ca: Vols dir que els no morts existeixen?
cs: Říkáš, že nemrtví existují?
hu: Azt állítod, hogy léteznek élőholtak?
pl: Chcesz powiedzieć że nieumarli istnieją?
sv: Påstår du att vandöda finns på riktigt?

source: Yes. And this guy looks real enough. I think we should treat him like an actual enemy.
ca: Sí. I aquest homenet pareix prou real. Crec que deuríem tractar-lo com un perillós enemic.
cs: Ano. A tenhle chlapík vypadá skutečně. Myslím, že bysme ho měli považovat za aktuálního nepřítele.
hu: Igen, s ez a fickó is nagyon valódinak tűnik. Azt hiszem, ő a következő ellenségünk.
pl: Tak. A ten typ wygląda naprawę jak nekromanta. Myślę że powinniśmy go potraktować jak potencjalnego wroga.
sv: Ja, och dessutom ser den här killen riktig nog ut. Jag tycker att vi borde behandla honom som en riktig fiende.

source: Yes, you should! Now, prepare to die!
ca: Sí, sí que deuríeu! Ara, prepareu-vos per morir!
cs: Ano, to byste měli! A teď se připravte na odchod ze života!
hu: Igen, a következő. Akkor készülj a halálra!
pl: Tak, tak, powinniście! A, teraz gotujcie się na śmierć!
sv: Ja, det borde ni! Bered er på döden!

source: Whatever. We will see if he actually can raise anything, and if we come out of here.
ca: Sí, clar. Ara veurem si pot invocar coses.
cs: Jak je libo. Uvidíme, jestli vlastně umí něco oživit a jestli se odtud dostanem.
hu: Végül is mindjárt meglátjuk, hogy képes-e bármit is megidézni, s kijutunk-e innen valaha is.
pl: Nieważne. Zobaczymy czy potrafi robić coś więcej oprócz gadania.
sv: Visst. Vi får väl se om han verkligen kan återuppväcka något.
