Repository: moonymeric/Saving_Elensefar
Catalog: translations/*/*.po
Languages: ca, cs, hu, pl, sv

source: We go out to sea, to build up an army large enough to retake Elensefar. You're an Elensian, right? I think you owe us your help. We did just save you from death, and now we have the men of Wesnoth against us in return.
ca: Ens hem llançat al mar per reunir un exèrcit prou gran per reconquistar Elensefar. Eres un elensià, veritat? Crec que ens deus un favor. Acabem de salvar-te d'una mort segura, i ara tenim també als hòmens de Wesnoth contra nosaltres.
cs: Vyrazíme na moře a seženeme dostatečně velkou armádu pro osvobození Elensefaru. Ty jsi elensián, že? Myslím, že nám dlužíš svou pomoc. Právě jsme tě zachránili před smrtí a teď kvůli tomu jdou wesnothští vojáci i po nás.
hu: Kivitorlázunk a tengerre, sereget gyűjtünk, s ha elég nagy lesz, visszafoglaljuk Elensefart. Te is elenszi vagy, nem? Azt hiszem, hálásnak kéne lenned a segítségünkért. Épp most mentettük meg az életedet, amiért a wesnothiak ellenünk is hajtóvadászatot indítanak.
pl: Wypłyneliśmy w morze żeby zebrać armię zdolną do odzyskania Elensefaru. Jesteś Elesiańczykiem, prawda? Myslę że jesteś winny nam przysługę, właśnie uratowaliśmy Ci życie, a do tego przeciwstawiliśmy się żołnierzom Wesnoth co z pewnością nie przysporzy nam szczęścia w drodze powrotnej.
sv: Vi måste till sjöss för att bygga upp en arme som är tillräckligt stor för att återta Elensefar. Du är elenser, eller hur? Jag tycker att du är skyldig oss din hjälp. Vi räddade dig just från döden och fick till på köpet Wesnoths armé efter oss.

source: Well, I have been in Elensefar, and owe some help to it. Very well. Here is what I will do. There is an island in the west that has many warriors on it who will be willing to help you; I will join you, and try to convince those warriors to also, if you grant me one request.
ca: Bé, he estat en Elensefar unes quantes vegades i li dec alguna ajuda. Molt bé. Açò és el que pense fer. Hi ha una illa cap a l'oest habitada per molts guerres que estarien disposats a lluitar amb tu; m'uniré a tu i t'ajudaré a convèncer-los, amb una condició.
cs: No pobýval jsem v Elensefaru a dlužím mu svou pomoc. Dobře tedy. Udělám tohle: Na západě je ostrov, kde je hodně válečníků, kteří by ti mohli pomoct. Připojím se k tobě a budu se snažit je přesvědčit, aby to udělali, pokud mi splníš jednu prosbu.
hu: Nos, jártam Elensefarban, s tartozom neked a segítségedért. Rendben van. Megmondom, mit tegyünk. Nyugaton van egy sziget, ahol sok harcos él, akik szívesen csatlakoznak hozzád; veled megyek, és megpróbálom meggyőzni azokat a harcosokat is, ha teljesíted egy kérésemet.
pl: Byłem w Elensefarze i rzeczywiście teraz jestem wam winny przysługę... Hmmm... bardzo dobrze, oto co moglibyśmy zrobić. Na zachodzie leży pewna wyspa, mieszka tam wielu wojowników którzy mogą być skłonni do udzielenia Ci pomocy. Dołączę do was i spróbuję ich przekonać, jeśli spełnisz moją jedną prośbę.
sv: Nå, jag har varit i Elensefar och är skyldig det en viss hjälp. Nåväl, detta är vad jag tänkte göra. Det finns en ö västerut som har en befolkning med många krigare som är villiga att hjälpa dig. Jag följer med dig och hjälper till att övertala de där krigarna, om du gör en sak för mig.

source: Which is?
ca: Que és...
cs: Která je?
hu: S mi lenne az?
pl: Która brzmi?
sv: Vadå?

source: I can't tell you until we reach the Western isle I told you about. That's part of the fun.
ca: No t'ho puc dir fins que no arribem a eixa illa que t'he dit. És part de la diversió.
cs: Nemohu ti jí říct dokud nedosáhneme západního ostrova, o kterém jsem povídal. Ber to jako součást celé „zábavy“.
hu: Nem mondhatom meg, míg el nem értük a nyugati szigetet, amit említettem. Ez is a móka része.
pl: Nie mogę narazie nic powiedzieć, ale kiedy tylko dobijemy do brzegów wyspy wszystko Ci opowiem. Potraktuj to jak rodzaj zabawy.
sv: Det kan jag inte berätta förrän vi kommer till fram till ön. Det är en del av det roliga.

source: Oh, fine... 'I swear on Elensefar my city and on my honor as a Sailor that I will honor your request, whatever it may be, whenever we reach this Western island and you secure the help of the warriors that live there.' Happy?
ca: Val, val... 'Jure, per Elensefar, la meua ciutat, i el meu honor com a Mariner que compliré amb la teua condició, siga quina siga, quan arribem a aquesta illa occidental i aconseguisques l'ajuda dels guerres que allí viuen.' Content?
cs: Oh, dobře... Přísahám na své město Elensefar a svou čest námořníka, že vyplním tvou prosbu, jakákoli bude, jakmile dosáhneme toho západního ostrova a ty zajistíš pomoc zdejších válečníků. Spokojen?
hu: Legyen... 'Elensefarra és tengerész becsületszavamra fogadom, hogy teljesítem a kérésedet, bármi legyen is az, mihelyst elértük a nyugati szigetet, s meggyőzted az ott élő harcosokat, hogy segítsenek nekünk.' Rendben vagyunk?
pl: Oh, rozumiem... "Przysięgam na me miasto Elensefar i na mój żeglarski honor że spełnię twą prośbę, czymkolwiek by była, kiedy tylko dobijemy do wybrzeży zachodniej wyspy a Ty zapewnisz nam pomoc wojowników którzy tam mieszkają". Szczęśliwy?
sv: Åhå, nåväl... 'Jag svär vid min stad Elensefar och vid min heder som sjöman att jag kommer att uppfylla din begäran, vad det än vara må, när vi når den här västra ön och du har säkrat hjälpen från krigarna som bor där.' Nöjd?

source: Very much so. Now, I will move my troops to your boat (it is faster), and we will head on west...
ca: No et pots fer una idea. Ara conduiré les meues tropes al teu vaixell (és més ràpid), i navegarem cap a l'oest...
cs: Velmi. Teď přesuneme mou posádku na tvou loď (je rychlejší) a vyrazíme na západ...
hu: Tökéletesen. Akkor most átszállunk a hajódra (mert sokkal gyorsabb), s irány nyugat...
pl: I to jeszcze jak. Teraz przeniosę moich ludzoi na twój okręt, i popłyniemy na zachód...
sv: Exakt. Nu beordrar jag mina trupper över till ditt snabbare skepp, och så kan vi ge oss av mot väster...

source: Blackmore the Black
ca: Blackmore la negra
cs: Černý Blackmore
hu: Gyászba borult Blackmore
pl: Czarnogród
sv: Blackmore den Svarte

source: Undead-Elf-Alliance
hu: Élőholt-tünde szövetség

source: Revolting Orcs
hu: Lázadó orkok

source: Defeat enemy leaders
ca: Derrota els líders enemics
cs: Poraz nepřátelské vůdce
hu: Legyőzöd az ellenséges vezéreket
pl: Pokonaj wrogich przywódców
sv: Besegra fiendeledarna

source: Death of Ah-Reblak
ca: Mort d'Ah-Reblak
cs: Ah-Reblak zemře
hu: Ah-Reblak meghal
pl: Śmierć Ah-Reblaka
sv: Ah-Reblak dör

source: Black, why have you brought us here?!? This is just a remnant of a town, and there are no warriors here, just undead and orcs!
ca: Negre, per què ens has dut ací?!? Només veig les ruïnes d'una ciutat, i no hi ha cap guerrer ací, només orcs i no morts!
cs: Černesi, proč jsi nás sem zavedl? Vidím jen zbytky a trosky města a nejsou tu žádní válečníci, jen nemrtví a skřeti!
hu: Kalóz, miért hoztál minket ide?!? Hiszen ez csak egy romváros, s harcosok sincsenek itt, csak élőholtak és orkok!
pl: Black, czemu nas tu przyprowadziłeś?!? To ruiny jakiegoś miasta i do tego niema tu żadnych wojowników tylko nieumarli i orkowie!
sv: Black, varför tog du oss hit? Det här är ju bara de raserade resterna av en stad, och det finns inga krigare här - bara vandöda och orcher!

source: No, no, you are wrong there. This is no ruined city, this is Blackmore the Black, and for the past seventy years it has been the home of the Wesfolk who remained on this island.
ca: No, no, estàs equivocat. Açò no és cap ciutat en ruïnes, aquesta és Blackmore la negra, i des de fa setanta anys ha sigut la casa dels wesfolk que van romandre en aquesta illa.
cs: Ne, kdepak, podceňuješ to tady. To nejsou ruiny, to je Černý Blackmore, který je posledních sedmdesát let domovem Wesanů, kteří zůstali na tomto ostrově.
hu: Nem-nem, tévedsz. Ez nem egy romváros, ez Gyászbaborult Blackmore, amely az elmúlt hetven évben a szigeten maradt wesfolkok otthona volt.
pl: Nie, nie, mylisz się. To nie ruiny zwykłego miasta, to Czarnogród i przez ostatnich siedemnaście lat był to dom Ludu Wesfolk, który żył na tej wyspie.
sv: Nej, nej, du har fel. Det här är ingen ruinstad. Det här är Blackmore den Svarte, och de senaste sjuttio åren har det varit hemmet för de av wesfolkets som stannade kvar på ön.

source: You mean those undead over there are 'Wesfolk'? As in the Wesfolk who came over with Lady Jessica?
ca: Vols dir que aquestos no morts d'ací són 'wesfolk'? Els mateixos wesfolk que van arribar amb Na Jessica?
cs: Nazýváš tadyty nemrtvé jako „Wesany“? Jako ty Wesany, co připluli s paní Jesenou?
hu: Azt akarod mondani, hogy azok az élőholtak ott 'wesfolkok'? Ugyanolyan wesfolkok, mint akik Lady Jessicával érkeztek?
pl: Masz na myśli to że Ci nieumarli to Wesfolk?! Ten Lud Wesfolk który przybył na Wielki Kontynent wraz z Lady Jessicą?
sv: Menar du att de vandöda där borta är 'wesfolk'? Som i det wesfolk som kom hit med Lady Jessica?

source: I would assume that is what he means, yes. So, Black, you've brought us here to have these Wesfolk help us?
ca: Supose que això és el que vol dir, sí. Per tant, Negre, ens has tret ací per rebre l'ajuda d'aquestos wesfolk?
cs: Předpokládám, že přesně tak to myslí. Tak Černesi, vzal jsi nás sem, abysme získali pomoc těchto Wesanů?
hu: Úgy gondolom, ezt akarja mondani. Tehát, Kalóz, azért hoztál minket ide, hogy ezekkel a wesfolkokkal szövetkezzünk?
pl: Zakładam że właśnie o tym cały czas myślał. Więc, Black, przyprowadziłeś nas tutaj żeby pomógł nam Lud Wesfolk?
sv: Jag antar att det är det han menar, ja. Så, Black, förde du oss hit för att dessa wesfolk skulle hjälpa oss?

source: Well, yes, something like that.
ca: Hum, bé, sí, això mateix.
cs: No, jo, něco takového...
hu: Nos, igen, ilyesmi járt az eszemben.
pl: Uch, tak, coś mniej więcej w tym stylu...
sv: Hm, ja, någonting ditåt.

source: I see, brother, that you have returned with warriors. Are they to help us defeat these orcs?
ca: Veig que has tornat amb guerrers, germà. Estan preparats per derrotar aquestos orcs?
cs: Vidím bratře, že jsi se vrátil s válečníky. Pomůžou nám porazit tyhle skřety?
hu: Látom, testvér, hogy sereggel tértél vissza. Segítenek nekünk megsemmisíteni az orkokat?
pl: Widzę bracie że wróciłeś z przyjaciółmi. Pomogą nam w walce z tymi orkami?
sv: Jag ser att du har återvänt med krigare. Skall de hjälpa oss att besegra orcherna?

source: What? That's not why we're here!
ca: Cóm? No estem ací per això!
cs: Co? Proto jsme nepřišli!
hu: Micsoda? Mi nem ezért jöttünk!
pl: Co?! Nie po to tu jesteśmy!
sv: Vad? Det är inte därför vi är här!

source: Well, yes it is. You have to help them secure this city before they will help you.
ca: Bé, sí que esteu. Els haveu d'ajudar a assegurar aquesta ciutat abans que vos ajuden.
cs: Je to tak. Musíš jim pomoct zabezpečit toto město, než ti pomůžou.
hu: Nos, hát így áll a helyzet. Segítened kell nekik megvédeni a várost az orkoktól, mielőtt ők segítenének neked.
pl: No więc... tak, właśnie po to... Musisz pomóc nam zabezpieczyć miasto, później my pomożemy tobie.
sv: Jo, det är det. Ni måste hjälpa dem att säkra staden innan de hjälper er.

source: Help them? Help Islefolk? Why would we do that?
ca: Ajudar-los? Ajudar .......? Per què ho hauríem de fer?
cs: Pomáhat jim? Pomáhat Ostrovanům? Proč by jsme to dělali?
hu: Segíteni őket? A szigetlakókat? Miért tennénk?
pl: Pomóc im?! Pomóc Wyspiarzom?! Dlaczego niby mielibyśmy to zrobić?!
sv: Hjälpa dem? Hjälpa öfolk? Varför skulle vi göra det?

source: These are not Islefolk, brother, they are descendants of the Wesfolk who came over with Lady Jessica.
ca: No són illencs, germà, són els descendents d'aquells wesfolk que van arribar amb Na Jessica.
cs: To nejsou Ostrované bratře, to jsou potomci Wesanů co odpluli s paní Jesenou.
hu: Ők nem szigetlakók, testvér, ők azon wesfolkok leszármazottai, akik Lady Jessicával tartottak.
pl: Żadni Wyspiarze, bracie, to potomkowie Ludu Wesfolk który przybył na kontynent z Lady Jessicą.
sv: Detta är inte öfolk. Detta är ättlingarna till de av wesfolket som kom hit med Lady Jessica.

source: What!? Followers of that deserter!? I can't believe you think we would help them!
ca: Cóm?! Són els seguidors d'aquella desertora?!? No em puc creure que hages pensat que els ajudaríem!
cs: Cože? Následovníci té dezertérky? Nemůžu věřit, že si myslíš, že bysme jim pomohli!
hu: Micsoda!? Annak a szökevénynek a leszármazottai!? Csak nem hiszed, hogy segítenénk nekik!
pl: Co!? Potomkowie zdrajców!? Nie myślisz chyba że im pomożemy!
sv: Vad?! Anhängare till den där desertören?! Jag begriper inte hur du kan tro att vi hjälper dem!

source: I didn't have a choice, they needed help, so I made a deal that we would help them if they helped us.
ca: No tenia cap altra alternativa, necessitaven ajuda i vaig fer un tracte amb ells, si els ajudaven, nosaltres els ajudaríem.
cs: Neměl jsem na vybranou. Potřebovali pomoc a tak jsem uzavřel dohodu, že jim pomůžeme, když oni pomůžou nám.
hu: Nem volt más választásom. Megegyeztünk, hogy segítünk neki, ha előbb ő segít nekünk.
pl: Nie miałem wyboru, potrzebowali pomocy więc ubiłem z nimi interes - pomogą nam pokonać orków, ale my później musimy pomóc im.
sv: Jag hade inget val. De behövde hjälp själva, så jag träffade ett avtal med dem, om att vi skulle hjälpa dem om de hjälpte oss först.

source: Trust me, we don't like helping undead any more than you like helping us 'deserters'.
ca: Creu-me, no ens agrada ajudar als no morts més que a tu ajudar-nos a nosaltres, 'desertors'.
cs: Věř mi, netěší mě pomáhat nemrtvým o moc víc než tobě pomáhat nám „dezertérům“.
hu: Hidd el, nekünk sem okoz nagyobb örömöt élőholtaknak segíteni, mint nektek segíteni minket, 'szökevényeket'.
pl: Uwierz mi, nie lubimy pomagać nieumarłym bardziej niż Ty nie lubisz pomagać "zdrajcom".
sv: Lita på mig, vi tycker inte om att hjälpa vandöda än ni tycker om att hjälpa oss 'desertörer'.

source: Fine. I'll help you do whatever it is you want to do, once we clear this land of the orcs.
ca: Val. Faré tot el que puga per ajudar-vos una vegada netegem aquesta illa de l'escòria orca.
cs: Dobrá. Pomohu vám v čemkoli budete chtít, jakmile vyčistíme tuto zem od skřetů.
hu: Legyen. Segítünk nektek, akármit is akartok csinálni, miután megtisztítottuk ezt a szigetet az orkoktól.
pl: Dobrze. Zrobię dla was wszystko co mi rozkażecie, ale najpierw musimy oczyścić ten teren z orków.
sv: Då så. Jag hjälper er med vad det nu är så snart vi rensat ut orcherna ur det här landet.

source: Int'resting council! But now, little men, its time to die. Get'm!
ca: In-prezionant consell! Però ara, escarabats, anem a esclafar-vos. A per ells!
cs: Zajímavej pokec, ale teď mužíčci, přišel čas zgebnout. Sejměte je!
hu: Meccsoda egyesség! De most, emberkék, meg fogtok halni. Kapjátok el őket!
pl: Interesująca pogadanka! Ale teraz, małe człowieczki, czas umierać! Brać ich!
sv: Intressant råd! Men nu, små män, är det dags att dö. På dem!

source: Well, we've cleared the orcs away. Come on, now you have to hold up your end of the bargain.
ca: Bé, ja hem eliminat els orcs. Vinga, ara vos toca a vosaltres mantenir la vostra part del tracte.
cs: Tak, zničili jsme skřety. Takže teď byste měli vy dodržet svou část dohody.
hu: Nos, kitakarítottuk az orkokat. Akkor most ti teljesítsétek az üzlet rátok eső részét!
pl: Przegoniliśmy orków. Nadszedł czas żebyśmy dokończyli naszą umowę.
sv: Så, då är orcherna borta. Sätt fart, nu är det er tur att uppfylla avtalet.

source: Well, the orcs will probably be back soon... I think that we are going to end up dying here, no matter what you do. We have held up extraordinarily long already.
ca: Bé, els orcs tornaran prompte... Crec que acabarem morint ací, no importa el que fem. Ja duem resistint massa temps...
cs: Skřeti se pravděpodobně brzy zase vrátí... Bez ohledu na to, co jsi udělal, si myslím, že bysme tu měli přestat chcípat. Už jsme se tu drželi mimořádně dlouho.
hu: Nos, az orkok hamarosan vissza fognak jönni... Azt hiszem mindannyian itt fogunk meghalni, s ezen te sem tudsz változtatni. Már eddig is a vártnál tovább tartottunk ki.
pl: Eh, orkowie najprawdopodobniej wrócą za kilka dni... Myślę że i tak czeka nas tutaj tylko zagłada, nie można już nic zrobić.
sv: Nå, orcherna kommer säkert tillbaka snart... Jag tror att vi kommer ända våra dagar här, oavsett vad ni gör. Vi har lyckats stå emot väldigt länge.

source: That's true. I think it would be best if we could get enough ships to get off of this island. The one I went out on was our last, and we can't make more.
ca: És veritat. Pense que seria millor agarrar unes quantes naus i anar-nos d'aquesta illa. Jo em vaig anar en l'última que ens quedava, i ja no sabem fer-ne més.
cs: To je pravda. Myslím, že nejlepší by bylo, kdybychom měli dost lodí, abychom z tohodle ostrova odešli. Ta, na které jsem minule odplul, byla naše poslední a my neumíme vyrobit další.
hu: Ez igaz. Azt hiszem, ha lenne még néhány hajónk, akkor mindannyian elmehetnénk a szigetről. De az utolsó hajónkkal én távoztam a szigetről, s többet nem tudunk építeni.
pl: To prawda. Sądzę że najlepszym wyjściem byłoby opuszczenie wyspy, tylko że to tego jest potrzebnych dużo okrętów. Ten na którym wypłynąłem, był naszym ostatnim a nie potrafimy zbudowac ich więcej.
sv: Det är sant. Jag tror att det bästa är att försöka få tag på nog med skepp för att ta oss härifrån. Den jag for iväg med var vår sista, och jag tror inte att vi kan bygga fler.

source: Well, I am a shipbuilder. I could help you build more ships, and then you could bring all of your people back east with us.
ca: Bé, jo sóc un armador i sé cóm construir vaixells. Podria ajudar-vos i, aleshores, vosaltres podríeu dur tota la vostra gent cap a l'est amb nosaltres.
cs: No, já jsem i stavitel lodí. Mohu vám pomoct postavit dost lodí a pak můžete vzít všechny vaše lidi na východ zpět s námi.
hu: Nos, én tudok hajót építeni. Segíthetek építeni néhányat, s azokkal mindnyájan eljöhettek keletre.
pl: Rozumiem, tak się składa że pracowałem w stoczni. Mogę Ci pomóc zbudować więcej okrętów, wtedy będziesz mógł zabrać swoich ludzi i wrócić z nami na wschód.
sv: Nåväl, jag är skeppsbyggare. Jag kunde hjälpa dig att bygga fler skepp, och sedan kan du och dina mannar följa med oss österut.

source: That sounds good.
ca: M'agrada cóm sona.
cs: To zní dobře.
hu: Ez jól hangzik.
pl: To brzmi całkiem nieźle.
sv: Det låter bra.

source: Then it is agreed. But after that, you have to help us fight the orcs!
ca: Val, ja estem tots d'acord. Però després d'això, ens haureu d'ajudar a combatre els orcs!
cs: Takže platí. Ale pak nám musíte pomoct bojovat se skřety!
hu: Akkor megegyeztünk. De azután segítenetek kell minket az orkok elleni harcunkban.
pl: A więc wszystko uzgodnione. Nie zapomnijcie tylko później pomóc nam w walce z orkami!
sv: Överenskommet. Men efter det måste du hjälpa oss mot orcherna!

source: Besieged Orcs
hu: Ostromlott orkok

source: Wesnoth Army
hu: Wesnothi sereg

source: Angry Elves
hu: Haragvó tündék

source: As the warriors landed the Explorer, they overheard the elves, men and orcs talking...
ca: Mentre els guerrers amarraven l'Explorador, van sentir de passada la conversa entre els orcs, elfs i orcs...
cs: Jakmile válečníci přistáli s Průzkumníkem, zaslechli, jak se elfové, lidé a skřeti dohadují...
hu: Ahogy az Explorerről kiszálltak a harcosok, fülüket megütötte egy tündék, emberek és orkok közt zajló vita...
pl: Kiedy wojownicy opuścili Obserwatora, podsłuchali rozmowę elfów, ludzi i orków...
sv: När krigarna landsteg med Utforskaren, så hörde de alver, människor och orcher som rådslog...

source: Orc, you promised that, if we allied with you, you would free all the prisoners you took when you captured Elensefar. You have broken our pact!
ca: Orc, vas prometre que, si ens aliàvem amb tu, alliberaries tots els presoners que vas prendre quan vareu capturar Elensefar. Has trencat el pacte!
cs: Skřeti, slíbili jste, že pokud se s vámi spojíme, tak osvobodíte všechny vězně, které jste zajmuli při obsazování Elensefaru. Porušili jste naši smlouvu!
hu: Orkok, megfogadtátok, hogy ha szövetségre lépünk veletek, szabadon bocsátjátok az összes foglyot, akiket Elensefar elfoglalásakor ejtettetek. Megszegtétek az egyezségünket!
pl: Orku, przyrzekłeś że po zawarciu naszego sojuszu wypuścisz wszystkich więźniów kiedy zdobędziesz Elensefar. Złamałeś naszą umowę!
sv: Orch, du lovade att om vi gick samman med er, så skulle ni befria alla de fångar ni tog när ni intog Elensefar. Ni har brutit vår pakt!

source: Ag, elf-dog, you shuttup! I aint takin' orders fr'm you!
ca: Ag, calla't ja, merdós! No rep cap ordre de tu!
cs: Ah, elfí pse, drž hubu! Ty mi neporoučíš!
hu: Hő, kutya tünde, elég az acsarkodásbú! Nem parancsósz nekem!
pl: Ag, psi pomiocie, zamknij się! Nie bedziesz mi rozkazywał co mam robić!
sv: Agh, alvhund, du håller käften! Jag tar inga order från dig!

source: Listen, Pakch-Glun, if you don't fufill your side of the treaty, we will attack you again! And this time, we will probably win, since our reinforcements have arrived, and there are two armies to attack you.
ca: Escolta'm, Pakch-Glun, si no compleixes amb la teua part del pacte, et tornarem a atacar! I aquesta vegada sí que guanyarem, ja que els nostres reforços ja han arribat, i som dos exèrcits per atacar-te!
cs: Poslouchej Pakš–Glune, pokud nesplníš svou část dohody, znovu na tebe zaútočíme! A tentokrát nejspíš vyhrajeme, protože naše posily jsou tady a jsou na tebe připraveny zaútočit dvě armády.
hu: Na idehallgass, Pakch-Glun, ha nem teljesíted a vállalásaidat, újra megtámadunk! S ezúttal győzni fogunk, mert megérkezett az erősítésünk, s két sereg áll szemben veled.
pl: Słuchaj, Pakch-Glun, jeśli nie spełnisz swojej roli w tym przedstawieniu, znowu Cię zaatakujemy! Ale tym razem prawdopodobnie wygramy, odkąd przybyły nasze posiłki masz na karku dwie armie do pokonania!
sv: Lyssna, Pakch-Glun, om du inte fullgör din del av avtalet, så anfaller vi er igen! Och den här gånger vinner vi, eftersom våra förstärkningar nått fram, och du har två arméer mot dig.

source: Heh, shur. I'd like t' see you try!
ca: Va, vinga, aneu venint en fila d'un!
cs: Hehe. Bych chtěl vidět, jestli si troufnete!
hu: Mit csipogsz kismadár? Csak próbálkozz nyugodtan!
pl: Heh, jasne. chciałbym to zobaczyć.
sv: He, visst. Försök bara!

source: Mathein, shall we attack?
ca: Mathein, l'ataquem?
cs: Matheine, máme zaútočit?
hu: Mathein, támadunk?
pl: Mathein, zaczynamy?
sv: Mathein, skall vi anfalla?

source: Yes. Pakch-Glun, prepare to die!
ca: Sí. Prepara't per morir, Pakch-Glun!
cs: Ano. Pakš–Glune, připrav se na smrt!
hu: Igen. Megdöglesz, Pakch-Glun!
pl: Tak. Pakch-Glunie, przygotuj się na śmierć!
sv: Ja. Pakch-Glun, Bered dig att dö!

source: This was welcome news to the crew of the Explorer. However, although the elves, men and orcs would fight each other, Meneldur still had to fight all of them.
ca: La tripulació de l'Explorador ho van rebre com a bones notícies. Tanmateix, encara que els elfs, orcs i humans lluitaren entre ells, Meneldur encara hauria de derrotar-los tots.
cs: To byla vítaná novinka pro posádku z Průzkumníka. Přestože se elfové, lidé a skřeti chystali proti sobě bojovat, Meneldur stále musel bojovat proti všem.
hu: Zene volt ez a legénység fülének. Habár a tündék, az emberek és az orkok egymás ellen harcoltak, Meneldurnak mindegyikükkel le kellett számolnia.
pl: Takie to powitanie usłyszała załoga Odkrywcy. I choć elfy, ludzie i orkowie chcieli walczyć między sobą , Meneldur musiał i tak walczyć z nimi wszystkimi.
sv: Detta var välkomna nyheter för Utforskarens besättning. Men, även om alverna, människorna och orcherna skulle strida mot varandra, så var Meneldur ändå tvungen att strida mot dem allihop.
