Repository: moonymeric/Saving_Elensefar
Catalog: translations/*/*.po
Languages: ca, cs, hu, pl, sv

source: Impressive. You were able to storm my game. May I join you on your quest?
hu: Lenyűgöző! Képes voltál lenullázni. Csatlakozhatnék hozzátok?

source: Err
hu: Hááát

source: Sure, we need any willing hand
hu: Természetesen, szükség van minden segítő kézre

source: That was a weird battle...
hu: Hátborzongató csata volt...

source: ... in the magic castle.
hu: ... egy mágus kastélyában.

source: Look, we have gain more soldiers for our quest. Wy did you complain?
hu: Nézd, újabb harcosokat szereztünk a küldetésünkhöz. Miért panaszkodsz?

source: You win!
hu: Nyertél!

source: You lost.
hu: Vesztettél.

source: Orc Mountain
ca: La muntanya dels orcs
cs: Skřetí hory
hu: Ork hegyek
pl: Góra Orków
sv: Orchberget

source: Hungry Orcs
hu: Éhes orkok

source: Orcs are here! Orcs, what do you know about the fall of Elensefar?
ca: Hi ha orcs ací! Orcs, què sabeu de la caiguda d'Elensefar?
cs: Jsou tu skřeti! Skřeti, co víte o pádu Elensefaru?
hu: Orkok laknak itt! Hé, ork, mit tudsz Elensefar elestéről?
pl: Orkowie są tutaj! Mówcie co wiecie na temat upadku Elensefaru!
sv: Det finns orcher här! Orcher, vad vet ni om Elensefars fall?

source: Nothing, but I am glad to hear of it! Now prepare to die!
ca: No res, però m'agrada sentir-lo! Ara prepareu-vos per morir!
cs: Nic, ale jsem štastej, že to slyším! A teď vás čeká smrt!
hu: Semmit, de örülök, hogy most megtudtam! Készülj a halálra!
pl: Nic o tym nie wiem, ale cieszą mnie niezmiernie te wieści! A teraz czas umierać ludzie!
sv: Inget, men jag är glad att få reda på det! Nu, bered dig att på dö!

source: Very well. Let battle commence.
ca: Molt bé. Que comence la batalla.
cs: Tak dobře. Ať bitva započne.
hu: Jól van. Induljon a csata!
pl: A więc niech bitwa się rozpocznie.
sv: Då så. Låt kampen börja.

source: Theft
ca: Robatori
cs: Krádež
hu: Hajólopás
pl: Złodziej
sv: Stöld

source: Death of Psison
ca: Mort de Psison
cs: Psison zemře
hu: Psison elesik
pl: Śmierć Psisona
sv: Psison dör

source: Are there any inhabitants of this island? We come in peace, we just want to restock our ship and then be on our way...
ca: Hi ha habitants en aquesta illa? Som hòmens de pau, només volem reomplir els queviures del nostre vaixell i seguir amb el nostre camí...
cs: Jsou zde nějací obyvatelé? Přicházíme v míru, chceme jen doplnit lodní zásoby a pak zas poplujeme svou cestou...
hu: Laknak egyáltalán ezen a szigeten? Békével jöttünk, csak a készleteinket szeretnénk feltölteni, aztán megyünk is tovább...
pl: Czy ktoś zamieszkuje tą wyspę? Przychodzimy w pokoju, chcemy uzupełnić zapasy i ruszyć w dalszą drogę...
sv: Har den här ön några invånare? Vi kommer i fred! Vi vill bara fylla på våra förråd och så ger vi oss av igen...

source: Hey! What happened to The Explorer! She's gone!
ca: Ei! Què ha passat amb l'Explorador! Ha desaparegut!
cs: Hej! Co se to děje s Průzkumníkem! Vždyť odplouvá!
hu: Hé! Hol van az Explorer? Eltűnt!
pl: Hej! Co się stało z Obserwatorem? Zniknął!
sv: Vad har hänt med Utforskaren! Hon är borta!

source: Someone must have stolen her. It looks like we're stuck on this island.
ca: Algú deu haver-lo robat. Pareix que estem estancats dins d'aquesta illa.
cs: Někdo ho musel ukrást. Vypadá to, že jsme na tomhle ostrově uvízli.
hu: Valaki ellopta. a szigeten ragadtunk.
pl: Ktoś musiał go ukraść! Wygląda na to że zostaliśmy unieruchomieni na tej wyspie!
sv: Någon måste ha tagit henne. Det verkar inte bättre än att vi är fast på den här ön.

source: Hello, I believe I can help.
ca: Hola, crec que puc ajudar-vos.
cs: Zdravím, věřím, že mohu pomoci.
hu: Helló! Azt hiszem, segíthetek.
pl: Witajcie, myślę że mogę wam pomóc.
sv: Hej, jag tror att jag kan vara till hjälp.

source: Who are you, and what do you want?
ca: Qui eres, i què vols?
cs: Kdo jsi a co chceš?
hu: Ki vagy te, és mit akarsz?
pl: Kim jesteś i czego chcesz od nas?
sv: Vem är du och vad vill du?

source: I am the leader of a great tribe of mermen. I think it was the nagas, our enemies, who stole your boat. I will lend you the aid of my fighters to get it back.
ca: Sóc el líder d'una gran tribu de sirènids, i crec que han sigut els nagues, els nostres ancestrals enemics, els qui han furtat el vostre vaixell. Vos prestaré l'ajuda dels meus lluitadors per recuperar-lo.
cs: Jsem vůdce velkého rodu mořských lidí. Myslím, že nágy, naši nepřátelé, ukradly vaši loď. Poskytnu vám pomoc svých bojovníků v jejím znovuzískání.
hu: A sellők törzsének vagyok a vezetője. Szerintem a nagák vitték el a hajótokat, akik a mi ellenségeink. A harcosaimat segítségül adom a hajód visszaszerzésére.
pl: Jestem przywódcą wielkiego plemienia mermenów. Sądze że za tą kradzieżą stoją nagi, nasi wrogowie. Użyczę Ci pomocy moich wojowników abyś mógł odebrać z powrotem swój statek.
sv: Jag är ledaren för en stor stam sjöfolk. Jag tror att det var nagafolket, våra fiender, som stal ert skepp. Jag lånar ut några av mina krigare för att hjälpa er att få det tillbaka.

source: Hey, look, I see the boat! Nagas are moving it southwest.
ca: Ei, mireu, ja veig el vaixell! Els nagues l'estan menejant cap al sud oest.
cs: Hej, vidím loď. Nágy s ní plují jihozápadně.
hu: Hé, odanézzetek, látom a hajót! A nagák délnyugatra viszik.
pl: Hej, patrzcie, widzę nasz okręt! Nagi udają się na południowy-zachód.
sv: Hallå, titta, jag ser båten! De flyttar den åt sydväst.

source: They've found us! Workers, get that boat out of here! We will secure time for your escape.
ca: Ens han descobert! Obrers, dueu-vos el vaixell d'ací! Intentarem guanyar temps per a que pugueu fugir.
cs: Naššli náss! Pracanti, odtáhněte odssud tu loď! Budeme krýt vášš ússtup.
hu: Felfedeztek minket! Húzzátok el onnan azt a hajót! Fedezünk titeket.
pl: Znaleźli nas! Robotnicy, zabrać z tąd tą łódź! Zabezpieczymy teren w czasie waszej ucieczki.
sv: De har hittat oss! Arbetare, få bort den där båten härifrån! Vi skall köpa lite tid för flykten.

source: Probably our boat... but we need to defeat these orcs before we get it, or else they will attack us from behind.
ca: Segurament el nostre vaixell... però abans haurem de derrotar aquestos orcs abans de recuperar-lo, o ens atacarien per darrere.
cs: Nejspíš naše loď... potřebujeme ale nejdřív porazit tyto skřety nebo nám jinak zaútočí do zad.
hu: Talán a hajónkhoz... de előbb az orkokkal kell végeznünk, mielőtt átmegyünk rajta, különben még hátbatámadnának.
pl: Prawdopodobnie nasz statek... musimy pokonać tych orków przed dostaniem się do niego, jeśli tego nie zrobimy zaatakują nas od tyłu.
sv: Antagligen vår båt... Men vi måste besegra orcherna innan vi får tag på den, annars kommer de att falla oss i ryggen senare.

source: Back to the Ship
ca: De nou en el vaixell
cs: Návrat na loď
hu: Vissza a hajóra
pl: Powrót na Okręt
sv: Tillbaka till skeppet

source: Ocean Orcs
hu: Szigeti orkok

source: Thiefs
hu: Tolvajok

source: Time to get our ship back. These islands are inhabited, there should be a harbor *somewhere*.
ca: Ja és hora de recuperar el nostre vaixell. Aquestes illes estan habitades, deuria haver-hi algun port *en algun lloc*.
cs: Je čas dostat naši loď zpět. Tyto ostrovy jsou obydlené, tudíž tady někde musí být něco jako přístav.
hu: Ideje visszaszerezni a hajónkat. Ezek a szigetek lakottnak tűnnek, *valahol* kell lennie egy kikötőnek is.
pl: Czas odebrać nasz statek. Na tej wyspie na pewno ktoś mieszka, gdzieś tu powinna być przystań.
sv: Det är dags att ta tillbaka vårt skepp. De här öarna är bebodda, så det borde finnas en hamn någonstans.

source: These Nagas don't leave us alone! They're here again, and the ship is here somewhere too.
ca: Aquestes nagues no ens deixen a soles! Ja tornen, i el vaixell també està per ací.
cs: Ty nágy nás nenechají na pokoji! Pořád tu někde jsou a loď tu někde také je.
hu: Ezek az orkok nem hagynak minket békén. Újra itt vannak, s valahol itt van a hajó is.
pl: Te nagi nie zostawią nas chyba nigdy w spokoju! Znowu tu są, a statek napewno z nimi.
sv: Det där nagafolket lämnar oss inte i fred! De är här igen, och skeppet är också här någonstans.

source: Orcs! More orcs!
ca: Orcs! Més orcs!
cs: Skřeti! Další skřeti!
hu: Orkok! Még többen vannak!
pl: Orkowie!
sv: Orcher! Fler orcher!

source: I knew there were nagas around here...
ca: Sabia que hi havia nagues per ací...
cs: Věděl jsem, že tu někde nágy jsou...
hu: Tudtam, hogy errefelé rejtőznek a nagák...
pl: Wiedziałem że gdzieś tutaj były nagi...
sv: Jag visste att nagafolket huserade här...

source: Now, to the harbor, and back on to the ship!
ca: Ara, anem al port i tornarem al vaixell!
cs: A teď do přístavu a zpátky nalodit!
hu: És most irány a kikötő, s szálljunk hajóra!
pl: Teraz do przystani i na statek!
sv: Nu, tillbaka till hamnen och skeppet!

source: I will leave you now, but the fighters who fought for you will still help you, they say.
ca: Vos deixe, però els que han lluitat amb vosaltres continuaran fent-ho, pel que diuen.
cs: Já vás nyní opustím, ale bojovníci, co pro vás bojovali říkají, že vás budou nadále doprovázet.
hu: Én nem kísérlek tovább titeket, de a harcosaim továbbra is segítenek.
sv: Jag lämnar er nu, men krigarna som har slagits med dig stannar och hjälper dig, säger de.

source: Fire Island
ca: L'illa de foc
cs: Ohnivý ostrov
hu: Vulkánsziget
pl: Wyspa Ognia
sv: Eldön

source: Sir Drake
hu: Perzsekény úr

source: Rougth Drakes
hu: Kegyetlen perzsekények

source: Survive until the last turn
hu: Kitartasz az utolsó körig

source: Rescue as many Pirates you can
hu: Megmentesz annyi kalózt, ahányat csak tudsz

source: Figtht of the Drakes
hu: Harcolsz a perzsekények ellen

source: This island is nearly dead. We can only reprovision slowly here.
ca: Aquesta illa està totalment morta. No podem aprovisionar-nos ací.
cs: Na tomto ostrově skoro nic není. Můžem tady doplnit jen pár zásob.
hu: Ez a sziget szinte teljesen kihalt. Csak sokára tudjuk feltölteni a készleteinket.
pl: Ta wyspa jest całkowicie martwa. Nie uzupełnimy tu zapasów.
sv: Den här ön är helt livlös. Vi kan inte proviantera här.

source: Yes, and that would take lot of time. I hope there is nobody that can hinder us doing it, but wait, we should explore the island and being sure about it.
hu: Igen, időbe telik. Remélem nincs senki, aki akadályozna bennünket, de jobb lenne, ha erről meggyőződnénk.

source: Ouch, my ears! What was that?
hu: Aúú, megsüketülök! Mi volt ez?

source: Quickly! To the boats. The volcano is erupting
hu: Gyorsan! A hajóra! Vulkánkitörés.

source: But let us first get some provisions
hu: De ne felejtkezzünk el a készletekről!

source: Men, be carefull with the erupting lava
hu: Legyetek óvatosak a lávafolyás környékén!

source: What are these beasts? They look like miniature dragons!
ca: Què són aquestes bèsties? Pareixen dragons en miniatura!
cs: Co je toto za nestvůry? Vypadají jako zmenšení draci!
hu: Mik ezek a szörnyek? Apró sárkányoknak látszanak!
pl: Co to za bestie? Wyglądają jak miniatury smoków!
sv: Vad är det här för odjur? De ser ut som drakar i miniatyr!

source: They do not look like they belong on this island. Perhaps they came from the south? In any case, they don't look friendly.
ca: No pareix que siguen autòctons d'aquesta illa. Potser van vindre del sud? De tota manera, no pareixen gaire amistosos.
cs: Nevypadaj, že žijou na tomhle ostrově. Možná přišli z jihu? Každopádně nevypadaj přátelsky.
hu: Nem úgy tűnik, mintha őslakók lennének. Talán délről jöttek? Bárhonnan is, nem túl barátságosak.
pl: Nie wyglądają na mieszkańców tej wyspy. Może przybyły z południa? Mimo wszystko, nie wyglądają przyjaźnie.
sv: De ser inte ut som att de hör hemma på den här ön. Kanske kom de söderifrån? Hur som helst så ser de inte vänliga ut.

source: True. Well then, we should defeat them so we can reprovision!
ca: Tens raó. Bé, aleshores haurem de derrotar-los per tal d'aprovisionar-nos!
cs: Pravda. No, když je porazíme, můžem získat zásoby!
hu: Igaz. Nos, akkor irtsuk ki őket, ne akadályozzák a készletfeltöltést!
pl: Prawda. Powinniśmy ich pokonać i wykorzystać zapasy które posiadają.
sv: Sant. Nåväl, vi måste kuva dem så att vi kan proviantera!

source: Humans? So far away from wesnoth?
hu: Emberek? Ilyen messze Wesnothtól?

source: At last! A ship! We are saved.
hu: Végre! Egy hajó! Meg vagyunk mentve!

source: Shipwrecked Pirates
hu: Hajótörött kalózok

source: Who are you? What are you doing so far away from wesnoth?
hu: Kik vagytok? S mit kerestek itt, ilyen messze Wesnothtól?

source: We came from Elensefar wich has been overrun by orcs. I'm searching for soldiers that are willing to leave with me to retake it.
hu: Elensefarból jöttünk, amit az orkok lerohantak. Harcosokat keresek, akik segítenének visszafoglalni a városomat.

source: We are from Aldril and shipwrecked on this island after the great storm. If you rescue us from here we will greatly serve you and aid to conquer Elensefar back.
hu: Mi Aldrilból vagyunk, egy vihar elsodort minket, s hajótörést szenvedtünk. Ha kimenekítesz minket, szívesen segítünk visszafoglalni Elensefart.

source: Its a deal.
hu: Megegyeztünk.

source: Traitors
ca: Traïdors
cs: Zrádci
hu: Árulók
pl: Zdrajcy
sv: Förrädare

source: Gold carryover:
hu: Arany továbbvitel:

source: What? So, if it isn't my old friend Kalandur... are there any more Wesnothians on this island, or have they given up trying to stop us?
ca: Què? Però si no és cap altre que el meu vell amic Kalandur... hi ha més wesnothians en aquesta illa o ja han abandonat la nostra cerca?
cs: Ale? Jestli to není můj starý přítel Kalandur... jsou na tomto ostrově nějací další Wesnoťané nebo už vzdali pokusy nás zastavit?
hu: Nocsak? Tán csak nem az én öreg barátomat, Kalandurt látom... vannak még wesnothiak is a szigeten, vagy feladták már, hogy elfogjanak?
pl: Co? Więc, jeśli to nie mój stary przyjaciel Kalandur... są jeszcze jacyś inni Wesnothańczycy na tej wyspie próbujący nas zatrzymać?
sv: Vad? Se där, om det inte är min gamla vän Kalandur... Är det några fler wesnother på ön eller har de gett upp sina försök att stoppa oss?

source: There are none here, but trust me, they remain against you.
ca: No hi ha cap, però fia't de mi, no s'han oblidat encara.
cs: Nejsou tu žádní, ale věř mi, stále po tobě jdou.
hu: Nincs több, legalábbis itt, de hidd el, nem adták föl.
pl: Nie ma tu nikogo innego, ale uwierz mi, chcą się Ciebie pozbyć.
sv: Det är inga här, men lita på mig, de har inte gett upp ännu.

source: So say you. Well, Black, we'd better go. Its best not to kill more elves; even if we defeat them, it will just make the rest even angrier at us.
ca: Això és el que tu dius. Bé, Negre, es millor que ens anem. És una bona idea no matar més elfs; encara que els derrotarem, només aconseguiríem que la resta ens odiara encara més.
cs: Jak říkáš. No Černesi, měli bychom jít. Bylo by nejlepší nezabíjet další elfy. I kdyby jsme je porazili, ti zbylí by se na nás jen víc naštvali.
hu: Azt mondod? Jól van, Kalóz, jobb, ha megyünk. Nem akarok több tündét legyilkolni; mégha elintéznénk is ezeket, csak jobban felbőszítenénk a többit.
pl: Tak jak powiedziałeś. Black, lepiej będzie jak z tąd pójdziemy. Nie musimy zabijać więcej elfów, a jeśli ich pokonamy, staną się jeszcze bardziej wrodzy w stosunku do nas.
sv: Så det säger du. Nå, Black, det är bäst vi går. Vi borde inte döda några fler alver nu; även om vi besegrar dem så kommer de andra bara att bli ännu argare på oss.

source: What? So, if it isn't my old friend Kalandur. (we'd better get out of here, Madru...)
ca: Què? Vaja, si és el meu vell amic Kalandur. (anem-nos d'ací, Madru...)
cs: Ale? Jestli to není můj starý přítel Kalandur. (Madru, měli bysme odtud radši vypadnout...)
hu: Nocsak, tán csak nem Kalandurt látom, öreg barátomat. (jobb lenne, ha eltűnnénk innen, Madru...)
pl: Co? Czy to nie mój stary przyjaciel Kalandu? [szeptem] Madru, najlepiej będzie jak z tąd odejdziemy.
sv: Vad? Se där, om det inte är min gamla vän Kalandur... (Vi borde ta oss härifrån, Madru...)

source: So we meet again, traitor elf! Prepare to die!
ca: Ens tornem a trobar, elf traïdor! Prepara't per morir!
cs: Tak jsme se znovu setkali, zrádný elfe! Přišla tvá smrt!
hu: Hát megint találkozunk, áruló! Készülj a halálra!
pl: A więc spotykamy się kolejny raz, zdrajco rasy! Gotuj się na śmierć!
sv: Vi möts igen, förrädare! Bered dig att dö!

source: Whats going on here?
ca: Què passa ací?
cs: Co se to tady děje?
hu: Mi folyik itt?
pl: Co się tu dzieje?
sv: Vad händer här?

source: Kalandur here thinks I betrayed Elfkind by aiding Elensefar. He's going to fight us. We have to leave.
ca: Aquest Kalandur es pensa que vaig trair la raça elfa ajudant Elensefar. Vol combatre amb nosaltres, deuríem anar-nos.
cs: Tady Kalandur myslí, že jsem tím, že pomáhám Elensefaru zradil elfí rod. Hodlá s námi bojovat. Měli bychom odejít.
hu: Kalandur itt azt hiszi, hogy elárultam a tündéket, mert Elensefart segítem. Harcolni akar. El kell hagyjuk a szigetet.
pl: Kalandur myśli że zdradziłem elfów pomagając Elensefarowi. Chce z nami walczyć. Musimy odejść...
sv: Kalandur här tror att jag förrådde alvfolket när jag bistod Elensefar. Han kommer att anfalla oss! Vi måste åka!

source: Look, if we leave now, they'll just follow us and kill us. We have to defeat them!
ca: Mireu, si ens anem ara, ens seguiran i ens mataran. Hem de derrotar-los!
cs: Podívej, jestli teď odejdeme, tak nás budou jen pronásledovat a zabíjet. Musíme je porazit!
hu: Ha most elfutunk, akkor üldözni fognak, és meg fognak ölni. Meg kell őket semmisítenünk!
pl: Popatrz, jeśli teraz odejdziemy, będzie za nami podążać i w końcu nas dopadnie i zabije. Musimy go pokonać!
sv: Alltså, om vi åker nu så kommer de bara att följa efter oss och döda oss. Vi måste nedgöra dem!

source: If we leave, he will probably not follow us. He will report to his superiors - wherever they are.
ca: Si ens anem, segurament no ens seguirà. Informarà els seus superiors - siguen on siguen.
cs: Když odejdeme, pravděpodobně nás nebude pronásledovat. Podá hlášení svým velitelům, ať ti už jsou kdekoli.
hu: De ha elmegyünk, akkor talán nem jönnek utánunk. Jelenteni fogja a feletteseinek - akárhol is vannak.
pl: Jeśli odjedziemy, prawdopodobnie nie ruszy za nami. Będzie musiał zdać swoim przełożonym raport - gdziekolwiek oni są.
sv: Om vi åker så kommer han nog inte att följa efter oss. Han kommer att rapportera till sina chefer, var nu de finns.

source: And won't those superiors send out even more ships? If we let Kalandur get away, they will know where we are and where we are coming from.
ca: I aquestos superiors no manaran encara més vaixells? Si deixem Kalandur de banda, sabran on estem i d'on venim.
cs: A nepošlou tito velitelé jen více lodí? Když necháme Kalandura být, budou vědět, kde jsme a odkud jsme.
hu: És azok a felettesek majd békésen ülnek a babérjaikon? Ha Kalandurt futni hagyjuk, tudni fogják merre járunk, s egy flotta ered a nyomunkba.
pl: A jego przełożeni z pewnością nie wyślą tutaj większej ilości statków. Jeśli pozwolimy Kalandurowi odejść, będą wiedzieć gdzie jesteśmy i skąd przybywamy!
sv: Kommer de inte att skicka ut ännu fler skepp? Om vi låter Kalandur komma undan så vet de var vi är och var vi kommer ifrån.

source: Very well. Onward!
ca: Molt bé. Endavant!
cs: Dobrá tedy. Kupředu!
hu: Igazad van. Előre!
pl: Niech tak będzie. Naprzód!
sv: Nåväl. Framåt!

source: So, we have slain an Elf! I do not like this - they are not evil, they are only following the commands of their twisted leader. Perhaps if we spare them their lives, they will join us after we defeat them.
ca: Vaja, hem hagut de matar un elf! Nom m'agrada açò... ells no són malvats, només segueixen les ordres del seu retort líder. Tal vegada si els perdonàrem ses vides, s'unirien a nosaltres després que els derrotàrem.
cs: Zabili jsme elfa! Nemám z toho radost. Nejsou zlý, jen poslouchají rozkazy svého zvráceného vůdce. Možná pokud bysme ušetřili jejich životy, přidali by se po své porážce k nám.
hu: Meg kellett ölnünk egy tündét! Nem tetszik ez nekem - nem gonoszok ők, csak parancsot követnek. Talán, ha megkímélnénk az életüket, még csatlakoznának is hozzánk.
pl: A więc zabiliśmy elfa. Nie podoba mi się to - one nie są z natury złe, tylko podążają za rozkazami pokręconego przywódcy. Może kiedy oszczędzimy im życie, dołączą do nas.
sv: Se där, vi dräpte en alv! Jag tycker inte om det här - de är inte onda, de följer bara sin vridna ledares order. Kanske går de med oss om vi skonar dem.

source: Look - there is a bridge here that Kalandur was guarding. I guess we should go across, but I don't have any idea what is there.
ca: Mireu - Kanaldur estava guardant un pont que ací n'hi ha. Crec que deuríem travessar-lo, però no sé que pot haver-ho a l'altre costat.
cs: Dívejte, je tu most, který Kalandur hlídal. řek bych, že bysme měli přejít na druhou stranu, ale fakt netušim, co tam je.
hu: Nézd - Kalandur egy hidat védett. Szerintem át kéne mennünk rajta, bár fogalmam sincs, mi van a másik végén.
pl: Popatrz - mamy tu most którego pilnował Kalandur. Myślę że powinniśmy go przekroczyć, ale nie wiem co możemy spotkać po drugiej stronie.
sv: Titta, Kalandur vaktade en bro. Jag antar att vi borde gå över, men jag har ingen aning om vad som finns på andra sidan.

source: Nor do I. Probably more enemies.
ca: Jo tampoc. Segurament més enemics.
cs: Ani já ne. Nejspíš další nepřátelé.
hu: Nekem sincs. Talán még több ellenség.
pl: Ani ja. Prawdopodobnie więcej wrogów.
sv: Inte jag heller, men troligtvis mer fiender.

source: Wait! I know what's across that bridge - its more elves, who will want to kill you, and orcs.
ca: Espereu! Jo sé que hi ha a l'altre costat del pont - més elfs, que volen matar-vos, i orcs.
cs: Počkat! Vím, co je za mostem. Další elfové, kteří tě budou chtít zabít a skřeti.
hu: Megállj! Én tudom, mi van a híd túloldalán - még több tünde, akik meg akarnak ölni téged, s az orkokat.
pl: Czekaj! Wiem co jest po drugiej stronie mostu. Elfy i orkowie, którzy tylko czekają aby Cię zabić.
sv: Vänta! Jag vet vad som finns på andra sidan bron! Det är fler alver, som vill döda er, och orcher.

source: Well then, we will have a common foe with these elves!
ca: Molt bé, aleshores tindrem un enemic en comú amb els lefs!
cs: Dobře teda, aspoň budem mít s těmi elfi společného nepřítele!
hu: Nos, akkor ezeket a tündéket is ellenségként kell kezelnünk!
pl: Hmm, więc będziemy mieli wspólnego wroga razem z elfami!
sv: Bra, då har vi och alverna en gemensam fiende!

source: Um.. in a way... but in any case, I think that us elves who are still alive will join you. We can't go back to the elves now, because since we did not die they will think we are deserters.
ca: Um... Potser sí... de tota manera, crec que els elfs que hem sobreviscut ens unirem a tu. No podem tornar amb els elfs perquè pensaran que som desertors, ja que no hem mort en batalla.
cs: Uh..., v tom případě..., ale každopádně... myslím, že elfové, co přežili se k vám přidají. Nemůžeme se teď vrátit k elfům. Mysleli by si, že jsme naživu, protože jsme dezertéři.
hu: Hmmm... végül is... de talán mégsem, azt hiszem, mi, akik túléltük ezt a csatát, csatlakoznánk hozzád. Nem térhetünk vissza a többiekhez, mivel nem haltunk meg, s így szökevénynek gondolnának minket.
pl: Um... powiedzmy... ale w innym przypadku... myślę że Ci z nas którzy przeżyli tą bitwę dołączą do Ciebie. Nie możemy teraz powrócić do naszego domu, jeśli żyjemy będą nas uważać za dezerterów.
sv: Jo... På ett sätt... Men i vilket fall som helst så tror jag att de av oss alver som fortfarande är vid liv kommer att gå över till dig. Vi kan inte återvända till alverna nu, för de kommer att tro att vi har deserterat, eftersom vi inte dog.
