Repository: moonymeric/Saving_Elensefar
Catalog: translations/*/*.po
Languages: ca, cs, hu, pl, sv

source: Then join us, if you wish to. We are always open to more fighters.
ca: Uniu-vos, doncs. Sempre estem oberts a rebre nous lluitadors.
cs: Tak se k nám přidejte, pokud chcete. Vždy rádi přivítáme další bojovníky.
hu: Ha akartok, csatlakozhattok. Mindig szívesen látunk újabb harcosokat.
pl: Zawsze jesteśmy otwarci na nowych kompanów.
sv: Gå med oss då, om ni vill. Vi välkommnar alltid fler krigare.

source: Gladly! Also, there is some gold here that Kalandur was saving... you can take it, since you did defeat him.
ca: Sense cap problema! Ah, abans que m'oblide, Kanaldur solia guardar una miqueta d'or dins el castell... pots agafar-lo, ja que l'has derrotat.
cs: Rádi! A také máme nějaké zlato, které Kalandur ušetřil ... můžeš si ho vzít, protože jsi ho porazil.
hu: Örömmel! És van itt egy kevés arany is, amit Kalandur tartogatott... most már a tiéd, hogy Kalandur nincs többé.
sv: Gärna! Kalandur har dessutom lite guld undanstoppat här... Du kan ta det - det var du som besegrade honom.

source: A Deadly Alliance
ca: Una aliança mortal
cs: Smrtící aliance
hu: Halálos szövetség
pl: Zabójcze Przymierze
sv: En dödlig allians

source: Mad Alliance
hu: Őrült szövetség

source: Alandur! I suppose you want to battle? Very well, but there are orcs here also. How about we kill them first, then battle?
ca: Alandur! Supose que vols combatre'm? Bé, però també n'hi han orcs ací. Què et pareix matar-los primer i combatre després?
cs: Alandure! Předpokládám, že se chystáš na bitvu? Velmi dobře, ale jsou zde také skřeti. Co kdybychom je nejprve zabili, než se pustíme do sebe?
hu: Alandur! Feltételezem, harcolni akarsz. De orkokat is látok a szigeten. Mi lenne, ha előbb őket likvidálnánk, s aztán küzdenénk meg?
pl: Alandurze! Sądzę że mam się przygotować do bitwy? Niech tak będzie, ale jak widzisz mamy tutaj także orków. Może pokonamy ich razem?
sv: Alandur! Jag antar att du vill strida? Inga problem, men det är orcher här också. Vad säger du om att vi dödar dem först, och slåss sedan?

source: Well, if the orcs had not occupied Elensefar when they took it, but rather destroyed it, we would. But, those on the mainland have proved extremely resistant to attacks.
ca: Bé, si els orcs no hagueren ocupat Elensefar quan la van prendre, sinó l'hagueren destrossat, ho faríem. Però aquells orcs al continent han demostrat ser molt resistents als atacs.
cs: No, pokud by skřeti neobsadili Elensefar, když to dobili, ale spíše ho zničili, udělali bychom to. Ale ti na pevnině se ukázali extrémně odolní vůči útokům.
hu: Nos, ha az orkok nem szállták volna meg Elensefart, hanem lerombolták volna, ezt tenném. De azok ott kemény diónak bizonyultak, keményen védekeztek.
pl: Eh, jeśli orkowie zaraz po przejęciu zniszczyliby Elensefar, zamiast go okupować, z pewnością bym wam pomógł. Ale Ci na kontynencie udowodnili że są nadzwyczaj posłuszni i nie atakują dziko tylko słuchają rozkazów.
sv: Nå, om orcherna inte hade ockuperat Elensefar när de tog det utan raserat det istället, så hade vi kunnat göra så. Men de på fastlandet har visat sig extremt motståndskraftiga mot attacker.

source: Why does that matter? All that's important is that they're going to kill you, too!
ca: I què més dona? Només cal pensar que també et mataran a tu!
cs: Proč na tom záleží? Důležité je jen to, že se vás chystají také zabít!
hu: És akkor mi van? Előbb-utóbb úgyis megölnek téged is!
pl: Czy to ma jakieś znaczenie? W tym wszystkim najważniejsze jest to że chcą zabić także Ciebie!
sv: Vad spelar det för roll? Det som är viktigt är att dom kommer att döda dig!

source: No, we're currently concluding a peace treaty with the orcs. And it would be bad form to attack the relatives of those who you are trying to make a bargain with!
ca: No, ara mateix estem finalitzant de redactar un tractat de pau amb els orcs. I no seria diplomàtic atacar els parents d'aquells amb els quals estàs intentant negociar!
cs: Ne, v současné době uzavíráme se skřety mírovou smlouvu. A bylo by špatným tahem zaútočit na příbuzné těch, s nimiž se snažíš domluvit!
hu: Nem, békeegyezményünk van velük. S rosszul festene, ha megtámadnánk a rokonait azoknak, akikkel üzletelünk!
pl: Nie, aktualnie finalizujemy nasz traktat pokojowy z orkami. A atak byłby raczej złą formą porozumienia się z kimś z kim chcesz robić interesy.
sv: Nej, vi håller för närvarande på att förhandla fram en fred med orcherna. Det skulle vara dålig stil att anfalla deras släktingarna samtidigt som vi förhandlar med dem!

source: But these orcs are probably from a completely different tribe!
ca: Però si aquestos orcs seran d'un altra tribu! Segur!
cs: Ale tyto skřeti jsou nejspíš z úplně jiného kmene!
hu: De ezek az orkok lehet, hogy egészen más törzsből valók.
pl: Ale Ci orkowie są prawdopodobnie z zupełnie innego plemiania!
sv: Men de orcherna är förmodligen från en helt annan klan!

source: We can't take that chance! These orcs claim to be allies with the ones in Elensefar, so we MUST ally with them.
ca: No podem arriscar-nos! Aquestos orcs asseguren ser aliats dels que estan a Elensefar, per tant, HEM d'aliar-nos amb ells.
cs: Nemůžeme tu šanci promarnit! Tito skřeti tvrdí, že jsou spojenci s těmi v Elensefaru, takže se s nimi spojit MUSÍME.
hu: Nem kockáztathatunk! Ezek az orkok szövetkezhettek azokkal ott Elensefarban, tehát szövetkeznünk KELL velük.
pl: Nie możemy tego wykorzystać! Ci orkowie mogą być w sojuszu razem z tymi którzy są w Elensefarze, więc NIE MOŻEMY ich zaatakować.
sv: Vi kan inte ta den chansen! De här orcherna påstår att de är allierade med de i Elensefar, så vi MÅSTE alliera oss med dem.

source: Uh, yeah, of course... we be da same tribe... uh... Prepare to die, stupid dog-man!
ca: Eh, um, sí, això mateix... ser de la misma tribu... uh... Prepareu-vos per morir, gossos!
cs: Uh, jo, jasně... my ze stejného kmene... uh... Připrav se na smrt, hloupý pse!
hu: Huhh, persze... ugyanaz a törzs vónánk... huhh... Készüljetek a halálra, ostoba kutyafejűek!
pl: Uh, tak, oczywiście... jesteśmy z tego samego szczepu... uh... Przygotujcie się na śmierć, głupie człeczyny!
sv: Uh, ja, såklart... Vi är samma klan... Uh... Bered dig att dö, dumma hundman!

source: So the elves, too, have given up trying to stop the orcs... it seems we are on our own against them. And these elves, since we are their enemies anyway, must die.
ca: Així que els elfs també han desistit d'aturar els orcs... pareix que estem a soles contra ells. I ja ficats, els elfs, ja que també som els seus enemics, també han de morir.
cs: Takže elfové se také vzdali snahy zastavit skřety... Zdá se, že jsme proti nim sami. A tito elfové, pro které jsme tak jako tak nepřáteli, musí zemřít.
hu: Tehát a tündék is feladták, hogy megállítsák az orkokat... úgy tűnik, magunkra maradtunk ezzel a feladattal. S ezeknek a tündéknek, mivel végső soron az ellenségeik vagyunk, meg kell halniuk.
pl: Więc elfy także poddały się próbując zatrzymać orków... co znaczy że znowu jesteśmy ich przeciwnikami. A skoro są naszymi wrogami, muszą umrzeć.
sv: Så alverna har också slutat försöka stoppa orcherna... Det verkar som att vi står ensamma mot orcherna. Och eftersom vi ju är deras fiender också, så måste alverna dö.

source: The elves are willing to surrender Elensefar to orcs, just because they began to lose a few battles? We really need to get back there, soon.
ca: Els elfs estan disposats a rendir Elensefar als orcs només perquè han perdut unes poques batalles? Hem de tornar enseguida allí.
cs: Elfové jsou ochotni nechat Elensefar skřetům jen proto, že prohráli pár bitev? Opravdu se tam musíme brzy vrátit...
hu: A tündék Elensefart ork kézen akarják tudni, mivel elvesztettek pár csatát? Tényleg hamar vissza kell térnünk.
pl: Te elfy są gotowe do oddania Elensefaru w łapska orków tylko z powodu przegrania kilku bitew?! Musimy tutaj wrócić jak najprędzej.
sv: Är alverna villiga att låta Elensefar övergå i orchernas klor bara för att de började förlora några strider? Vi måste verkligen ta oss dit snart.

source: If we can just get to the western isle I spoke of, we may be able to defeat this alliance.
ca: Només si poguérem arribar a l'illa occidental que vos vaig dir, seriem capaços de derrotar aquesta aliança.
cs: Pokud se dostaneme na západní ostrov, o kterém jsem mluvil, můžeme být schopni porazit tuto alianci.
hu: Ha egyszerűen csak a nyugati szigetre mentünk volna, amit említettem, ezt a szövetséget hamarabb szétzúztuk volna.
pl: Jeśli uda nam się dotrzeć do zachodnich krain o których mówiłem, może uda nam się pokonać to przymierze.
sv: Om vi kan återerövra den västra ön som jag talade om, så har vi en chans att besegra den där alliansen.

source: With Alandur dead, I think we have defeated all of the Elves who sail the sea. We probably won't see them until we reach Elensefar... we will have many enemies when we get there.
ca: Amb la mort d'Alandur, crec que ja hem derrotat tots els elfs que naveguen. Ja no els tornarem a vore fins que arribem a Elensefar... tindrem molts enemics quan arribem allí.
cs: Teď, když je Alandur mrtvý, myslím, že jsme porazili všechny elfy, kteří se plavili po moři. Pravděpodobně už je neuvidíme, dokud nedosáhneme Elensefaru... Budeme mít mnoho nepřátel, až se tam dostaneme.
hu: Alandur meghalt, azt hiszem, minden tündét megöltünk, akiket a tengeren utánunk küldtek. Többel nem fogunk találkozni, míg vissza nem érünk Elensefarba.
pl: Myślę że z śmiercią Alandura pożegnaliśmy wszystkich elfów którzy przemierzali morze. Prawdopodobnie nie zobaczymy ich więcej aż do czasu kiedy dopłyniemy z powrotem do Elensefaru... możemy mieć wielu nowych wrogów kiedy się tam dostaniemy.
sv: I och med Alandurs död så tror jag att vi besegrat alvernas sjöstyrkor. Vi stöter nog inte på dem förrän vi kommer till Elensefar... Vi kommer att ha många fiender när vi kommer dit.

source: Well, we won, but things might go badly for us later...
ca: Bé, hem guanyat, però potser les coses no ens vagen bé després...
cs: No, vyhráli jsme, ale později se naše situace může zhoršit...
hu: Győztünk, de a dolgok számunkra rosszul alakulnak...
pl: A jednak wygraliśmy, tylko że ta wygrana może się jeszcze za nami długo ciągnąć...
sv: Nå, vi vann, men det kan gå dåligt för oss senare...

source: The Frozen Lands
ca: Les terres gelades
cs: Mrazivé kraje
hu: Fagyos föld
pl: Zamarznięte Krainy
sv: De frusna länderna

source: Frosty Dwarves
hu: Jeges törpök

source: Finally, a ship! You, in there, we wish to talk with you!
ca: Per fi! Un vaixell! Eiiii, volem parlar vosaltres!
cs: Konečně! Loď! Vy tam, chceme s vámi mluvit!
hu: Végre, egy hajó! Te, ott, beszélnénk veled!
pl: W końcu okręt na horyzoncie! Hej, Ty tam, chcę z Tobą porozmawiać!
sv: Äntligen, ett skepp! Du därinne, vi vill tala med dig!

source: What is it that you want, Dwarf? You know that elves are not usually very friendly with your kind.
ca: Què vols, nan? Saps que nosaltres els elfs no solem ser molt amistosos amb vosaltres.
cs: Co chceš trpaslíku? Víš, že elfové nejsou obvykle moc zadobře s vaší rasou.
hu: Mit akarsz, törp? Tudod, hogy a tündék nem szoktak barátkozni a magadfélékkel.
pl: Czego chcesz, krasnoludzie? Wiesz chyba o tym że elfy nie są zazwyczaj przyjacielsko nastawione do twojego gatunku?
sv: Vad vill du, dvärg? Du vet väl att alver inte är speciellt vänliga mot er sort.

source: I know this, but you are not only elves, there are some men among you, who usually help in return for gold. I need to ask your aid. We are in a desperate situation - we will all die you do not help us!
ca: Sí, ja ho sé, però veig també alguns humans entre la teua tripulació, que solen estar disposats a ajudar a canvi d'or. Necessite demanar la vostra ajuda, estem en una situació desesperada - tots morirem si no ens ajudeu!
cs: To vím. Mezi vámi nejsou ale jen elfové, ale také nějací lidé, kteří by mohli za peníze pomoci. Žádám vás o pomoc. Jsme v zoufalé situaci. Všichni zemřeme pokud nám nepomůžete!
hu: Tudom, de nemcsak tündék vannak köztetek, van ott néhány ember is, akik aranyért bármire kaphatók. Szükségünk lenne egy kis segítségre. Benne vagyunk a slamasztikában - mindannyian meghalunk, ha nem segítetek!
pl: Wiem o tym, ale widzę że rozmawiam nie tylko z elfami, masz kilku ludzi z sobą... którzy zazwyczaj z chęcią pomagają... dla złota. Muszę prosić Cię o pomoc. Jesteśmy w beznadziejnej sytuacji - wszyscy zginiemy jeśli nic nie zrobisz!
sv: Jag vet, men ni är inte bara alver, ni har några människor med er, och de hjälper ofta till i utbyte mot guld. Jag behöver er hjälp. Vi är desperata - vi kommer alla att dö om ni inte hjälper oss!

source: Why? What's going on here?
ca: Per què? Què està passant aquí?
cs: Proč? Co se tu děje?
hu: Miért? Mi folyik itt?
pl: Dlaczego? Co się tu dzieje?
sv: Vadå? Vad är det som händer?

source: There is a lord ruling here, a cruel lord, and we decided to resist him, to so as not to be enslaved. But then he called in reinforcements from the north, and he is now too strong. The battle is no longer equal, and he has decided to try to destroy us! We will give you gold if you help us.
ca: Hi ha un senyor que governa ací, un senyor cruel, i hem decidit plantar-li cara per tal de no acabar esclavitzats. Però ell va traure reforços des del nord, i ara ja és massa fort. La batalla ha deixat de estar igualada, i ha decidit destruir-nos! Vos donarem or si ens ajudeu.
cs: Vládne tu lord, krutý lord a my jsme nechtěli být jím zotročeni a vzepřeli jsme se mu. Jenže pak si povolal posily ze severu a je teď příliš silný. Síly už nejsou vyrovnány a on se rozhodl, že se nás pokusí zničit! Zaplatíme, pokud nám pomůžete.
hu: Van itt egy úr, egy kegyetlen úr, s felkeltünk ellene, mert nem bírjuk már a zsarnokoskodását. De erősítést hívott északról, s így túlerőbe került. Az erőviszonyok így felborultak, s le fog mészárolni minket. Megfizetnénk a segítségeket.
pl: Panuje tutaj pewien władca, okrutny władca, a my przeciwstawiliśmy się mu żeby nie zostać jego niewolnikami. I wtedy on wezwał posiłki z północy którym nie jesteśmy w stanie się oprzeć. Bitwa jest niesprawiedliwa, a on już zdecydował że nas zgładzi! Damy Ci złoto, dużo złota, jeśli nam pomożesz.
sv: En furste regerar här, en grym furste, och om vi inte kan hålla honom undan så blir vi förslavade. Nu har han kallat in förstärkningar från norr och har blivit för stark för oss. Vi kan inte hålla stånd längre och han har bestämt sig för att förgöra oss! Vi gäldar i guld om ni hjälper oss.

source: Very well, we will try to help you - so give us command of your troops, that we may use them more effectively.
ca: Molt bé, intentarem ajudar-vos - per tant, dóna'm el comandament de les teues tropes, així les utilitzarem amb major eficàcia.
cs: Dobře tedy, pokusíme se vám pomoci. Předej nám velení tvých jednotek, abysme je mohli lépe využít.
hu: Rendben van, megpróbálunk segíteni nektek - csatlakozzatok hozzánk, hogy jobban koordináljam a seregeket.
pl: Dobrze, postaramy się wam pomóc - przekaż nam dowodzenie nad swoimi wojskami, spróbujemy użyć ich bardziej efektywnie niż Ty to robiłeś do tej pory.
sv: Nåväl, vi skall försöka hjälpa er. Låt oss leda era trupper så att vi kan använda dem effektivare.

source: Certainly! Also, we will give you what little gold we have, if it will help you...
ca: Cap problema! També et donem tot el poc d'or que ens queda, si et serveix d'ajuda...
cs: Samozřejmě! A taky vám dám tu trochu zlata co máme, jestli vám to pomůže...
hu: Örömmel! És ezt a kis aranyat is átadjuk neked, hátha fel tudod használni...
pl: Oczywiście! Damy wam całe zloto jakie posiadamy, jeśli to Ci jakoś pomoże...
sv: Självfallet! Vi ger er också det lilla guld vi har, om det kan hjälpa er...

source: Wow
hu: Hűha

source: Thank you for helping us regain our land! My men that were fighting with you will join you now, although I will be staying here.
ca: Gràcies per ajudar-nos a recuperar la nostra terra! Els meus hòmens que han lluitat amb tu ara volen unir-se amb tu, encara que jo romandré ací.
cs: Díky, že jste nám pomohli znovu získat naši zem! Moji muži, co bojovali spolu s vámi, vás dál doprovodí, ačkoli já zůstanu tady.
hu: Köszönjük, hogy segítettetek visszavenni a földünket! Én itt maradok, de a harcosaim továbbra is elkísérnek.
sv: Tack för att du hjälpte oss att återfå vårt land! De av mina mannar som har slagits med er följer med er, men jag stannar här.

source: Alright, men, lets go back to the ship now.
ca: Molt bé, camarades, tornem al vaixell ara.
cs: Fajn, chlapi. A teď zpátky na loď.
hu: Rendben, legénység, vissza a hajóra!
pl: W porządku, załoga, czas wracać na statek.
sv: Då så, mannar, tillbaka till skeppet nu.

source: Wesnothian Forces
ca: Forces wesnothianes
cs: Wesnothské síly
hu: Wesnothi sereg
pl: Wojska Wesnothańczyków
sv: Wesnothiska styrkor

source: Lonely Outpost
hu: Elhagyott helyőrség

source: Greetings, traitor. I have what I suppose you would consider good news; Elensefar is not yet destroyed. The orcs are using it as their base for attacking us.
ca: Benvingut, traïdor. Tinc el que supose tu consideres bones notícies; Elensefar encara no ha sigut destruïda. Els orcs la estan utilitzant com a base per atacar-nos.
cs: Zdravím tě, zrádče. Mám pro tebe zprávu, o které předpokládám, že ji budeš považovat za dobrou. Elensefar ještě není zničen. Skřeti ho používají jako základnu pro výboje na naše území.
hu: Üdv neked, áruló! Van egy jó hírem a számodra, biztosan örülni fogsz neki; Elensefar még áll. Az orkok bázisként használják, hogy megtámadjanak minket.
pl: Witajcie, zdrajczykowie. Sądzę że mam dla was dobre wieści; Elensefar nie został jeszcze zniszczony. Orkowie używają go jako bazy wypadowej do ataku na nasze Królestwo.
sv: Var hälsade, förrädare. Jag har vad jag antar du tycker är goda nyheter. Elensefar är inte förstört än. Orcherna använder det som bas för att anfalla oss.

source: So that means you have heard of our suposed rebellion. Let us not waste time; shall we commence battle?
hu: Tehát már hallottál a tervezett felkelésünkről. Ne vesztegessük az időt; megütközünk?

source: Gladly. Prepare to die!
ca: Amb molt de gust. Prepara't per morir!
cs: S radostí. Připrav se na smrt!
hu: Kezdjük! Készülj a halálra!
pl: A jakże! Przygotujcie się na śmierć!
sv: Gärna. Bered dig på att dö!

source: I fear we must wipe out all of the Wesnothian troops on this isle, or they will follow us and attack our ship. Onward!
ca: Tem que haurem d'eliminar tots les tropes wesnothianes a l'illa, o ens perseguiran i atacaran el nostre vaixell. Endavant!
cs: Obávám se, že musíme vyhladit všechny wesnothský jednotky na tomhle ostrově. Jinak nás budou následovat a útočit na naši loď. Kupředu!
hu: Attól tartok, hogy minden wesnothi katonát meg kell ölnünk a szigeten, különben utánunk jönnek, s megtámadják a hajónkat. Előre!
pl: Boję się że musimy wetrzeć wszystkich Wenothańskich żołnierzy w tą wyspę... Jeśli tego nie zrobimy dalej będą za nami podążać i atakować nasz statek. Naprzód!
sv: Jag fruktar att vi måste slå ut alla wesnothtrupper här på ön. Annars kommer de bara att följa efter oss och anfalla vårt skepp. Framåt!

source: Sea Battle
ca: Batalla marina
cs: Námořní bitva
hu: Tengeri csata
pl: Bitwa Morska
sv: Sjöslag

source: The High Seas
ca: Alta mar
cs: Otevřené moře
hu: Északi tengerek
pl: Otwarte Morza
sv: På öppet hav

source: Scenario Rules:
hu: Hajózási szabályok:
pl: Zasady misji:

source: Land in a harbor to reprovision.
ca: Entra en un port per aprovisionar-te
cs: Doplnit zásoby lze přistáním v přístavu.
hu: A kikötőkben tudod feltölteni a készleteidet.
pl: Zacumuj w porcie aby uzupełnić zapasy.
sv: Landstig i en hamn för att proviantera

source: Each of their ships has enough provisions to completely restock your ship.
ca: Cada un dels seus vaixells porta prou queviures per aprovisionar completament el teu vaixell.
cs: Každá z těch lodí má dost proviantu pro doplnění tvých zásob.
hu: Az ő hajójukon lévő készlet elegendő a hajód készletének teljes feltöltésére.
pl: Każdy z okrętów Wesnoth ma wystarczjąco dużo zaopatrzenia do uzupełnienia zapasów twojego statku.
sv: Vartenda ett av deras skepp har tillräckliga förråd för att helt fylla dina.

source: Your long-term objective is to reach the lands in the West where Black the Red says there are allies, and have them join you.
ca: El teu objectiu és arribar a les terres a l'oest on Negre el Roig afirma que hi han aliats, i aconseguir que s'unisquen a tu.
cs: Tvým dlouhodobým úkolem je dosáhnout země na západě, kde by dle popisu Rudého Černese měli být spojenci, co se k vám přidají.
hu: Távlati célod elérni a nyugatra lévő szigetet, amelyet Véreskezű Kalóz említett, hogy ott szövetségesekre lelj.
pl: Twoim zadaniem jest dotarcie do krain na zachodzie gdzie według Czerwonego Blacka znajdziesz sojuszników, którzy Ci pomogą.
sv: Ditt långsiktiga mål är att nå länderna i väst där Black Röde säger att det finns allierade, och få dem att slå följe med dig.

source: Until then you cannot return to Elensefar.
ca: Fins aleshores, no podràs retornar a Elensefar.
cs: Dříve než tam dojedete, nelze se vrátit do Elensefaru.
hu: Míg el nem éred, nem térhetsz vissza Elensefarba.
pl: Podczas podróży nie możesz wrócić do Elensefaru.
sv: Innan dess kan du inte återvända till Elensefar.

source: Be at sea for 6 weeks (6 turns) without reprovisioning
ca: Estar 6 setmanes (6 torns) sense aprovisionar-te
cs: Setrvání na moři 6 týdnů (6 tahů) bez doplnění zásob
hu: Tengeren 6 hétig (6 körig) mozoghatsz újratöltés nélkül
pl: Pobyt na morzu przez 6 tygodni (6 tur) bez uzupełnienia zapasów.
sv: Var till sjöss i 6 veckor (6 drag) utan att proviantera

source: Take more than 30 weeks to reach the western lands
ca: Trigar més de 30 setmanes per arribar a les terres a l'oest
cs: Nedosáhnutí západních zemí do 30 týdnů
hu: Több, mint 30 hétig tart az út a nyugati szigetig
pl: Podróż do zachodnich krain trwa dłużej niż 30 tygodni.
sv: Misslyckas med att nå länderna i väster på 30 veckor

source: There does not seem to be anyone living on this island... except, it seems, that black-cowled man on the far side...
ca: No pareix que hi haja cap habitant vivint a aquesta illa... excepte, pareix, aquell home amb robes negres a l'altra punta...
cs: Nezdá se, že by na tomto ostrově někdo žil..., kromě toho napohled černě zahaleného muže na vzdálené straně...
hu: Nem látok itt senki élőt a szigeten... hacsaknem ott a távolban az a fekete ruhás alaknak látszó jelenség nem él...
pl: Nie wydaje się żeby ktoś mieszkał na tej wysepce... z wyjątkiem tego zakapturzonego człowieka po drugiej stronie...
sv: Ön verkar obebodd... Om man bortser från mannen i svart huva där borta...

source: Last time I was here there was a trading colony, but it seems to be gone. Their old stockades should still be here, anyway.
ca: L'última vegada que vaig estar ací, açò era una colònia comercial, però pareix que haja desaparegut. Tanmateix, els seus antics graners encara tindran alguna cosa...
cs: Naposledy, když jsem tu byl, tu byla obchodní kolonie, ale zdá se, že už nefunguje. Ale její staré opevnění by tu stejně mělo být.
hu: Utoljára, amikor erre jártam, egy kereskedőtelep volt itt, de azóta úgy látszik, megszűnt. A raktáraik és a készleteik azért még biztos itt vannak.
pl: Ostatnim razem kiedy tu byłem znajdowała się tutaj osada handlowa, wydaje mi się że teraz nic po niej nie pozostało. Stara palisada powinna być gdzieś tutaj.
sv: Sist jag var här så var det en handelsstation, men den verkar vara borta. Deras gamla barrikader borde fortfarande finnas kvar.
