Repository: moonymeric/Saving_Elensefar
Catalog: translations/*/*.po
Languages: ca, cs, hu, pl, sv

source: That does not excuse them, though, and they deserved to die.
ca: Això no és cap excusa, però, i mereixien morir.
cs: Nicméně je to neomlouvá a zaslouží smrt.
hu: Ez nem menti fel őket, megérdemelték a halált.
pl: To nie jest wytłumaczeniem tego jak postąpili, zasługiwali na śmierć.
sv: Det är ingen ursäkt, och de förtjänade att dö.

source: None of us are saying they did not.
ca: Cap de nosaltres ha dit el contrari.
cs: Nikdo z nás netvrdí opak.
hu: Azt egyikünk sem mondta, hogy nem érdemelték meg.
pl: Żaden z nas nie powiedział że byli niewinni...
sv: Ingen av oss säger att de inte gjorde det.

source: I would. We do not know the circumstances of their peace treaty, nor even to say whether an alliance, if there had been one, would have been evil. After all, our alliance with undead is not, from our view, evil, but the circumstances are very similar.
ca: Jo ho faria. No coneixem les circumstàncies dels seu tractat de pau, i no podem dir si aquesta aliança, si realment va ser-ho, haguera sigut malvada. Després de tot, la nostra aliança amb els no morts, des del nostre punt de vista, no és roïna, però les circumstàncies són bastant similars.
cs: Já ano. Neznáme okolnosti té jejich mírové smlouvy, neřkuli přímo aliance (jestli nějaká byla). Takže nevíme, jestli byly jejich úmysly zlé. Ostatně vzato, naše spojenectví s nemrtvými, jakkoli není z našeho pohledu zlé, je vlastně velmi podobnou situací.
hu: Én azért vitatnám. Nem ismerhetjük a békekötés körülményeit, mert én ezt nem nevezném szövetségnek, ha ugyan volt valami, s az aljas indokból született. A mi szövetségünk az élőholtakkal, a mi nézőpontunkból nem aljas, habár hasonló körülmények közt született.
pl: Nie znamy okoliczności w jakich zazawarli swój pakt, ani czy stał za tym sojusz zbrojny,a nawet jeśli tak było to nie mógł być sojuszem opartym na wzajemnym ufaniu sobie. Po wszystkim co się tu wydarzyło nasze przymierze z nieumarłymi nie jest, z naszego punktu widzenia, złe, ale okoliczności są bardzo podobne.
sv: Det gör jag. Vi kan inte påstå oss veta under vilka förutsättningar deras allians bildades, eller ens säga om alliansen i sig var ond. När allt kommer omkring så är ju inte vår allians med de vandöda ond, ur vår synvinkel, men förutsättningarna är snarlika.

source: They are only similar if you assume that undead are evil. Some are, true, but not all. Mine and my brother's are not.
ca: Ho són si consideres que tots els no morts són malvats. Alguns ho són, sí, però no tots. El meu germà i jo no ho som.
cs: Je podobná jen pokud předpokládáš, že nemrtví jsou zlí. Někteří skutečně jsou, ale ne všichni. Já a můj bratr určitě ne.
hu: Csak akkor hasonló, ha az élőholtakat gonosznak tekinted. Néhányan biztosan azok, de nem mind. A mi népeink nem azok.
pl: Jest tylko podobne jeśli zakładasz że nieumarli są złymi istotami. Niektórzy są, to prawda, ale nie wszyscy. Ja i mój brat nie jesteśmy źli.
sv: De är bara snarlika om du förutsätter att vandöda är onda. Vissa är det, givetvis, men inte alla. De som jag och min bror kommenderar är det inte.

source: I may be your ally, but I will never say your undead are not evil. You are probably not, probably you are just decieved as to what really occurs with undeath. But undead are evil.
ca: Puc ser el vostre aliat, però no mai diré que els no morts són bons. Tal volta tu no ho sigues, però segurament és perquè no saps què passa en realitat amb els no morts. Però els no morts són malvats.
cs: Možná jsem tvůj spojenec, ale nikdy bych neřekl, že tvoji nemrtví nejsou zlí. Vy asi nejste zlý, nejspíš jste jen oklamáni tím, co se skutečně děje ve spojení s nemrtvými. Ale nemrtvé záležitosti jsou zlé.
hu: Habár szövetségesek vagyunk, sosem mondanám, hogy az élőholtak nem gonoszak. Te nem vagy az, s talán csak megtévesztettek, mivel nem ismered, mit is jelent pontosan az élőholt lét. De az élőholtak gonoszak.
pl: Mogę być twoim sojusznikiem, ale nigdy nie powiem że nieumarli nie są źli. Ty najpewniej nie, prawdopodobnie nie stało się z Tobą to co zazwyczaj dzieje się z nieumarłymi. Lecz nieumarli są źli i nic tego nie zmieni.
sv: Jag må vara din allierade, men jag kommer aldrig att påstå att dina vandöda inte är onda. Du är det förmodligen inte, du är bara vilseledd om vad som verkligen händer med vandöda. Men vandöda är onda.

source: Come on now. Well, it is true that the circumstances are not in truth similar, but they do appear to be. The elves may have thought they were.
ca: Au, vinga, tranquils. Bé, és veritat que les circumstancies no són iguals en cap sentit, però ho pareixen. Els elfs poden haver pensat que ho eren.
cs: Pojďme dál. Dobrá, je pravda, že okolnosti nejsou ve skutečnosti podobné, ale zdát se to může. Elfové si to tak mohli myslet.
hu: Lépjünk tovább. Nos, igaz, hogy a körülmények annyira nem hasonlóak, de a látszat mégis ez. S ezt gondolhatták a tündék is.
pl: Przestańcie. To prawda że okoliczności nie są dokładnie podobne ale mają ze sobą wiele wspólnego.
sv: Kom igen. Det är sant att omständigheterna inte är helt lika, men i förstone är de det. Alverna kan ha trott att de var det.

source: I see, Meneldur. Well, I can see, in a distorted way, why the elves attacked us. But why were the humans willing to discard our age-old alliance, and attack us before the orcs?
ca: Ho entenc, Meneldur. Bé, no deixa de ser un embolic, però crec que ja comprenc per què els elfs ens van atacar. Però per què estaven els humans disposats a deixar de banda el nostre antic tractat i atacar-nos davant d'els orcs?
cs: Rozumím Meneldure. No, s přihmouřením očí chápu, proč na nás elfové zaútočili. Ale proč byli lidé ochotni odhodit naše odvěké spojenectví a útočit na nás místo na skřety?
hu: Értem, Meneldur. Nos, ha nehezen is, de azt hiszem megértettem, miért támadtak meg minket a tündék. De az emberek miért törték meg évszázados egyezményünket, s támadtak meg minket?
pl: Rozumiem Meneldurze. Teraz wiem dlaczego elfy nas zaatakowały. Ale dlaczego zrobili to ludzie i z jakiej przyczyny odrzucili nasze wielowiekowe przymierze i zaatakowali nas przed orkami?
sv: Jag förstår, Melendur. Nåja, jag kan på något vis förstå hur alverna kunde välja att anfalla oss. Men varför valde människorna att förkasta vår uråldriga pakt och anfalla oss före orcherna?

source: Well, we did attack them, multiple times. Although it was really self-defence.
ca: Bé, nosaltres també els vam atacar, i unes quantes vegades. Encara que va ser en defensa pròpia.
cs: No, my jsme na ně zaútočili. Několikrát. Ačkoli to skutečně bylo v sebeobraně.
hu: Hát, mi is megtámadtuk őket korábban, többször is. Mégha önvédelemből tettük is.
pl: Hmm, zaatakowaliśmy ich kilka razy. Choć tylko w samoobronie.
sv: Nå, vi anföll dem faktiskt, flera gånger. Men det var ju i självförsvar.

source: They wished to defeat us first, then attack the orcs. Indeed, the elves and humans could have both had that plan. But the elves lost their temper right as we arrived, and attacked the orcs immediately.
ca: Ells desitjaven derrotar-nos primer i atacar després els orcs. De fet, tant els elfs com els humans podrien haver tingut el mateix pla, però els elfs van perdre els nervis quan vam arribar i van atacar als orcs directament.
cs: Nejprve chtěli porazit nás, pak zaútočit na skřety. Jasně, takový plán mohli mít jak elfové, tak lidé. Když jsme ale dorazili, elfové ztratili nervy a okamžitě zaútočili na skřety.
hu: Először minket akartak megsemmisíteni, aztán az orkokat. Az emberek és a tündék mindketten ugyanazt akarták. Mivel a megjelenésünkkel a helyzet változott, az orkokat támadták meg először.
pl: Wesnothańczycy chcieli najpierw pokonać nas a później zaatakować orków. Tak naprawdę, elfy i ludzie mieli ten sam plan. Ale elfy straciły swoją cierpliwość kiedy my przybyliśmy i razem z ludźmi zaatakowali orków prędzej niż wcześniej to uzgodnili.
sv: De ville besegra oss först och sedan anfalla orcherna. Både alverna och människorna kan faktiskt ha planerat det så. Men alverna tappade tålamodet när vi kom hit, och anföll orcherna omedelbart.

source: That is called treachery, and would not excuse a treaty with the orcs.
ca: Això es sol anomenar traïció, i no es cap excusa que justifique un tractat amb els orcs.
cs: Tomu se říká zrada a dohodu se skřety to nějak neomlouvá.
hu: Ez akkor is árulás, és semmi sem menti az orkokkal kötött egyezséget.
pl: To się nazywa perfidna zdrada, i jej wytłumaczeniem nie jest nawet pakt z orkami.
sv: Det kallas förräderi och är inte en ursäkt för att gå samman med orcherna.

source: I agree that it would be treachery, but I think it is not what they planned. The men of Wesnoth do not see good and evil as we do. To them, good is what benefits Wesnoth, and evil is what hurts it. They may have actually planned on a permanent alliance with the Orcish state, because that would allow them to create provinces in the north unopposed.
ca: Estic d'acord en que és traïció, però estic segur que no és això el tenien planejat. Els hòmens de Wesnoth no entenen el bé i el mal com nosaltres. Segons la seua visió del mon, és bo tot allò que beneficia Wesnoth, i roin allò que li perjudica. Potser havien pensat en fer una aliança permanent amb l'estat orc, perquè això els permetria establir províncies en el nord sense cap mena d'oposició.
cs: Souhlasím, že by to byla zrada, ale nemyslím, že to tak plánovali. Wesnothští nevidí dobro a zlo jako my. Pro ně je dobré to, co prospívá Wesnothu, a zlo to, co mu škodí. Možná plánovali trvalé spojenectví se skřetí říší, protože by jim to umožnilo bez odporu vytvářet provincie na severu.
hu: Elismerem, hogy ez árulás lehet, de nem hiszem, hogy ezt tervezték. A wesnothiak nem úgy szemlélik a jót és rosszat, mint mi. Nekik az a jó, ami Wesnothnak érdekében áll, s az a rossz, ami nem. Valószínűleg tartós békére számítottak az orkokkal, hogy zavartalanul terjeszkedhessenek északon.
pl: Zgadzam się z tym że była to zdrada, ale myślę też że nie zaplanowali tego wszystkiego. Wesnothańczcy nie widzią dobra ani zła tak jak my. Dla nich dobrem jest tylko to co jest korzyścią dla Królestwa, a złem to co ich boli. Mogli mieć plan trwałego sojuszu z miastem orków tylko dlatego żeby stworzyć nowe prowincje na północy.
sv: Jag håller med om att det skulle vara förräderi, men jag tror inte att de planerade det. Wesnoths människor ser inte på gott och ont som vi gör. För dem så är det som gynnar Wesnoth gott och det som skadar Wesnoth är ont. De kan ha planerat en permanent allians med orcherna, eftersom det skulle ge dem möjlighet att skaffa sig provinser i norr utan motstånd.

source: Possibly. However, all of this is just speculation. We cannot know why they actually attacked us, can we? We can only guess.
ca: Potser. De tota manera, açò no és més que una especulació. No podem saber per què ens van atacar, no? Només podem jugar a encertar-lo.
cs: Možná. To vše je ale jen spekulace. Nemůžeme vědět, proč na nás vlastně zaútočili, že? Můžeme jen hádat.
hu: Lehetséges, de ez mind csak feltételezés. Azt már sose tudjuk meg, miért támadtak meg minket. Csak sejthetjük.
pl: To całkiem możliwe. Jednakże to wszystko tylko spekulacje. Nigdy nie będziemy wiedzieć do końca dlaczego nas zaatakowali, prawda? Możemy tylko się domyślać.
sv: Kanske var det så. Självklart är allt bara spekulationer. Vi kan så klart inte veta varför de anföll oss egentligen, eller hur? Vi kan bara gissa.

source: Which is why this is rather pointless.
ca: Per això, tot açò és prou inútil.
cs: Proto je to celkem zbytečný se dohadovat.
hu: Vagyis a sötétben tapogatózunk.
pl: Ta rozmowa staje się bezcelową.
sv: Vilket är skälet till att det här är ganska meningslöst.

source: Well, I must be going. I do not know where my people will go now; so few are left alive. But I will not stay in this city, it is too dangerous. I will go north.
ca: Bé dec anar-me'n. No sé a on anirà la meua gent ara, quedem tan poquets! Però no ens quedarem en aquesta ciutat, és massa perillós. Marxaré cap al nord.
cs: No, budu muset vyrazit. Nevím, kam teď moji lidé půjdou. Zůstalo jich tak málo naživu. Ale v tomto městě nezůstanu, je to příliš nebezpečné. Půjdu na sever.
hu: Nos, nekem mennem kell. Nem tudom, hova megyünk a népemmel; elég kevesen maradtunk. De itt nem maradok, az túl veszélyes számunkra. Északra megyünk.
pl: Eh, muszę teraz opuścić was przyjaciele. Nie wiem dokładnie gdzie mam wybrać się teraz z moimi ludźmi, zostało nas tak niewielu. Ale na pewno nie zostanę w mieście, to zbyt niebezpieczne. Udam się na północ.
sv: Nå, jag måste ge mig av. Jag vet inte vart mitt folk kan gå nu; det är så få av oss kvar. Men jag tänker inte stanna i den här staden, det är för farligt. Jag ger mig av norrut.

source: Very well. I suppose this council is ended, and the real work of Daharan's reign shall begin.
ca: Molt bé. Em pareix que aquest és el fi d'aquest consell, i ara comença el treball de debò del regne de Daharan.
cs: Dobře. Předpokládám, že tato rada je ukončena a začne skutečná práce Daharanovy vlády.
hu: Rendben van. Azt hiszem, a tanácskozást be is rekeszthetjük, s Daharan elkezdheti az uralkodás nehéz munkáját.
pl: Niech tak będzie. Mniemam że zakończyliśmy właśnie nasze spotkanie, a czas prawdziwego panowania Daharana właśnie się rozpoczął.
sv: Nåväl. Jag antar att det här rådet är avslutat och att det är dags för det riktiga arbetet under Daharans ledning att börja.

source: A King's Demand
ca: Una demanda del Rei
cs: Králův požadavek
hu: Királyi parancs
pl: Żądanie Króla
sv: Kungens krav

source: Far West
hu: Távolnyugat

source: It is the traitor who killed Aldran and Thendol approaching! Prepare to destroy him.
ca: És el traïdor que va matar Aldran and Thendol quan s'acostava! Prepareu-vos per matar-lo.
cs: Ten zrádce, který zabil Aldrana a Thendola, se blíží! Připravte se ho zničit.
hu: Itt az az áruló, aki megölte Aldrant és Thendolt! Készüljetek a csatára!
pl: Zdbliża się zdrajca który zabił Aldrana i Thendola! Przygotujcie się do bitwy!
sv: Det är förrädaren som mördade Aldran och Thendol som närmar sig! Bered er på att förgöra honom!

source: Meneldur! I bear a message from the King! If you surrender now, your life will be spared. The King is even willing to aid you in your quest to regain Elensefar. But you must pledge allegiance to the Throne again, and agree to aid it in its battles.
ca: Meneldur! Porte un missatge del Rei! Si et rendeixes ara, se't perdonarà la vida. El Rei està disposat, fins i tot, a ajudar-te en la teua missió de recuperar Elensefar. Però has de jurar lleialtat al tro de nou, i prometre que sempre l'ajudaràs en les seues batalles.
cs: Meneldure! Nesu zprávu od krále! Pokud se teď vzdáš, tvůj život bude ušetřen. Král je dokonce ochoten vám pomoci při znovuzískání Elensefaru. Musíte však znovu slíbit věrnost trůnu a souhlasit, že mu pomůžete v jeho bitvách.
hu: Meneldur! Nálam van a király parancsa. Ha megadod magad, megkíméljük az életedet. A király ráadásul segít neked Elensefar visszafoglalásában. De fel kell esküdnöd a koronára, s csatlakozni hozzá a csatáiban.
pl: Meneldurze! Przynoszę wiadomość od Króla! Jeśli teraz się poddasz, ocalisz swoje życie. Król jest skłonny pomóc Ci w twojej misji ocalenia Elensefaru. Ale musisz znowu zaprzysiądz wierność tronowi i zgodzić się na udzielenie Ci pomocy w tej bitwie.
sv: Meneldur! Jag har ett bud med mig från kungen! Om du överlämnar dig nu så kommer ditt liv att skonas. Kungen är till och med villig att hjälpa dig att återta Elensefar. Men du måste svära trohet till kronan igen och gå med på att hjälpa till i dess strider.

source: Hah! And what will you do with me and my kind, who have joined with Meneldur and are bound to him? Doubtlessly you would kill us.
ca: Hah! I què fareu amb mi i la meua gent que ens hem unit a Meneldur i estem lligats a ell? Sense cap dubte, ens matareu a tots.
cs: Hleďme! A co uděláš se mnou a mými druhy, kteří se připojili k Meneldurovi pod jednu vlajku? Nepochybně byste nás zabili.
hu: Hah! S mit csináltok velem és a csapatommal, akik csatlakoztunk Meneldurhoz? Nyilván lemészároltok.
pl: Hah! A co zrobisz ze mną i z moimi wojownikami, którzy dołączyli do Meneldura w czasie tej podróży? Z pewnością nas zabijesz!
sv: Ha! Och vad kommer ni att göra med mig och mitt släkte, vi som är svurna till Meneldur? Ni kommer utan tvivel att döda oss.

source: He is right. We can defeat these forces, and rid this area of their lordship.
ca: Té raó. Podem derrotar aquestes forces i alliberar aquesta àrea del seu domini.
cs: Má pravdu. Můžem tyhle síly porazit a zbavit tuhle oblast jejich panství.
hu: Igaza van. Legyőzhetjük ezt a sereget, s a vezetőjüket is megkereshetjük.
pl: On ma rację. Możemy pokonać tą armię i wybawić te tereny spod ich panowania.
sv: Han har rätt. Vi kan besegra de här trupperna och frigöra området från deras kontroll.

source: Your ship has been captured by others of us. You do not know what awaits you further up the isle... I tell you, if you refuse this you are a dead man, whether I die or not.
ca: Altres forces nostres han capturat el vostre vaixell i no teniu cap idea del que vos aguaita en la resta de l'illa... Puc assegurar-te que si rebutges aquesta proposta, eres home mort, tant si jo mor com no.
cs: Tvou loď zajali další z nás. Nevíš, co tě čeká dále na ostrově... Říkám ti, pokud odmítneš, jsi mrtvý muž, ať už zemřu nebo ne.
hu: A hajódat elfoglaltuk. Ne akarj a sziget fölső részére menni, nem tudhatod, mi vár rád... Azt mondom, hogy ha visszautasítod az ajánlatomat, halott vagy, akár meghalok, akár nem.
pl: Twój statek nie został opanowany przez nas. Nie wiesz co czeka Cię na tej wyspie... Powiem Ci tylko że jeśli odmówisz będziesz martwy, nieważne czy zginę czy przeżyję.
sv: Ert skepp har blivit kapat. Du har ingen aning vad som väntar på dig längre in på ön... Hör mina ord, om du vägrar så är du en död man, oberoende om jag lever eller inte.

source: Your threats do not scare me. Prepare for battle, men!
ca: Les teues amenaces no m'espanten. Prepareu-vos per a la batalla, companyers!
cs: Vaše hrozby mě neděsí. Připravte se na bitvu, muži!
hu: A fenyegetőzésed nem ijeszt meg. Fegyverbe!
pl: Nie przestraszą mnie twoje groźby. Przygotujcie się do bitwy!
sv: Dina hot skrämmer mig inte! Förbered för strid, mannar!

source: Very well, you have chosen. Handran, send a scout to the leader and tell her Meneldur has refused our offer. She will be most displeased.
ca: Molt bé, tu ho has volgut. Handran, envia un explorador al líder i dis-li que Meneldur ha rebutjat la nostra oferta. Ella estarà molt poc satisfeta.
cs: Dobře, vybral sis. Handrane, pošli k vůdkyni průzkumníka, ať jí vzkáže, že Meneldur odmítl naši nabídku. Nebude se jí to líbit.
hu: Remek, döntöttél. Handran, küldj egy hírnököt a vezetőhöz, s tájékoztasd, hogy Meneldur visszautasította az ajánlatunkat. Nem fog örülni neki.
pl: Dobrze, miałeś wybór. Handranie, wyślij zwiadowcę do przywódczyni i powiedz jej że Meneldur odrzucił naszą propozycję. Z pewnością będzie poirytowana.
sv: Nåväl, du har gjort ditt val. Handran, skicka bud till ledaren att Meneldur har avfärdat vårt förslag. Hon kommer att bli mycket missnöjd.

source: I wonder what that was all about...
ca: Em pregunte què ha sigut tot això...
cs: Zajímalo by mě, o co tu šlo...
hu: Hát ez meg mi volt...
pl: Chciałbym wiedzieć o co w tym wszyskim chodzi...
sv: Jag undrar vad det där handlade om...

source: Conscript
cs: Branec
hu: Újonc

source: Meneldur! It seems that our commanders and our best fighters have been killed. If you leave us now, we will probably die, since only they knew how to command our ship. Have mercy, and help us!
ca: Meneldur! Pareix que els nostres comandants i millors lluitadors han mort. Si ens abandones, segurament morirem, ja que ells eren qui sabien comandar la nau. Tin pietat, i ajuda'ns!
cs: Meneldure! Vypadá to, že naši velitelé a nejlepší bojovníci jsou mrtví. Pokud nás tu necháš, pravděpodobně zemřeme. Jen oni uměli řídit naši loď. Smiluj se a pomoz nám!
hu: Meneldur! A parancsnokaink, s a legjobb harcosaink meghaltak. Ha most itt hagysz, akkor talán meg is halunk, mivel csak ők tudták a hajót irányítani. Könyörüljetek rajtunk!
pl: Meneldurze! Nasi dowodcy i najlepsi wojownicy zostali zabici... Jeśli nas opuścisz, najpewniej zginiemy, tylko oni wiedzieli jak sterować naszym statkiem... Miej litość i pomóż nam!
sv: Meneldur! Det verkar som att våra kommendörer och bästa soldater har blivit dödade. Om du lämnar oss nu så kommer vi med största sannolikhet att gå under. De var de enda som visste hur man styrde vårt skepp. Snälla, hjälp oss!

source: What would you have me do? Give you navigators to help you? Why would I do that for an enemy?
ca: Què voleu que faja per vosaltres? Donar-vos mariners per ajudar-vos? Per què hauria de fer això per un enemic?
cs: Co bych pro vás měl udělat? Poskytnout vám navigátory? Proč bych to měl pro nepřátele dělat?
hu: Mit vártok tőlem? Adjak mellétek kormányost? Miért tenném meg az ellenségeimmel?
pl: Co mam dla was zrobić? Dać wam moich nawigatorów aby wam pomogli?! Dlaczego mialbym to zrobić, jesteście naszymi wrogami!
sv: Vad vill du att jag skall göra? Ge dig navigatörer att hjälpa till? Varför skulle jag hjälpa en fiende med det?

source: Well, why don't you let us join you? There is nothing else for us to do.
ca: Bé, per què no ens deixes unir-nos a tu? No hi ha cap altra cosa que puguem fer.
cs: No a proč nás nenecháš se k tobě přidat? Nemáme žádnou jinou možnost.
hu: Nos, miért ne csatlakozhatnánk hozzád? Mást nem tehetünk.
pl: Meneldurze, dlaczego nie pozwolisz nam żebyśmy do Ciebie dołączyli? I tak nie czeka nas tutaj nic innego oprócz śmierci.
sv: Nå, varför låter du inte oss förena oss med er? Vi kan inte göra så mycket annat.

source: Wouldn't that make you a traitor?
ca: No vos convertiria això en traïdors?
cs: Nestanou se z vás tím zrádci?
hu: S nem fognak titeket árulónak tartani?
pl: Nie staniecie się przez to zdrajcami, hę?
sv: Skulle inte det göra dig till en förrädare?

source: No, since I don't think you are traitors, and my commander is dead. It is just joining another battalion.
ca: No, perquè no crec que sigueu traïdors, i el meu comandant és mort. No és altra cosa que unir-me a un nou batalló.
cs: Ne, protože já si nemyslím, žes zrádce a můj velitel je mrtev. Pouze se připojíme jakoby k jiné jednotce.
hu: Nem, mivel nem hiszem, hogy te áruló lennél, a parancsnokunk meg halott. Mindössze csatlakozunk egy másik hadsereghez.
pl: Nie, nie wierzę w to że jesteś zdrajcą a moi dowódcy już nie żyją. To jak dołączenie nowgo batalionu do twojej armii.
sv: Nej, för jag tror inte att ni är förrädare, och min befälhavare är död! Vi bara förenar oss med en annan bataljon.

source: Well, if he puts it that way, why should we refuse? We can always use fresh recruits.
ca: Bé, ben mirat, per què hauríem de negar-ho? Sempre podem usar nous reclutes.
cs: No jestli to předkládá takhle, můžem odmítnout? Čerství rekruti jsou pro nás vždy užiteční.
hu: Nos, ha így gondolja, miért utasítanánk el? Mindig hasznát vehetjük az újoncoknak.
pl: Dobrze, jeśli on tak to przedstawia, to dlaczego mielibyśmy mu odmówić? Zawsze będziemy potrzebować wypoczętych wojowników.
sv: Nå, om det är på det viset så ser jag inte varför vi skulle vägra. Vi behöver alltid nya rekryter.

source: Very well... now, we will move further down the peninsula to regain our ship.
ca: Molt bé... ara, seguirem el nostre camí per la península per recuperar la nostra nau.
cs: Velmi dobře... teď se přesuneme dál do nitra poloostrova, abychom znovu získali svou loď.
hu: Rendben van... akkor gyerünk tovább, vissza kell szerezzük a hajónkat.
pl: Bardzo dobrze... teraz przesuniemy się dalej w głąb półwyspu, musimy w końcu odebrać nasz statek.
sv: Då säger vi det... Nu tar vi oss ner längs halvön och återtar vårt skepp.

source: Please have mercy, what had I done?
hu: Kegyelmezzetek, mit tettem?

source: Ahhrg, I surrender
hu: Áááhhh, megadom magam
