Repository: moonymeric/Saving_Elensefar
Catalog: translations/*/*.po
Languages: ca, cs, hu, pl, sv

source: I see signs of a Wesnothian outpost. Odd they would come so far south...
ca: Veig senyals d'un campament fronterer wesnothià. Em pareix estrany que estiga tan al sud...
cs: Vidím stopy po wesnothské základně. Je udivující, jak se mohli dostat tak daleko na jih...
hu: Egy wesnothi helyőrség nyomait vélem felfedezni. Szokatlan, hogy ennyire délre lehajóztak...
pl: Widzę ślady obozu Wesnothańczyków.
sv: Jag ser tecken på en wesnothisk utpost. Underligt att de finns så här långt söderut...

source: I think something is in the water...
ca: Crec que hi ha alguna cosa dins de l'aigua...
cs: Myslím, že ve vodě něco je...
hu: Mintha valami lenne a vízben...
pl: Chyba zobaczyłem coś w wodzie...
sv: Jag tror att det är något i vattnet...

source: This island looks vaguely elvish.
ca: Aquesta illa pareix vagament elfa.
cs: Tento ostrov má trochu elfí charakter.
hu: Mintha egy tünde sziget lenne.
pl: Ta wyspa jest chyba zamieszkana przez elfów.
sv: Den här ön för tankarna till alver.

source: Nagas were about a hundred years ago, in Haldric's time! I wonder if any remain...
ca: Els nagues són criatures de fa cent anys, en temps de Haldric! Em pregunte si quedara cap...
cs: Nágy existovaly v Haldrikových časech, víc než před sto lety! Divil bych se, kdyby nějaké žily doteď...
hu: A nagák évszázadokkal korábban, csak Haldric idejében fordultak elő. Meglepne, ha eggyel is találkoznánk...
pl: Nagi żyły tutaj kilka wieków temu w czasach Haldrica. Mam nadzieję że już ich tu nie ma...
sv: Nagafolket bodde här för hundra år sedan, på Haldrics tid! Undrar om det finns några kvar...

source: Does anything live in this frozen wasteland?
ca: Que bé podrà viure alguna cosa en aquest gelat territori?
cs: Žije v těchto zmrzlých krajích něco?
hu: Képes bárki is megélni egy fagyott területen?
pl: Czy ktokolwiek żyje w tych zamarzniętych krainach?
sv: Lever det något i den här frusna ödemarken?

source: This is old Clearwater Port! It was sacked by orcs long ago, I doubt there are any humans left.
ca: Aquest és l'antic Port d'Aiguaclara! Fa molt de temps que va ser saquejat pels orcs, dubte que hi quede cap humà.
cs: To je bývalý přistav Jasná Voda! Je to dávno, co byl vyrabován skřety a pochybuji, že tu zůstali nějací lidé.
hu: Ez az ősi Kristályvízkikötő! Nagyon régen lerombolták az orkok, kétlem, hogy maradt volna itt bárki emberfia.
pl: To stary Port Clearwater! Został zdobyty przez orków dawno temu, wątpię w to że żyją tu jacyś ludzie.
sv: Det här är Klarvattnet! Den gamla hamnstaden! Den blev raserad av orcher för länge sedan; jag tvivlar på att det finns några människor kvar.

source: The Great Academy of Alduin is settled on this isle! Let us hold here for a day or two.
hu: Alduin Nagy Akadémiája települt ezen a szigeten! Maradjunk itt pár napot!

source: This is just an abandoned smugglers hole.
hu: Ez csak egy elhagyott csempészbarlang.

source: Carefull with those riffs, or we will shipwreck
hu: Ügyeljetek azokra a szirtekre, vagy zátonyra futunk.

source: Legend says Haldric landed here on his journey over, and that he fought something. Lets hope we don't have to fight whatever it was...
ca: La llegenda diu que Haldric va desembarcar ací, i que va lluitar amb alguna cosa. Esperem que no siga necessari tornar-ho a fer...
cs: Legendy vypráví, že tu během svého putování přistál Haldrik a něco našel. Doufejme, že s tím nebudeme muset bojovat, ať už to bylo cokoli...
hu: A legendák szerint Haldric is partra szállt itt utazása során, s harcra is kényszerült. Remélem, nekünk semmivel nem kell megküzdenünk...
pl: Legeny mówią że Haldric dopłynął do tego miejsca i znalazł coś dziwnego. Miejmy nadzieję że nie bedziemy musieli z tym walczyć...
sv: Legenderna berättar att Haldric landsteg här på sin färd och att han slogs med något. Låt oss hoppas att vi inte blir tvungna att återuppta striden med vad det än var...

source: There is a great tower on the isle. Which kind of mage live here?
hu: Egy hatalmas torony van ezen a szigeten. Miféle mágus élhet itt?

source: This is the land I was talking about. Land here, and we will get the warriors we need.
ca: (Negre el Roig) Aquesta és la terra de la que vos parlava. Desembarquem, i trobarem els guerrers que ens fan falta.
cs: To je země, o které jsem mluvil. Tady přistaneme a získáme válečníky, které potřebujeme.
hu: Erről a földről beszéltem. Szálljunk partra, és itt találjuk a nekünk kellő harcosokat!
pl: (Czerwony Black) To kraina o której mówiłem. Dobij do brzegu a znajdziesz pomoc której szukałeś.
sv: (Black Röde) Det här är landet jag talade om. Landstig här så kommer vi att få tag i de krigare vi behöver.

source: This island has no more enemies on it, but we can still reprovision here. That will still take time, though.
ca: No hi ha més enemics dins d'aquesta illa, però podem aprovisionar-nos ací. Malauradament ens costarà prou temps.
cs: Na tomto ostrově nejsou žádní nepřátelé, ale i tak tu můžem doplnit zásoby. Nicméně to bude chvíli trvat.
hu: Ezen a szigeten már nincs több ellenség, de a készleteinket feltölthetjük. Igaz ez egy kis ideig eltart.
pl: Nie znajdziemy na tej wyspie więcej wrogów, ale jeszcze nie uzupełniliśmy zapasów do końca. To zajmie troszkę czasu.
sv: Det finns inga fler fiender på den här ön, men vi kan fortfarande proviantera här. Det kommer att ta tid, dock.

source: We have unfinished business to attend to.
hu: Még van egy kis elszámolnivalónk.

source: We have left Elensefar in the hands of the orcs. If we do not return soon, it will be of no use to return at all. We have at most 30 weeks to get to the western lands, where we will meet with the people Black the Red has spoken of. That will leave us with 5 weeks to get back.
ca: Hem deixat Elensefar en mans dels orcs. Si no tornem prompte, no tindrà cap valor tornar de nou. Tenim, com a molt, 30 setmanes per arribar a les terres de l'oest, on trobarem la gent de la que ens ha parlat Negre el Roig. Això ens deixarà només amb unes 5 setmanes per tornar.
cs: Zanechali jsme Elensefar v rukou skřetů. Pokud se brzy nevrátíme, nebude se vůbec kam vracet. Máme nanejvíš 30 týdnů na to, dosáhnout západních zemí, kde najdeme lidi, o kterých Černý Red vyprávěl. To nám nechá 5 týdnů na návrat.
hu: Elmenekültünk az orkok kezébe került Elensefarból. Ha hamarosan nem térünk vissza, nem lesz értelme, hogy visszajöjjünk. Legfeljebb 30 hét áll a rendelkezésünkre, hogy elérjük a nyugati szigetet, ahol azokkal találkozhatunk, akikről Véreskezű Kalóz beszélt. S újabb öt hét a visszatérésre.
pl: Opuściliśmy Elensefar. Jeśli szybko nie wrócimy, nie bedzie nam do czego powracać. Mamy 30 tygodni aby dostać się do zachodnich krain, gdzie spotkamy ludzi o których mówił nam Czerwony Black.
sv: Vi har lämnat Elensefar i orchernas klor. Om vi inte återkommer snart, så finns det ingen mening att återkomma alls. Vi har 30 veckor på oss, på sin höjd, att komma fram till länderna i väster, där vi skall möta de som Black den Röde pratade om. Det ger oss 5 veckor att komma tillbaka på.

source: Also, our ship cannot hold provisions for more than 6 weeks at a time, so we must either land on an island or capture an enemy ship ever 6 weeks.
hu: Egyszerre 6 hétre elegendő készlet fér a hajónkra, utána vagy egy szigeten kell feltöltenünk a készleteinket, vagy egy ellenséges hajó készletéből.
pl: Musimy uważać, nasz statek nie może przebywać na morzu bez uzupełnienia zapasów dłużej niż 6 tygodni. Musimy co pewien czas lądować na wyspach lub przejmować wrogie okręty.

source: We have ran out of provisions.... *urgh*
ca: Se'ns han acabat els queviures...*urgh*
cs: Došly nám zásoby... *urgh*
hu: Kifogytunk a készletekből... *áááhhh*
pl: Nasze zapasy się skończyły... *urgh*
sv: Vi har slut på mat och vatten... *urgh*

source: Hurry, we are down to our last provisions! If we don't refill them within a week, we will all starve!
ca: Ràpid, no ens queden moltes provisions! Si no aconseguim aprovisionar-nos en una setmana, ens morirem de fam!
cs: Pospěšme, máme poslední proviant! Pokud ho do týdne nedoplníme, všichni vyhladovíme!
hu: Igyekezzünk, a készleteink nagyon leapadtak! Ha egy héten belül nem töltjük fel újra, éhen halunk!
pl: Szybko, pozostała nam garstka zapasów! Jeśli nie uzupełnimy ich w tym tygodniu, jesteśmy straceni!
sv: Våra förråd är snart slut! Om vi inte provianterar inom en vecka så kommer vi att svälta!

source: We only have enough provisions for $turnsleft weeks; we must reach the Western Lands in $gameleft weeks.
ca: Tenim provisions per a $turnsleft weeks; hem d'arribar a les terres de l'oest en $gameleft weeks.
cs: Máme dostatek zásob na $turnleft týdny. Do západních zemí se musíme dostat do $gameleft týdnů.
hu: Készleteink $turnsleft hétre elegendőek; a nyugati szigetet $gameleft héten belül kell elérnünk.
pl: Nasze zapasy wystarczą tylko na $turnsleft tygodni żeglugi; musimy dopłynąć do zachodnich krain w $gameleft tygodni.
sv: Våra förråd räcker bara i $turnsleft veckor. Vi måste nå länderna i väster inom $gameleft veckor.

source: We have failed reaching the Westlands in time.
hu: Nem értük el időben a nyugati szigetet.

source: Black Galleon
hu: Fekete gálya

source: The Explorer is the craft of Meneldur the Mariner. Crafted with Elvish skill, it moves faster in the water than most vessels, but is structurally weaker, and will be sunk easier than a man-made ship.
hu: Az Explorert Meneldur, a tengerész építette. Tünde precizitással építette, gyorsabban mozog, mint más hajók, de szerkezetileg gyengébb azoknál, s könnyebben el is süllyed, mint az emberalkotta masszív gályák.

source: ballista
hu: ballistás

source: Brute
hu: Tróger

source: Brutes are lower-class city dwellers. Though sturdier than most other peasants, they are still good for little else than back-breaking physical labor.
hu: A trógerek a városlakók alsó rétegéből kerülnek ki. Habár robusztusabbak, mint a parasztok, igazából csak nehéz fizikai munkára alakalmasak.

source: fist
hu: ököl

source: Civilian
hu: Polgár

source: Civilians are the city-dwellers who try to make their fortune in a non-violent manner.
hu: A polgárok a városlakóknak azt a részét képezik, akik boldogulásukat könnyebb munkákkal keresik.

source: dagger
hu: tőr

source: Elvish Admiral
hu: Tünde admirális

source: In command of the whole Elensian fleet, the Elvish Admiral follows the orders of the Lord of Elensefar - when it suits him to do so. He has left elvish land to join Elensefar, and for this is considered a traitor.
hu: Az elenszi flottát irányító tünde admirális Elensefar urának parancsait követi - ha ő is úgy gondolja. Elhagyta a tündék földjét, s Elensefarba jött, amiért szülőföldjén árulónak bélyegezték.

source: staff
hu: bot

source: bolas
hu: bola

source: Elvish Mariner
hu: Tünde tengerész

source: Separated from Elvish society because of his love of the sea, the Elvish Mariner has obtained command of a ship and often sails the seas in search of adventure.
hu: A tünde társadalomból tengerszeretete miatt kivált a tünde tengerész, épített egy hajót, legénységet verbuvált, s kalandot keresve járja a tengereket.

source: Elvish Navigator
hu: Tünde hajóskapitány

source: The Elvish Navigator has removed himself from other Elves, except those loyal to him more than to the Council, in order to become a captain of a ship and go wherever he pleases. He does not follow orders he disagrees with.
hu: A tünde hajóskapitány elkülönült a többi tündétől, kivéve azokat, akik hozzá hűek, s nem a Tanácshoz. Saját hajójának kapitányaként a saját útját járja. A neki nem tetsző parancsokat elereszti a füle mellett.

source: Initiate
hu: Tanonc

source: Initiates are skilled enough to cast offensively but lack the time, effort and study to cast as true magi can.
hu: A tanoncok ahhoz már elég képzettek, hogy támadólag lépjenek fel, de idő, kitartás, és tudás hiányában az igazi mágusoknál gyengébbek.

source: missile
hu: lövedék

source: female^Initiate
hu: Tanonc

source: Nobleman
hu: Nemes

source: Leading relative lives of luxury, a nobleman's main concern is proper etiquette and good social graces.
hu: Fényűző életmódjából következően a nemesek legfőbb gondja az etikett és a társadalmi életben való részvétel.

source: Sailor
hu: Hajós

source: Sailors, who began traversing the ocean when they were young, are almost as much at home in water as on land. In order to make all of the swift movements required of a crewman, Sailors do not wear any armor. It would only weigh them down, and would probably cause them to drown in they fell in the deep. Their only weapon is their light rapier, which they sling across their shoulder when not using it.
hu: A hajósok, akik igen fiatalon kezdték átszelni az óceánt, majdnem annyi időt töltenek vízen, mint a szárazföldön. A hajón történő könnyű mozgás érdekében nem viselnek páncélt. Csak akadályozná őket a mozgásban, s a magasból könnyen aláhullanának a súly miatt. Egyetlen fegyverük a hosszú tőr, amelyet a hátukra csapnak, ha nem használják.

source: Shipsmaster
hu: Fedélzetmester

source: The master of whatever ship they are aboard, the Shipsmaster answers only to the captain of the vessel. He does not do the manual labor that most crewmen do, leaving that to those working beneath him, but still refuses to wear armor or wield heavy weapons, as doing so would be only an invitation for the sea to drown him. His weapon is his rapier, which he wields with ferocious skill.
hu: A fedélzetmesterek minden hajótípusban otthon vannak, s csak a kapitány parancsol nekik. A legénységgel ellentétben nem végeznek fizikai munkát, azt a matrózok csinálják, de így sem hordanak semmiféle vértet vagy nehéz fegyverzetet, ami csak a tenger dolgát könnyítené meg, hogy elnyelje őket. Fegyverük a hosszú tőr, amit boszorkányos ügyességgel kezelnek.

source: War Galleon
hu: Hadigálya

source: The Royal Navy of Wesnoth owns a powerful fleet of deadly war galleons. Their task is to hunt down pirates - or whoever they choose to call pirates - and destroy them.
hu: Wesnoth Királyi Haditengerészete halálos hadigályákból áll. Feladatuk a part menti kalózok elleni hadakozás - vagy azok ellen, akiket kalóznak neveznek ki.

source: distract
hu: zavarás

source: inspire
hu: ösztönzés

source: Do you really want to run away?
hu: Tényleg el akarsz futni?

source: Yes
hu: Igen

source: Fall back!
hu: Visszavonulás!

source: No
hu: Nem

source: Fight on!
hu: Harcra fel!

source: Remember we can retreat at any time, just move your leader to the ship.
hu: Ne felejtsd el, hogy bármikor visszavonulhatsz, csak vidd a vezéredet a hajóra!

source: But then we haven't time to refill our ship...
hu: De akkor a készleteinket nem tudjuk feltölteni...

source: I hope it would never be needed.
hu: Reméltem, hogy erre sose lesz szükség.

source: To die on the cusp of victory. Oh, the irony!
hu: A Sors fintora. A győzelem küszöbén meghalni...

source: I go now to join my forefathers...
hu: Csatlakozom az őseimhez...

source: Continue... the battle... for me...
ca: Continueu.... la batalla.... per mi...
cs: Pokračujte... v boji... za mě...
hu: Folytassátok... a csatát... értem is...
sv: Fortsätt...striden...åt mig....

source: I see the light...
hu: Látom a fényt...

source: This can’t be the end, I have too much left to see.
hu: Ez nem lehet a vég. Oly sok mindent kellett volna még látnom.

source: Grog Barrel
hu: Grogos hordó

source: Ship Dock
hu: Hajódokk

source: We have defeated all enemies, we have plenty of time to restock the ship now. We can train our troops here for a few days.
ca: Tenim temps de sobra per reomplir els queviures de la nostra nau. Podem entrenar les nostres tropes ací durant uns quants dies.
cs: Porazili jsme všechny nepřátele, máme teď fůru času k doplnění lodních zásob. A můžem tu pár dní trénovat vojáky.
pl: Mamy wystarczająco dużo czasu na uzupełnienie zapasów. Możemy szkolić tutaj przez kilka dni nowych żołnierzy.
sv: Vi har gott om tid att fylla våra förråd nu. Vi kan exercera våra trupper i några dagar.

source: They had 100 gold stored in their ship, and enough provisions to restock our ship.
ca: Tenien 100 peces d'or dins del seu vaixell, i prou queviures per aprovisionar el nostre vaixell.
cs: Měli na své lodi 100 zlatých a dostatek proviantu, abysme doplnili naše zásoby.
sv: De hade 100 guldstycken i skeppslasten, och tillräckligt med mat för att fylla våra förråd.

source: They come from the... less wealthy parts of Elensefar. But they are still fiercely loyal to it. They will be good fighters. I will join, if you'll have me.
ca: Ells venen de... d'els districtes menys rics d'Elensefar. Però són d'una lleialtat inqüestionable. Seran uns bons lluitadors. M'uniré a tu, si em deixes.
cs: Pochází z... ehm <i>méně bohatých vrstev</i> Elensefaru. Ale jsou stále mu stále zuřivě oddáni. Budou dobře bojovat. Připojím se k tobě, pokud o to budeš stát.
sv: De kommer från de.. mindre bemedlade delarna av Elensefar. Men de är fortfarande mycket lojala. De kommer att vara bra soldater. Jag ansluter mig till er, om ni accepterar.

source: So that means you have heard of our suppposed rebellion. Let us not waste time; shall we commence battle?
ca: Això vol dir que has sentit parlar de la nostra suposada rebel·lió. No cal perdre més temps, podem començar la batalla?
cs: To znamená, že jsi slyšel o naší údajné vzpouře. Neztrácejme čas, zahájíme bitvu?
pl: To znaczy że i Ty słyszałeś o naszej rzekomej zdradzie. Nie marnujmy czasu, zaczynajmy!
sv: Så det betyder att du har hört om vårt påstådda uppror. Låt oss inte ödsla tid, utan börja striden direkt.

source: Bakrakha
cs: Bakrakra

source: Asknak
cs: Ašknak

source: Defeat Bakrakha, the Southern Warlord, and then survive until end of turns
ca: Derrota Bakraha, senyor de la guerra orc, i sobreviu fins a la fi dels torns.
cs: Poraz Bakrakru, jižního válečného vůdce, a pak přežij do konce kol
pl: Pokonaj Bakrakhe, władcę orków i przeżyj do końca tur.
sv: Besegra Bakrakha, orchernas krigsherre, och håll ut tills dragen tar slut

source: So, little maggots, you got so low as to call down some islefolk from the north to help with your trying to take over the castle!?! Not going to happen on my watch!
ca: Bé, miserables orcs-porcs, haveu caigut tant baix com per cridar wesfolk des del nord per ajudar-vos a capturar el castell?!?!? Abans moriré!
cs: Takže vy, malí červi, jste se snížili k tomu, že jste si přivolali nějakýho ostrovana ze severu, aby vám pomohl zkusit ovládnout hrad!?! To se nestane, dokud tu na to dohlížim!
pl: A więc młode orczki, ściągneliście Lud Wesfolk z północy aby pomógł wam przejąć mój zamek?!? Nie bójcie się, nic takiego się nie stanie do czasu aż ja tu rządzę!
sv: Så, era små orchmaskar, ni föll så lågt att ni försökte locka ner lite wesfolk från norr att hjälpa er att ta slottet?! Inte på min vakt, minsann!

source: We didn't call no human scum out of the north, though we could use their help! You been chieftain far too long, Bakrakra! You aint got us meat, and you aint got us land. Me, Asknak here, or even a lich 'ud be better than you!
ca: No hem cridat cap escòria humana des del nord, encara que sí podríem usar la seua ajuda! Ja duus massa temps de rei, Bakrakra! No ens dones carn i tampoc ens has donat terres. Jo mateix, Asknak, o fins i tot un lich seria millor que tu!
cs: Ze severu jsme si nepřivolávali žádnou lidskou spodinu, i když by nám byla k užitku! Jsi už příliš dlouho náčelníkem, Bakrakro! Syslíš si maso i půdu. Já, Ašknak, nebo dokonce i ten lich tady jsme schopný tomu velet líp než ty!
pl: Nie wzywaliśmy tych ludzkich ściew z północy, ale zawsze możemy skorzystać z ich dobrej rady! Byłeś za długo królem, Bakrakrze! Nie dajesz nam mięsa, nie chcesz się dzielić zdobyczami! Ja, Asknak a nawet pierwszy lepszy licz byłby lepszym władcą od Ciebie!
sv: Vi hämtade inte alls något människoavskum från norr, även om vi hade kunnat behöva deras hjälp! Du har varit kung alldeles för länge, Bakrakra! Du har inte skaffat kött åt oss och inte heller land. Jag, Asknak här, eller till och med en häxmästare skulle vara bättre än du!

source: I don't think we should get involved here. These clans can fight each other, and they won't care if we wait here and restock.
ca: Crec que no deuríem clavar-nos ací al mig. Els orcs estaran pegant-se entre ells, i no crec que els importe massa si parem ací i ens aprovisionem.
cs: Nemyslím si, že bychom se do toho měli plést. Tyhle klany budou spolu bojovat a nebudou se starat, jestli tu chvlíli budeme a doplníme zásoby.
pl: Myślę że nie powinniśmy mieszać się do tego sporu. Ci orkowie w każdej chwili mogą zacząć walkę między sobą, a na pewno się nami zainteresują jeśli będziemy tu dłużej przebywać i uzupełniać nasze zapasy.
sv: Jag tror inte att vi borde lägga oss i den här striden. Om vi låter orcherna slåss med varandra, så stör de oss inte när vi ligger här och provianterar.

source: I don't think it's that simple. That guy in the castle has all the food, we can't restock from here.
ca: No crec que siga tan senzill. Aquell orc té tot el menjar dins d'aquell castell, no podem aprovisionar-nos des d'ací.
cs: Nemyslím si, že je to tak jednoduchý. Tady nemůžem doplnit zásoby, protože všechno jídlo má ten maník na hradě.
pl: Nie wydaje mi się żeby to było takie proste. Ci orkowie w zamku maja całą żywność, nie uzupełnimy naszych zapasów będąc tylko tutaj.
sv: Jag tror inte att det är riktigt så enkelt. Orchen i slottet har all mat, vi kan inte proviantera här.

source: Well, we will definitely have to kill the chieftain in the castle, to get the food. But to get to him, we should probably go around the river, which leads us past all the other clansmen. We might have to kill them all.
ca: Bé, està clar que haurem de matar aquell orc dins del castell per aconseguir el menjar. Però per arribar a ell, segurament caldrà que rodegem el riu, que ens durà pel mig de tots els orcs. Potser els tinguem que matar tots.
cs: Abychom získali jídlo, budem muset určitě zabít toho náčelníka na hradě. Ale jestli se chcem k němu dostat, měli bychom nejspíš obejít řeku, což nás přivede ke všem ostatním členům klanů. Možná je budem muset všechny zabít.
pl: Hmm, z całą pewnością musimy pokonać orków w zamku aby zdobyć żywność. Ale żeby się do niego dostać powinniśmy obejść dookoła rzekę, przy której znajdują się inne posterunki orków. Prawdopodobnie będziemy musieli zabić ich wszystkich.
sv: Tja, vi måste döda orchen i slottet, för att få tag på maten. Men för att komma åt honom så borde vi gå runt floden, vilket leder oss förbi de andra orcherna. Vi måste kanske döda dem allihop.

source: We have defeated all of the clansmen; refill the ship, and we'll leave.
ca: Hem derrotat tots els orcs, aprovisioneu el vaixell i marxarem.
cs: Porazili jsme všechny klanové bojovníky. Doplňte zásoby a odrazíme.
pl: Pokonaliśmy wszystkich orków; czas załadować statek i ruszyć w drogę.
sv: Vi har besegrat orcherna. Lasta skeppet, så åker vi.

source: We did not manage to kill the enemy leader, and now we are out of food...
ca: No hem pogut matar el líder orc, i ara estem sense menjar...
cs: Nepovedlo se nám zabít nepřátelského vůdce a teď jsme bez jídla...
pl: Nie zdołaliśmy pokonać władcę orków, nie mamy więcej żywności...
sv: Vi lyckades inte döda orchledaren och nu har vi slut på mat...

source: So, you getting involved too, eh? Stop that ship, men!
ca: Hum, així que tu també vols gresca? Atureu eixa nau, soldats!
cs: Hm, takže vy se chcete taky připojit? Zastavte tu loď!
pl: Masz tutaj jakiś interes? Zatrzymać ten statek!
sv: Så du blandar dig i leken, du också, va? Stoppa det där skeppet, mannar!
