Repository: moonymeric/Saving_Elensefar
Catalog: translations/*/*.po
Languages: ca, cs, hu, pl, sv

source: The Wesnothian ships are chasing you; if they attack you they will attempt to board the ship.
ca: Els vaixells wesnothians et persegueixen; si t'ataquen, intentaran abordar-te.
cs: Lodě Wesnothu vás pronásledují. Pokud na vás zaútočí, pokusí se dobýt loď.
pl: Okręty Wesnothańczyków polują na Ciebie, jeśli Cię zaatakują, zmuszą Ciebie i twoją załogę do opuszczenia statku.
sv: Wesnoths skepp jagar dig; om de anfaller kommer de att försöka borda skeppet.

source: Also, our ship cannot hold provisions for more than 6 weeks at a time, so we must either land on an island or capture an enemy ship every 6 weeks.
ca: A més a més, el nostre vaixell no pot dur provisions per més de 6 setmanes alhora, per tant, haurem de desembarcar en una illa o capturar un vaixell enemic cada 6 setmanes.
cs: A také naše lodní zásoby nevydrží déle než 6 týdnů. Takže musíme každých 6 týdnů buď přistát na ostrově, nebo zajmout nepřátelskou loď.
sv: Dessutom rymmer inte vårt skepp proviant för mer än 6 veckor i taget, så vi måste antingen gå i land på en ö eller borda ett fiendeskepp var sjätte vecka för att proviantera.

source: Ha! See, I can resurrect the dead! Now fear me!
ca: Ha! Veieu? Puc ressuscitar morts! Temeu-me!
cs: Ha! Vidíte, umím probouzet mrtvé. Bojte se mě!
sv: Ha! Se, jag kan väcka de döda! Frukta mig nu!

source: Amazing... so the stories are true!
ca: Increïble... les històries són reals!
cs: Úžasné ... takže příběhy nelhaly!
sv: Fantastiskt... Så legenderna är sanna!

source: Warning: This campaign functions differently from most others in a number of ways. You cannot recruit anyone in most scenarios, and in those you can what you can recruit is always different - what is on your recruit list does not carry over fron scenario to scenario. Also, moving from scenario to scenario is handled differently, with the help of an interactive bigmap.
cs: Upozornění: Toto tažení používá často jiné mechanismy než je u většiny tažení obvyklé. Ve většině scénářů nelze verbovat nové jednotky a i v těch, kde je verbování možné, se aktuální možný výběr mění. Prostě seznam pro verbování se nepřenáší ze scénáře do scénáře. Také pohyb mezi jednotlivými scénáři funguje odlišně, pomocí velké interaktivní mapy.

source: Because of this, this campaign is inadvisable for players new to Wesnoth who want to gain an understanding of how the game normally works. However, it will prove an interesting experience for those who have played normal campaigns before.
cs: Vzhledem k těmto skutečnostem, nelze toto tažení doporučit nováčkům ve hraní Wesnothu, kteří ještě nemají zažito, jak hra normálně funguje. Pro ty, kteří již nějaká běžná tažení hráli, však může být zajímavou zkušeností.

source: Meneldur gathered around himself a crew of true Elensians; stout spearmen, and ruthless men of the saber. He also brought many of the archers from his elvish house out of the northlands, to sail with him on his ship.
ca: Meneldur va reunir al voltant seu una tripulació de veritables elensians; resistents soldats i cruels avalotadors. També havia convençut molts arquers de sa casa a les terres elfes, que li acompanyaren als seus viatges.
cs: Meneldur kolem sebe shromáždil posádku pravých elensianů - odvážné kopiníky i drsné muže šavle. Také si s sebou ze svého elfího domova na severu přivedl mnoho lučištníků. Ti všichni se s ním plavili na jeho lodi.
sv: Meneldur samlade ihop en besättning med trogna elenser, kraftiga spjutmän, och hänsynslösa sabelsvingare. Han fick också många bågskyttar från sitt alvhem i nordländerna att segla med honom på hans skepp.

source: Move Meneldur and Madru to the Explorer (southwest of the map)
ca: Meneja Meneldur al Explorador
cs: Přesuň Meneldura a Madru k Průzkumníkovi (na jihozápadě mapy)
pl: Doprowadź Meneldura do zacumowanego Odkrywcy
sv: För Meneldur till Utforskaren

source: Orcs! Kill them!
ca: Orcs! Mateu-los!
cs: Skřeti! Zabte je!
pl: Orkowie! Zabić ich!
sv: Orcher! Döda dem!

source: A bridge! What may be across it?
ca: Un pont! Què hi haurà a l'altra banda?
cs: Most! Co může být na druhé straně?
pl: Most! Co sądzisz o tym żebyśmy go przekroczyli?
sv: En bro! Vad tror du ligger på andra sidan?

source: You find 100 gold pieces in the orc's castle.
ca: Trobes 100 peces d'or dins del castell de l'orc.
cs: Ve skřetí tvrzi jsi našel 100 zlatých.
sv: Du finner 100 guld i orchborgen.

source: Pakch-Glun
cs: Pakš-Glun

source: Yes, there is no one on this island, but what about that one to the west? The water is shallow enough to wade over there, let's see if there are people there.
ca: Sí, no hi ha ningú en aquesta illa, però que passa amb l'altra a l'oest? L'aigua no es prou profunda com per a no poder travessar-la, anem a veure si n'hi ha gent allà.
cs: Ano, na tomto ostrově nikdo není, ale kdo je to tam na západě? Voda je dost mělká, aby se dalo přebrodit. Podívejme se, jestli tam žijí nějací lidé.
pl: Tak, nie ma nikogo innego na tej wyspie, ale co myślicie o tej na zachodzie? Woda jest wystarczająco płytka żeby się tam przedostać, zobaczmy czy ktoś tam mieszka.
sv: Ja, det finns ingen på den här ön, men vad tror ni om den västerut? Vattnet är grunt nog för att vada dit. Låt oss se om det finns människor där.

source: Kar-Salazz
ca: Kal-Salazz
cs: Kar-Salaz
sv: Kal-Salazz

source: Meneldur, elvish mariner of Elensefar, is driven to sea by the same orcs who attacked the city. He must gather an army willing to fight for him to regain Elensefar, his adopted homeland.
ca: Meneldur, un mariner elf d'Elensefar, es veu abocat al mar pels mateixos orcs que havien atacat la ciutat. Haurà de reunir un exèrcit que estiga disposat a lluitar per Elensefar, la seua pàtria d'adopció.
cs: Meneldur, elfí námořník z Elensefaru, je vyhnán na moře skřety, kteří zaútočili na město. Musí shromáždit vojsko ochotné bojovat za osvobození Elensefaru, svého adoptivního domova.
sv: Meneldur, alvsjöman från Elensefar, fördrivs till sjöss av samma orcher som anfaller staden. Han måste samla ihop en armé som är villig att slåss för att återta Elensefar, hans hem.

source: (Expert level, 4 - 22 scenarios.)
ca: (Nivel experto, 4 - 22 escenarios.)
cs: (Úroveň expert, 4 až 22 scénářů – podle zvolené cesty.)
sv: (Expertnivå, 4 - 22 scenarion.)

source: Easy
cs: Lehká

source: Normal
cs: Normální

source: Challenging
cs: Náročná

source: Campaign Design
cs: Návrh tažení

source: Campaign Maintenance
cs: Údržba tažení

source: WML Contributors
cs: Skriptování tažení

source: Artwork and Graphics Design
cs: Kresby a grafika

source: Translations
cs: Překlady

source: Handran
ca: Aldran
pl: Aldran
sv: Aldran

source: Padrun
ca: Madru
pl: Madru
sv: Madru
